{
    "cv": {
        "full_name": "13405733",
        "skills": "engagement. Innovative and driven with passion for delivering forward thinking, emerging trend technologies. Skills Integrated agile methodologies, emerging AI, digital, and social media technologies into end-user experience to foster adoption, continued",
        "experience": "Dynamic Information Technology Manager with 13 years of IT leadership experience including oversight of infrastructure, application support and Plays key role in on-going network design, reevaluation and optimization to keep pace with company growth. Integrated agile methodologies, emerging AI, digital, and social media technologies into end-user experience to foster adoption, continued Certified [Job Title] , [Company Name] - [Timeframe]",
        "education": "Education Western Governors University - City , State University Of South Carolina - Columbia - State"
    },
    "top_cosine_jobs": [
        {
            "job_position": "Social Media & Digital Marketing Lecturer",
            "company_name": "ROI Academy",
            "job_description": "Company DescriptionROI Academy is a training center that specializes in professional courses in the field of information technology. Established on September 6, 2019, ROI Academy has physical locations in Kosovo, Albania, and North Macedonia. The training programs offered cover various fields, including Video Editing, as well as Programming, Digital Marketing, Graphic Design, Video Animation, and Cybersecurity.Role DescriptionThis is a part-time on-site role in Skopje for a Digital Marketing Lecturer. The Social Media & Digital Marketing Lecturer will be responsible for providing instruction on Social Media Marketing & Management, SEO, Google Ads, and Email Marketing.Qualifications & Experience:- Minimum 3-4 years of professional experience in Digital Marketing.- Strong understanding of Digital Marketing strategies, including SEO, SEM, Social Media Marketing, Email Marketing, and Content Marketing.- Familiarity with marketing analytics tools such as Google Analytics, Facebook Business Manager, and SEO tools.Key Responsibilities:- Deliver engaging and practical lectures on Digital Marketing topics.- Develop course materials, presentations, and hands-on exercises.- Guide students through real-world digital marketing case studies and projects.- Stay updated with the latest digital marketing trends and tools.- Evaluate student performance and provide constructive feedback.- Collaborate with the academy’s team to enhance course offerings.",
            "score": 0.14885017358487612
        },
        {
            "job_position": "Technical Customer Success Manager",
            "company_name": "Blackfluo.ai",
            "job_description": "Job Description:Location: Fully remote, EU timezone (CET +/- 2hours)Start date: ASAPLanguages: Fluent English is mandatoryIndustry: Cloud Computing / Web3 / AI - European SaasBlackfluo.ai is a fully remote company with teams located around the globe. We specialize in developing SaaS solutions for businesses and consulting firms. Our innovative AI assistant is designed to support daily operations by taking over repetitive and time-consuming tasks, allowing our clients to focus on what truly matters.Responsibilities:Direct Customer Engagement: Take an active, hands-on approach to customer communication, personally responding to inquiries, feedback, and reviews across all channels, including emails, social media, community forums, and particularly app stores. Your direct responses will not only resolve issues but also build trust and loyalty among our customer base.Voice of the Customer: Champion the customer's voice ensuring that feedback gathered from direct interactions is clearly communicated and acted upon.Automation and Efficiency: Implement and optimize AI-driven tools and other technologies to streamline routine support tasks, aiming for faster and more effective resolutions to customer inquiries.Multi-Channel Support Management: Oversee a cohesive and integrated customer support strategy across various platforms to ensure a seamless and high-quality customer experience.Knowledge Base and FAQ Enrichment: Regularly update our knowledge ensuring that our self-help tools are accurate, comprehensive, and effective.Cross-Functional Collaboration: inform and influence product development, feature prioritization, and issue resolution, ensuring a customer-centric approach in all product decisions.Skills and Competencies:Exceptional Direct Communication Skills: Demonstrated ability to engage directly with customers across multiple channels, providing empathetic, clear, and effective responses to inquiries, feedback, and reviews. Your communication skills bridge the gap between our customers and our product, making you the face and voice of our clients brand.Advanced Technical Proficiency and Tool Use: Experience with customer support platforms (e.g., Zendesk, Salesforce), feedback management on digital platforms (e.g., Google Play Store, Apple App Store), and agile collaboration tools (e.g., JIRA, Confluence) to ensure efficient operation and continuous improvement of the support function.Qualifications:A relevant diploma or associate degree in Business Administration, Communication, or a related field. While a Bachelors degree is advantageous, we highly value practical experience and specific skills in our candidates.A minimum of 8 years of experience in customer support, with a focus on digital or tech products. Experience in a leadership role is a plus.Demonstrated proficiency in using customer support technologies, including experience with CRM platforms (e.g., Zendesk, Salesforce) and familiarity with managing feedback on digital platforms (e.g., Google Play Store, Apple App Store).Solid understanding of agile methodologies and experience with collaboration tools such as JIRA and Confluence, showcasing the ability to work effectively in a dynamic and fast-paced environment.Fluency in English is a must (written and spoken)Web3 / Blockchain experience is a ++",
            "score": 0.13559091067690593
        },
        {
            "job_position": "R&D Full-Stack AI Engineer & Data Scientist",
            "company_name": "Deltatre",
            "job_description": "In this role you will research, develop and test cutting-edge algorithms/models to analyze diverse sources of data. Additionally, you will produce new Demo and Proof of Concepts (small-scale projects to test the feasibility of new ideas) that will become part of Deltatre Innovation Lab assets.Curiosity and a desire of continuous learning are highly valued in this role, as you will be working within the Deltatre Innovation Lab. This entity focuses on developing solutions based on advanced technologies to enhance Deltatre’s value proposition.As part of the job, you will:Research, develop, and deploy AI/ML solutions in various contexts like audio, images, video, text, Generative AI, Spatial Computing, etc.Build prototypes and PoCs to assess the feasibility of new AI-driven ideasSupport design and implementation of full-stack applications, including frontend, backend, and infrastructure componentsOptimize and monitor AI models performance and scalabilityExplore and propose emerging technologies and tools in AI and software engineeringWork closely with cross-functional teams to transform prototypes into production-ready solutionsShare knowledge and mentor team members in AI, software development, and best practicesRequirements:3+ years of relevant work experience in the same role or a similar oneProgramming languages – proficiency in Python + experience with one or more of C++/C#/Java/Rust/TypeScript (the more the better)Development Experience in backend (Python, .NET, ASP.NET, Node.js) and/or frontend (React, or Angular)Strong statistical and mathematical foundationExperience with common Data Science toolkits (scikit-learn, Pandas, NumPy, Jupyter Notebooks…)Understanding of common ML/DL libraries and frameworksExperience with at least one the frameworks such as Tensorflow / Pytorch. Both is a plusProblem solving ability, particularly when dealing with large datasetsComfortable in working in international teamsAbility to work independently and be a self-starterAbility to work on multiple projects and sustaining frequent context switchesGood organizational and communication skillsFluent in EnglishCuriosity and desire to learnBonus knowledge:Agile (Scrum) best practicesExperience with platforms for AI model deployment, such as: Azure AI Services, Google Vertex AI, AWS SageMaker, IBM Watson ML StudioInfrastructure & Ops experience (Docker, Kubernetes, Terraform, GitOps, MLOps, or similar).Certifications from MOOCs (fast.ai, Coursera, Stanford, etc.)Experience with public speaking or technical workshops",
            "score": 0.1225551018443277
        }
    ],
    "top_bert_jobs": [
        {
            "job_position": "Systems Engineer - North Macedonia",
            "company_name": "Fortinet",
            "job_description": "Job DescriptionSystems Engineer – North MacedoniaLocation: Remote / North MacedoniaWhy Fortinet?Fortinet is one of the fastest-growing cybersecurity companies in the world. We have proven to be a truly innovative technology driven IT security Company. Fortinet’s mission is to deliver the most innovative, highest-performing network security fabric to secure and simplify IT infrastructures. Today we secure the largest enterprises, service providers and government organizations across the globe.Systems Engineering teamExperienced and passionate professionals, who lead all technical aspects of a sales cycle with the customer, from the initial RFIs, through to RFPs & RFQs when required. This includes the project management and active participation in POCs in partnership with the relevant teams both internally and within the customer and/or commercial partner.Your GoalsMaximize the Fortinet opportunity coverage and brand awareness in the market. Continuously improve knowledge around the Fortinet products and solutions, along with maintaining a deep understanding of the competitive landscape and Fortinet’s ability to provide long lasting protection against the ever-evolving threats. Position Fortinet solutions to the customer, whether this be remotely or in person.Develop relationships with key enterprise partnersAbout YouHave a high aptitude for security technology in network, endpoint and application areas. The CISSP accreditation would also be beneficial.Expert in the current technologies and trends in IT securitystrong understanding of RADIUS, PKI, IKE, Certificates, L2TP, IPSEC, FIREWALL, 802.1Q, MD5, SSH, SSL, SHA1, DES, 3DESAre currently or have previously worked in a pre-sales engineer role, managing end-to-end technical aspects of deals, through to technical closure.Can demonstrate your problem solving skills and how this impacted key wins within your current organization.Understand and can demonstrate your ability to build and maintain customer and partner relationships, including your ability to effectively communicate technically to a range of both external and internal stakeholdersWhat we offer?Competitive basic salary, uncapped commission with progressive multiplicators, employee stock and stock awards, health and welfare benefits.Flexible working approach, this is a field-based role, you can operate from anywhere in North MacedoniaEmpowering and supportive working environment, where you can be yourselfInnovative, collaborative and dynamic company with a double-digit growth over the last decade.Training on the job with many other formal trainings and industry recognized certifications.Our CommitmentFortinet is an equal opportunity employer. We value the diversity in our company, and all qualified applicants will receive consideration for employment without regard to race, colour, religion, gender, sexual orientation, gender identity, nationality in addition to any other applicable legally protected characteristics in the location in which the candidate is applying.",
            "score": 0.930884599685669
        },
        {
            "job_position": "Machine Learning Lead",
            "company_name": "Loka",
            "job_description": "At Loka we use a modern tech stack to support meaningful projects across a huge range of industries. In the last year we’ve helped clients advance the world’s #1 AI reading tutor, eliminate $1B in food waste and develop novel drugs for fighting cancer, all while enjoying every other Friday off. Join us, feed your need to grow and ship projects you believe in with a team you’re proud to lead.We’re seeking a Machine Learning Team Lead to deploy, secure and maintain ML models in production environments, mainly AWS. The ideal candidate will not only apply their technical brilliance but also take a leadership role in contributing positively to Loka’s unique culture.The RoleLead a team of ML engineers in architecting, building and optimizing scalable, cost-efficient ML models and ensuring performance in production environments.Provide constructive team feedback through regular one-on-one meetings and drive technical and professional development.Manage end-to-end ML projects, including data exploration, model development, deployment and scaling while delivering solutions that meet business and client needs.Collaborate with stakeholders to align ML initiatives with strategic objectives, ensuring clear communication with both technical and non-technical audiences.Drive technical innovation within the team by staying current with the latest AI/ML trends, implementing cutting-edge techniques.Foster the team's professional growth by creating development plans and encouraging a positive, collaborative remote working environment.Own the development and automation of ML workflows, including data pipelines and model deployment, with a focus on scalability and efficiency.Ensure strong cross-functional collaboration with Data Engineering, DevOps, BackEnd and other teams to deliver cohesive solutions.Work closely with senior leadership to align ML initiatives with long-term company strategies.Hard Skills Requirements5+ years of experience in machine learning, with 3+ years leading a teamStrong knowledge of Python, ML libraries and frameworks such as PyTorch, HuggingFace and TensorFlowHands-on experience with GenAI solutions using LLMs (even if not at an expert level), including prompt engineering and an understanding of common patterns like RAG and NLQClient-facing experience, including the ability to gather requirements, set expectations and deliver technical presentations, sometimes to non-technical peopleBachelor’s degree in Computer Science, Engineering or related fieldAdditional RequirementsExcellent English language skills - Being a global team, we work entirely in English for meetings, customer calls and business communicationsCV written in EnglishNot Required but Nice to HaveExperience with AWSExperience in consultancy environments or startups, including working directly with clients, managing projects and adapting to different settingsFamiliarity with MLOps best practices and toolsPersonality ProfileCuriosity: Eager to stay ahead in the rapidly evolving ML field and apply new technologiesAutonomy & Positivity: Thrives in a remote, globally distributed teamLeadership: Capable of leading with empathy, motivating team members and fostering a collaborative cultureAdaptability: Comfortable operating with a startup mindset, able to pivot and scale quicklyClient-Focused: Understand client needs and balance them with technical realities to deliver impactful solutionsBenefitsEvery other Friday off (26 extra days off a year)Remote and flexibleExplore and Relocation programs (three months work abroad or full international relo)Paid sick days and local holidaysPremium mental health subscriptionsAccess to LokaLabs™, our internal research and development programLokaLabs incubatorFitness subscriptionMental wellness programsDefined career pathBusiness English classesYour achievements matter to us! Ensure your CV, LinkedIn and GitHub profiles are up to date and accurately reflect your experience.",
            "score": 0.9187353849411011
        },
        {
            "job_position": "Back-End Software Engineer",
            "company_name": "Worldly",
            "job_description": "Backend Software EngineerLocation: Remote in South or Central America (Brazil, Colombia, Mexico preferred)About WorldlyWorldly is the world’s most comprehensive impact intelligence platform — delivering real data to businesses on impacts within their supply chain. Worldly is trusted by 40,000 global brands, retailers, and manufacturers to provide the single source of ESG intelligence they need to accelerate business and industry transformation.Through strategic and meaningful customer relationships, Worldly provides key insights into supplier performance, product impact, trends analysis, and compliance. When a company wants to change how business is done, we enable that systemic shift.Backed by a dedicated global team of individuals aligned by values, Worldly proudly operates as a public benefit corporation with backing from mission-aligned investors. Want to learn more? Read our story.About The RoleAs a Software Developer at Worldly, you will play a crucial role in the development and maintenance of our platform. You'll be an integral member of the Data Architecture Team, focusing on software development for data collection, transformation, and analysis. This role involves shaping our data strategy and ensuring data integrity and quality.We are looking for a talented individual with expertise in JavaScript, Node.js, and TypeScript, as well as experience with both relational and non-relational databases, such as PostgreSQL and CouchDB. The ideal candidate will have a passion for technology and a strong desire to contribute to the success of our projects.What You'll DoCollaborate in the development and maintenance of our platform. This includes coding, debugging, and troubleshooting to ensure optimal functionality. Develop software solutions for data collection, transformation, and analysis. Collaborate on shaping the data strategy to meet business objectives while ensuring data integrity and quality. Develop APIs for seamless data integration and exports, enabling efficient data exchange and interaction. Collaborate closely with the product management team to understand requirements, prioritize tasks, and deliver solutions that meet business objectives. Participate in code reviews and contribute to the improvement of coding standards and development processes. We'd Like to SeeBachelor’s degree in computer science, Engineering, or related field. 5+ years of experience in backend development, with a focus on JavaScript, Node.js, and TypeScript. Proven expertise in designing and working with relational and non-relational databases, such as PostgreSQL and CouchDB. Strong data-related skills, including data analysis, manipulation, and visualization, with experience in handling large datasets. Experience working closely with product management teams to translate requirements into technical solutions. Excellent problem-solving skills and attention to detail. Strong communication and collaboration skills, with the ability to work effectively in a cross-functional team environment. It Helps If You HaveHigh level of detail orientationA proactive mindset and ability to work independently as well as within cross-functional squads. Experience writing unit and integration tests, Jest experience a plus. Experience with GIT and the ability to determine the approach in handling code and repository management (forking, branching, merging, and rebasing)What We Can Offer YouComprehensive benefits offerings. 90% employee premium and 75% spouse/dependent premium covered by Worldly. Company-sponsored 401k with up to 4% match. Incentive Stock Options100% Parental Paid LeaveUnlimited PTO 13 company holidaysLife at WorldlyOur team is motivated to transform the way products are made. By helping our customers succeed in a new era of sustainable production, we can build technology that makes a difference on a planetary level.Our team represents over 15 countries and brings unique experiences from technology to farming to the table. Surround yourself with kind, enthusiastic, and dedicated people who put collaboration and growth at the center of our shared goals.Benefits And PerksEarn a competitive salary and performance-based bonuses. Get healthcare, retirement matching, and equity for US employees. Use the office stipend to get the supplies you need. Combat Zoom fatigue with no-meeting Fridays. Flexible time off. Take the time you need to recharge. Our culture encourages team members to explore and rest to be their best selves. We're remote, not lonely. Join the culture committee, coffee chats, or a variety of other interest groups. Equity StatementWe believe it’s essential to reflect the diversity of those we strive to serve. True innovation happens when everyone has room at the table, including the tools, resources, and opportunity to excel. We’re dedicated to building a culturally and experientially diverse team that leads and works with empathy and respect.Compensation$30,000 - $34,500 USD Annual Salary (South/Central America)$40,000 - $46,000 USD Annual Salary (Balkan Region - Europe)5% Annual BonusEquity Stock Options ProgramFinal compensation figures will be determined based on a wide variety of factors, including experience and location. These factors will be evaluated and considered by Worldly throughout the entirety of this process. Compensation Range: $30K - $46K",
            "score": 0.9159790277481079
        }
    ]
}