{
    "cv": {
        "full_name": "27770859",
        "skills": "Duties ranged from day-to-day troubleshooting to implementing new technologies, such as the first ever Apple Airport WiFi network and Skills",
        "experience": "I am a jack of all trades IT guy at one of the premier intellectual property law schools in the world, whose job description and responsibilities Vast help desk experience Project management Team leadership Innovative legal experience Experience Extensive hardware knowledge and experience, especially with Apple, Micron, Lenovo, Dell, HP Laserjets, Canon MFDs, and Xerox MFDs.",
        "education": "Education University of New Hampshire School of Law, formerly Franklin Pierce Law Center University of New Hampshire School of Law, formerly Franklin Pierce Law Center"
    },
    "top_cosine_jobs": [
        {
            "job_position": "Senior Test Automation Engineer",
            "company_name": "Netcetera",
            "job_description": "We are a team of experts who work together to design and develop software that matters. Netcetera strongly believes in and supports continuous professional development. We care about our well-being. At Netcetera, we share our expertise, foster exchange, and appreciate different approaches. Respect, reliability, commitment, and professionalism define us. Our teams work with agile development methodologies and use the latest technology. Netcetera specialists are part of an extensive network within the IT industry.As a Senior Test Automation Engineer you'll work in a very dynamic team of professionals assuring that our software products gets maximum support and reliability. We're looking for a bright, talented, experienced and responsible individual with great technical background, but in the same time a team player and someone who can stood up for the new demanding challenges on a daily basis. The ideal candidate must be self-organizing, proactive, self-starter and able to seek out information.Looking for a new challenge? Take the next big step in your career!The job ad is valid until 31.12.2024Your role: Designing, developing, and refining of automated testsPlanning, implementation, and execution of tests in the Mobile Payment/Authentication areaExtending the existing automated test framework covering aspects like functional tests, error provocation, performance tests and high-availability testsEnsuring high test coverage using automated continues integration testsTesting, qualification and ensuring quality of the delivered team artifacts for all customer projectsPresenting status and issues in clear concise manner to appropriate levels in managementWorking in conjunction with Product Management, Operations team and other stakeholdersBe able to function in a matrix environment with multiple stake holder often with competing priorities and requirements and with strict timelinesEvaluating new testing tools and provide POCsRequirementsYour profile:Bachelor's or Master's degree in Computer science, Information Science or related educational area from an education institution with strong reputation8+ years overall IT experience involving:Agile Methodologies, ScrumTest Management ToolsContinuous Integration through Jenkins, CI/CDManual Testing, API Testing experienceTest Automation experience:Good programming skills with one or more programming languages (e.g. Java, Perl, Shell and Bash Scripting)Good knowledge of Java, Spring Boot, Hibernate, Apache MavenPerformance Testing experience is nice to haveGood knowledge of HTTP(S), JMS and other modern protocolsGit, Stash and BitbucketExperience with DevOps tools and workflows such as Jira, Bamboo or equivalentsKnowledge of cryptography, authentication and authorization schemes and protocolsGood knowledge of databases and SQLKnowledge of any Linux OS (e.g. CentOS) i.e. should be familiar with Linux OS server deployment, starting/stopping processes, checking logs, sound knowledge of Linux/Unix CommandLineHands on experience of using Tools like - SOAPUI, Postman, SQL Developer etcKnowledge of different testing types like Unit, Integration, Regression, Functional etcExcellent written communication skills, as well as verbal; must be able to articulate technical aspects of solution/services to business executives and customersProven experience working in a distributed team setup and/or international teamAbility to:Translate business requirements into use case or test case and plan test activitiesDrive strategy through influence with leadership qualities which engineers recognize and respectInnovate and lead explorations into new technologies and strategiesEvaluate new technologies or tools, stay abreast with industry trendsNice to have knowledge in some of the listed technologies:DockerCucumberMicroservicesBenefits Flexibility: Adjust your time to work efficiently, be it working hours, part-time options, home office, or unpaid leave Extra vacation days: Need to take some extra time off? With us, you have the possibility to activate 5 additional paid days per year on top of your vacation plan Private health & Family Insurance: The company policy covers a private health insurance plan for you and your family Yearly Education Fund: We strongly believe in continuous development and would love to see you enrich your knowledge. Ever Netceterian has a dedicated yearly fund to invest in their professional and personal development through conferences, courses, lectures or long-term education Meals & Snacks: Enjoy a lunch allowance each working day, free fruit and drinks in the officeDiscover more benefits",
            "score": 0.0655557051643491
        },
        {
            "job_position": "Verilog Design Verification Engineer",
            "company_name": "YO IT CONSULTING",
            "job_description": "Hardware Design DeveloperExperience: 3 - 25 YearsLocation: - Permanent Remote anywhere in the WorldContract Length: 6 MonthsType: Full time contract(8 hrs/day) Overlap Hours: 4 hrs/day with PSTMandatory SkillsOverall - 5 years of exp.Min of 2 years of relevant experience in Hardware Design and/or Hardware VerificationExperience With One Or More On The List Below>ASIC>VLSI>FPGA>SOCExperience with one or more on the list below>SystemVerilog development>Verilog development>Testbench development and/or verification.Good communication skills in English.LLM experience is not mandatory, however, the candidate should be fine to work as a LLM Engineer for Verilog.Must-HaveBS or MS degree in Electrical, Engineering, or related field.3-5 years of proven experience in hardware design development.Expertise in HDLs such as Verilog, SystemVerilog, VHDL, and SystemC.Expertise in scripting, front-end and verification workflows, and integrations within the hardware design environment.Expertise in UVM environmentsExpertise in Formal VerificationExpertise in Lint process and refinementGood communication skills in EnglishJob DescriptionWe're searching for an exceptional hardware design Developer to play a pivotal role in using the hardware design platform to generate the training data to enhance enterprise LLMs' capabilities. This unique position offers the chance to directly contribute to the sophistication of enterprise LLMs, ensuring they operate with unparalleled efficiency and intelligence.Your MissionDevelop, configure, and customize the hardware design platform, utilizing it to generate vital training data for enterprise LLMs.Liaise with research teams to translate requirements into actionable data insights, directly impacting our LLMs' performance.Uphold the highest standards in coding, debugging, and documentation, ensuring the hardware design solutions are optimized for LLM training and benchmarking.Collaborate across teams to identify and prioritize needs, contributing to the LLMs' ability to understand and automate complex processes.We NeedBS or MS degree in Electrical, Engineering, or related field.3-5 years of proven experience in hardware design development.Expertise in HDLs such as Verilog, SystemVerilog, VHDL, and SystemC.Expertise in scripting, front-end and verification workflows, and integrations within the hardware design environment.Exceptional problem-solving, communication, and collaborative skills.Familiarity with ML and AI systemsSkills: ai systems,verilog-a,soc,communication skills,hdl expertise,formal verification,hdl,integrations within hardware design environment,vhdl,collaboration,lint process refinement,systemverilog development,verification,hdls,knowledge of ml and ai systems,integration,verification workflows,integrations in hardware design,communication,systemverilog,integrations,vlsi,fpga,lint process and refinement,hdls (verilog, systemverilog, vhdl, systemc),uvm environments,electronics hardware design,hardware design development,good communication skills,front-end,ai,hardware design,verilog development,systemc,hdls (vhdl, systemc),machine learning,lint process,front-end and verification workflows,scripting,coding,ml,front-end verification workflows,uvm,asic,front-end development,design,integration within hardware design environment,debugging,hardware verification,ml and ai systems,integrations within the hardware design environment,electrical engineering,verilog,problem-solving,familiarity with ml and ai systems,testbench development,documentation,collaborative skills,front-end workflows",
            "score": 0.05531607685873382
        },
        {
            "job_position": "Technical Customer Success Manager",
            "company_name": "Blackfluo.ai",
            "job_description": "Job Description:Location: Fully remote, EU timezone (CET +/- 2hours)Start date: ASAPLanguages: Fluent English is mandatoryIndustry: Cloud Computing / Web3 / AI - European SaasBlackfluo.ai is a fully remote company with teams located around the globe. We specialize in developing SaaS solutions for businesses and consulting firms. Our innovative AI assistant is designed to support daily operations by taking over repetitive and time-consuming tasks, allowing our clients to focus on what truly matters.Responsibilities:Direct Customer Engagement: Take an active, hands-on approach to customer communication, personally responding to inquiries, feedback, and reviews across all channels, including emails, social media, community forums, and particularly app stores. Your direct responses will not only resolve issues but also build trust and loyalty among our customer base.Voice of the Customer: Champion the customer's voice ensuring that feedback gathered from direct interactions is clearly communicated and acted upon.Automation and Efficiency: Implement and optimize AI-driven tools and other technologies to streamline routine support tasks, aiming for faster and more effective resolutions to customer inquiries.Multi-Channel Support Management: Oversee a cohesive and integrated customer support strategy across various platforms to ensure a seamless and high-quality customer experience.Knowledge Base and FAQ Enrichment: Regularly update our knowledge ensuring that our self-help tools are accurate, comprehensive, and effective.Cross-Functional Collaboration: inform and influence product development, feature prioritization, and issue resolution, ensuring a customer-centric approach in all product decisions.Skills and Competencies:Exceptional Direct Communication Skills: Demonstrated ability to engage directly with customers across multiple channels, providing empathetic, clear, and effective responses to inquiries, feedback, and reviews. Your communication skills bridge the gap between our customers and our product, making you the face and voice of our clients brand.Advanced Technical Proficiency and Tool Use: Experience with customer support platforms (e.g., Zendesk, Salesforce), feedback management on digital platforms (e.g., Google Play Store, Apple App Store), and agile collaboration tools (e.g., JIRA, Confluence) to ensure efficient operation and continuous improvement of the support function.Qualifications:A relevant diploma or associate degree in Business Administration, Communication, or a related field. While a Bachelors degree is advantageous, we highly value practical experience and specific skills in our candidates.A minimum of 8 years of experience in customer support, with a focus on digital or tech products. Experience in a leadership role is a plus.Demonstrated proficiency in using customer support technologies, including experience with CRM platforms (e.g., Zendesk, Salesforce) and familiarity with managing feedback on digital platforms (e.g., Google Play Store, Apple App Store).Solid understanding of agile methodologies and experience with collaboration tools such as JIRA and Confluence, showcasing the ability to work effectively in a dynamic and fast-paced environment.Fluency in English is a must (written and spoken)Web3 / Blockchain experience is a ++",
            "score": 0.054607153469240714
        }
    ],
    "top_bert_jobs": [
        {
            "job_position": "C# .net Developer (MacOS) ",
            "company_name": "Hornetsecurity",
            "job_description": "Join our fight against cybercrime and become a crucial part in Software Development! This is a full-time remote position from Macedonia.Your tasks: You will be responsible for creating, improving and maintaining business logic and UI parts of the Emsisoft / Hornetsecurity endpoint protection products that help users around the world to remove malware from their systems and stay protected. This role is specifically dedicated to macOS development.Responsibilities:Primary responsibility is focused on architecture, development and maintenance related to new and existing Emsisoft / Hornetsecurity client software components that are designed to support multiple platforms (macOS and Windows). This involves everything from minor code changes to design of new modules, including writing code, debugging, testing, and documentation.Ability to develop written design specifications from project management input, discussions with key team members and customer feedback.Complete documentation and provide input to improve procedures for installation, development and maintenance processes.Skills and qualifications:Strong background in C#/.net Core development for desktop applications (7+ years). Knowledge of other programming languages, especially Delphi is a major plus.Solid knowledge of macOS and Windows architectures.Hands-on experience in development of macOS daemons.Hands-on experience in crash dump analysis.Knowledge of common source control systems.Fluent verbal and written communication skills in English.Your Benefits:Free space for innovation and independent action in a fast-growing international company.Temporary Employee Exchange Program – we provide the ability for you to work at our global office locations and explore the world (e.g. Berlin, Madrid, Malta, Montréal, Washington D.C.).Team events like Laser Tag, Office Movie Nights, Foodie Fridays and much more – let yourself be surprised!FitKit subscription and private insurance for your health!Unlimited contracts – we’re looking for hornets to grow long-term with us.And, of course, the usual standards such as development opportunities, coffee, tea, soft drinks & fresh fruit, office dogs, no dress code and much more!",
            "score": 0.8772534728050232
        },
        {
            "job_position": "Tech Lead",
            "company_name": "Globaldev Group",
            "job_description": "Bazarr.ai is revolutionizing the fragmented $700B U.S. wholesale market by introducing the AI Broker, an innovative platform that automates procurement between wholesalers and retailers. By enabling real-time bulk trade opportunities, Bazarr.ai reduces delays, inefficiencies, and overstocking. Backed by experienced industry leaders, the company has already achieved $2M GMV within the first month of launching its MVP and onboarded Alibaba's former CTO as an advisor.We're seeking a hands-on Tech Leader to spearhead the development of our core technology and scale our platform to meet growing demand. You will play a critical role in shaping the technical vision, mentoring a team of engineers, and delivering cutting-edge solutions to transform the wholesale market.What You'll Be DoingLeading the development of our core technology infrastructure, focusing on web applications, backend services, and scalable cloud solutionsDesigning, developing, and maintaining our platforms using a variety of programming languages, with a focus on Python and JavaScriptCollaborating closely with the product, design, and operations teams to turn business needs into high-performing technical solutionsEnsuring best practices in code quality, security, and performance across the tech stackExploring and integrating new technologies to solve business problems and enhance product offeringsManaging and mentoring a growing team of engineers, ensuring continuous learning and skill developmentProfessional RequirementsSolid experience in JavaScript (Node.js, and React/Vue/Angular)Experience building and deploying scalable systems, with a focus on microservices and serverless architectureHands-on experience with DevOps tools like Docker, Kubernetes, CI/CD pipelines, and cloud platforms (AWS, GCP, or Azure)Strong understanding of databases (SQL and NoSQL) and experience with data modellingFamiliarity with front-end frameworks and responsive web design principlesAbility to work with APIs (REST, GraphQL) and third-party integrationsExperience in working within an Agile/Scrum environment and using tools like JIRA or TrelloBonus SkillsExperience with AI/ML frameworks or data science toolsKnowledge of mobile development (iOS/Android)Familiarity with security best practices (OAuth, encryption, etc.)Proficiency in Python and frameworks like Django, Flask, or FastAPIPersonal RequirementsProblem solver: You approach challenges with creativity and determination, constantly finding new ways to solve tough technical problemsAdaptable: You thrive in a fast-paced environment and are comfortable learning and implementing new technologies as neededLeader and mentor: You are excited to lead a team, share your knowledge, and help others grow in their rolesPassionate: You are driven by building impactful solutions and take pride in delivering high-quality workCommunication skills: You can clearly articulate complex technical ideas to both tech and non-tech audiences, collaborating effectively across teamsOwnership mindset: You take initiative and full responsibility for the success of the tech platform, from concept to executionWhat We OfferCompetitive salary and benefits package;Flexible remote work arrangements;Opportunities for professional development and growth;Periodic review of the salary;Paid events attendance;Let's build something amazing together!",
            "score": 0.8754732608795166
        },
        {
            "job_position": "Software Engineer",
            "company_name": "JWP (JW Player)",
            "job_description": "About JWP Connatix:JWP Connatix is the most comprehensive independent video technology and monetization platform, helping broadcasters, publishers, and advertisers deliver premium streaming and online video experiences while maximizing video revenue across all screens. The company offers an end-to-end platform that streamlines live and on-demand video with hybrid monetization models, unique data and insights, unmatched customer service, and the largest independent premium video marketplace, providing the entire media ecosystem with enhanced scale, transparency, and revenue.Our video players are embedded directly on publisher sites including Accuweather, Axel Springer, Dotdash Meredith, McClatchy, Penske Media Co., and more.We work with leading brands and agencies including American Express, Citi, Dentsu, Mars, UM, and more helping them target ads against our publishers' video content.We power streaming for over 2,000 blue-chip media companies, including 80% of the top 25 Comscore US publishers. As the largest independent global video network across CTV and OLV, we reach over 1B unique users and deliver 30B+ combined video plays and ad impressions every month.Flexible Work Policy:At JWP Connatix, we support a flexible work policy, with most employees working remotely. However, to align with our operational needs, we can only consider candidates residing in the same country as the job posting. This means applicants located outside the job's designated country will not be considered, and relocation assistance is unavailable.The Engineering Team:Our Engineering team at JWP Connatix is composed of passionate problem-solvers dedicated to building cutting-edge technology solutions. With a focus on monetizing customer content across billions of devices, our engineers thrive on innovation and collaboration. As part of this team, you will work closely with product and engineering leaders to develop frameworks and standards that impact the entire organization, driving efficiency and excellence across all projects.The Opportunity:We are looking for a talented and passionate Software Engineer to join our influential team, driving innovation and setting the standard for back-end development across our organization. You will play a crucial role in architecting scalable solutions, enhancing productivity through reusable components, and ensuring a consistent user experience across our products. This role offers the opportunity to work with a modern tech stack, contribute to industry-leading solutions, and keep our systems at the forefront of technology.As a Software Engineer, you will:Architect, design, and build robust, scalable back-end solutions to deliver a seamless customer experience across our product suite.Lead the implementation and deployment of critical platform components, ensuring reliability, performance optimization, and adherence to best practices.Work closely with product engineering teams to guide the integration of platform services, providing technical expertise and strategic direction.Identify and resolve performance bottlenecks, system failures, and operational challenges, proactively enhancing platform performance.Foster a culture of continuous improvement by driving process automation and implementing advanced observability protocols.Collaborate with early-career engineers, promoting technical excellence and professional development within the team.Stay updated on industry trends and emerging technologies, advocating for their integration into our platform architecture when appropriate.Requirements for the role:3+ years of experience in back-end engineering, with a track record of designing and developing large-scale, distributed systems.Proficiency in one or more programming languages: Python, Java, or Go.Experience with cloud platforms such as AWS, Azure, or GCP.Solid understanding of microservices architecture, containerization tools (Docker, Kubernetes), and infrastructure automation (Terraform, CloudFormation).Hands-on experience with CI/CD pipelines, automated testing, and deployment methodologies.Excellent problem-solving, organizational, and analytical skills.Strong communication and collaboration abilities, thriving in cross-functional environments.Bonus Points:Bachelor's or Master's degree in Computer Science, Engineering, or a related field.Experience with NoSQL databases, particularly Cassandra.Familiarity with large-scale data processing and analytics systems.Perks of being at JWP Connatix, North MacedoniaOur goal is to take care of you and ensure you will be successful in your new role. Your success is our success!As a full time employee, you will qualify for:Private Medical Insurance25 Paid Time OffNew Employee Home Office Setup StipendMonthly Connectivity StipendProfessional Development Reimbursement Program & Career Development ProgressionBi-Annual Hack Weeks for those who are interested in using their coding knowledgeFireside chats with individuals at JWP ConnatixCheck out our website and social channels: JWP ConnatixWe are an equal opportunity employer and value diversity at our company. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, and/or disability status.",
            "score": 0.8717623353004456
        }
    ]
}