{
    "cv": {
        "full_name": "20237244",
        "skills": "Technical Skills and Qualifications",
        "experience": "Information Security Analyst/Systems professional with over 16 years of diverse experience across the analysis, troubleshooting, management and testing of complex IT systems. Â Experience includesÂ analytical support to computer surveillance activities in Cyber Security, Intrusion detection Work Experience",
        "education": "Education and Training 2018 Park University ï¼​ City , State , United States Bachelor of Science Information and Computer Science Emphasis in Network Security"
    },
    "top_cosine_jobs": [
        {
            "job_position": "Information Security Officer",
            "company_name": "Semos Cloud",
            "job_description": "Role SummaryWe are looking for a motivated Information Security Officer (ISO) to support our security efforts across the organization. In this role, you will contribute to securing our product, protecting company assets, and providing security assurance to our customers. This position is perfect for someone with a solid background in information security who is eager to take on practical responsibilities and grow in a SaaS environment.Key ResponsibilitiesAs an Information Security Officer, you will work in three main areas: Secure the Product and Infrastructure (Security Engineering), Protect the Company (Security Operations), and Assure the Customer (Security Assurance). Your specific tasks will include:Secure the Product and Infrastructure - Security EngineeringApplication and Infrastructure Security:Conduct security assessments and tests before and after deployment to spot vulnerabilities.Help find flaws in software configurations, detect malicious code, and manage patches or upgrades.Assist in putting a secure software development lifecycle (SDLC) into place and help train developers on current security best practices.Conduct security assessments for our PaaS and IaaS providers to ensure compliance with security standards.Enrich product security by implementing and improving the security measures by default and by design Security Research:Support research into vulnerabilities in company assets and SaaS applications we use.Assist in tracking fixes to ensure vulnerabilities are resolved on time.Protect The Company - Security OperationsSecurity Measures:Help put security measures in place and monitor them to protect the company and its assets.Security Improvements:Support efforts to improve security for the product and the company.Penetration Testing:Take part in realistic cyber attack simulations against company systems, property, and employees to find weaknesses.Incident Management:Help identify security anomalies and events, and support the Security Incident Response Team (SIRT) in handling incidents.Assure the Customer - Security AssuranceSecurity Compliance:Support the governance, risk, and compliance program tailored for SaaS as part of the second line of defense.Help keep a certification roadmap on track based on customer needs, including ISO 27001 and SOC 2.Assist in checking security controls, supporting fixes for audit findings, and participating in external certification audits.Risk and Field Security:Assist in supporting customer assurance activities as part of the company’s security team by providing materials, RFP updates, and customer assistance.Help to respond to customer inquiries and manage security questions accurately and on time, reporting any risks or trends you notice.Contribute to maintaining a Third Party Risk Management program to handle risks from external vendors.Develop and maintain security awareness training programs for employees to mitigate human-related security risks.To be successful in this role, you need Bachelor’s degree in Computer Science, Information Security, or a related field.3-5 years of experience in information security.Proficiency in English, both written and spoken.Good technical knowledge in areas like application security, vulnerability research, penetration testing, incident response, and security compliance.Familiarity with SaaS security and compliance frameworks such as ISO 27001 and SOC 2.Familiarity with security aspects of PaaS and IaaS providers (Azure, AWS)Hands-on experience with risk assessments, vulnerability management, security testing tools, and preparing and maintaining security documentation (white papers, policies, and guidelines).Strong communication and teamwork skills, with the ability to collaborate with technical teams, developers, and customers.Nice to HaveExperience in a B2B SaaS setting is a plus.Some understanding of data privacy regulations and compliance needs.Eagerness to learn and grow in a fast-moving security environment.Reasons to join our team Already proven, qualified, certified to play in the Champs League.  Truly global, enterprise customer base & brands to grow. In serving customers, together we grow for a better world. Read more about our customers here  You get to play with superb innovative cloud technology and agile working framework Learn more about our platform here  Our people at placed the center of the business. Dynamic SaaS, visionary leadership, and team spirit to win Learn more about us here  Our values derive from our people-centered culture. We are culture believers, driven by continuous growth, quick to move from planning to action, fearless in experimenting, and humbly working to change the world for the better. Read more about our culture here What We OfferCompetitive Salary Private Health Insurance Referral Bonus Program Hybrid Work Training and Coaching Opportunities Culture Fest (tickets for cultural events) Ergonomic workspace with kitchen offering healthy food options and beverages Sportmaster or FitKit Membership Psychological Health Support Program Off-site Team Building Events Office Skopje (hybrid)Team Legal & ComplianceReport toHead of LegalWorking Hours Monday – Friday 09:00 – 17:00 CET",
            "score": 0.27487085236775144
        },
        {
            "job_position": "Frontend (Angular2+) Developer",
            "company_name": "Sourcico",
            "job_description": "DescriptionAbout the Project:Security industry leaders and professionals with more than 20 years of deep technological experience in various fields of the market require the highest cybersecurity hygiene standards for cloud services and embedded software development. Working on development and management of systems considered as the bleeding edge of the technology helping our customers to mitigate security gaps in their products and shift out of IoT threats in seconds.Requirements:5+ years of Frontend Software Development5+ years' experience developing REST API clients, utilizing OAuth and JWT5+ years' experience in ES6+5+ years of experience working with Angular widget-driven developmentD3.js is a mustProficiency in NGRXGood understanding of secure client-server communicationUnderstanding of GIT and CI/CD practices, JIRAExperience implementing solutions working low level with network protocols is good to haveExperience in developing cybersecurity solution backend or frontend is a big advantageFamiliarity with K8S, Terraform, and the containerized environment is a big advantageExperience working with cloud environments AWSB.Sc. in Computer Science / Electrical Engineering or equivalent experienceCan-do attitudeIndustry:Cyber security and IoTAt Sourcico We Offer:A competitive salaryA comprehensive benefits package, including health, retirement plan, paid time off, etc.A flexible and hybrid work environmentA supportive and collaborative work cultureA chance to work on exciting and challenging projects with diverse clientsAn opportunity to grow and advance your career with continuous learning and developmentIf you are interested in joining our team, please apply now by sending your resume and cover letter. More details and application link are available here: https://sourcico.com/careers/?positionID=STP-1332We look forward to hearing from you soon!",
            "score": 0.13363636406506085
        },
        {
            "job_position": "Data Scientist - LLM",
            "company_name": "YO IT CONSULTING",
            "job_description": "Python Data Scientist/AnalystExperience: 4 - 20 YearsLocation: - Anywhere in the World - Permanent RemoteContract Duration:  6-12 monthsWork Hours: 5 hours overlap with PST time zoneStandard work hours are 8 AM PST - 4 PM PST.Must-HaveBachelor’s/Master’s degree in Engineering, Computer Science (or equivalent experience) At least 4 years of relevant experience as a data scientist 3+ years of data analysis experience and a desire to have a significant impact on the field of artificial intelligence 4+ years of experience working with Python programming.Fluent in conversational and written English communication skills.Job DescriptionWe are actively seeking talented Data Scientists & Analysts proficient in Python to join our ambitious team dedicated to pushing the frontiers of AI technology. This opportunity is tailored for professionals who thrive on developing innovative solutions and aspire to be at the forefront of AI advancements. You will work with companies in the US looking to develop cutting-edge commercial and research AI solutions.Job ResponsibilitiesWrite effective Python code to tackle complex issues, but also use your business sense and analytical abilities to glean valuable insights from public databases Communicate clearly with researchers and help the organization in realizing its objectives Clearly express the reasoning and logic when writing code in Jupyter notebooks, or other suitable mediums Fix bugs in the code and create thorough documentation Utilize extensive data analysis skills to develop and respond to important business queries using available datasets (such as those from Kaggle, the UN, the US government, etc.) Effectively communicate with the researchers to comprehend the needs and provide the resultsJob RequirementsBachelor’s/Master’s degree in Engineering, Computer Science (or equivalent experience) At least 4 years of relevant experience as a data scientist 3+ years of data analysis experience and a desire to have a significant impact on the field of artificial intelligence 4+ years of experience working with Python programming Strong data analytic abilities and business sense are required to draw the appropriate conclusions from the dataset, respond to those conclusions, and clearly convey the key findings Excellent problem-solving and analytical skills Excellent communication abilities to work with stakeholders and researchers successfully Fluent in conversational and written English communication skills Skills: computer science,problem-solving skills,bug fixing,spoken communication,conversational english communication skills,written english communication skills,data scientist,communication skills,problem-solving,us government datasets,python code,english communication,written english communication,stakeholder management,business sense,python code writing,data analysis,extensive data analysis,conversational english,analytical abilities,excellent communication abilities,engineering,data analysis skills,data,documentation,business queries,data analyst,communication abilities,artificial intelligence,data analytic abilities,coding,data science,un datasets,python,english communication skills,communication,written and conversational english communication,conversational english communication,kaggle datasets,bachelor’s/master’s degree in engineering,jupyter notebooks,stakeholder communication,analytical skills,data analytics,problem solving,ai technology,python programming,programming,data analytic,written communication",
            "score": 0.11568011864029537
        }
    ],
    "top_bert_jobs": [
        {
            "job_position": "Systems Engineer - North Macedonia",
            "company_name": "Fortinet",
            "job_description": "Job DescriptionSystems Engineer – North MacedoniaLocation: Remote / North MacedoniaWhy Fortinet?Fortinet is one of the fastest-growing cybersecurity companies in the world. We have proven to be a truly innovative technology driven IT security Company. Fortinet’s mission is to deliver the most innovative, highest-performing network security fabric to secure and simplify IT infrastructures. Today we secure the largest enterprises, service providers and government organizations across the globe.Systems Engineering teamExperienced and passionate professionals, who lead all technical aspects of a sales cycle with the customer, from the initial RFIs, through to RFPs & RFQs when required. This includes the project management and active participation in POCs in partnership with the relevant teams both internally and within the customer and/or commercial partner.Your GoalsMaximize the Fortinet opportunity coverage and brand awareness in the market. Continuously improve knowledge around the Fortinet products and solutions, along with maintaining a deep understanding of the competitive landscape and Fortinet’s ability to provide long lasting protection against the ever-evolving threats. Position Fortinet solutions to the customer, whether this be remotely or in person.Develop relationships with key enterprise partnersAbout YouHave a high aptitude for security technology in network, endpoint and application areas. The CISSP accreditation would also be beneficial.Expert in the current technologies and trends in IT securitystrong understanding of RADIUS, PKI, IKE, Certificates, L2TP, IPSEC, FIREWALL, 802.1Q, MD5, SSH, SSL, SHA1, DES, 3DESAre currently or have previously worked in a pre-sales engineer role, managing end-to-end technical aspects of deals, through to technical closure.Can demonstrate your problem solving skills and how this impacted key wins within your current organization.Understand and can demonstrate your ability to build and maintain customer and partner relationships, including your ability to effectively communicate technically to a range of both external and internal stakeholdersWhat we offer?Competitive basic salary, uncapped commission with progressive multiplicators, employee stock and stock awards, health and welfare benefits.Flexible working approach, this is a field-based role, you can operate from anywhere in North MacedoniaEmpowering and supportive working environment, where you can be yourselfInnovative, collaborative and dynamic company with a double-digit growth over the last decade.Training on the job with many other formal trainings and industry recognized certifications.Our CommitmentFortinet is an equal opportunity employer. We value the diversity in our company, and all qualified applicants will receive consideration for employment without regard to race, colour, religion, gender, sexual orientation, gender identity, nationality in addition to any other applicable legally protected characteristics in the location in which the candidate is applying.",
            "score": 0.8795139193534851
        },
        {
            "job_position": "Data Scientist - LLM",
            "company_name": "YO IT CONSULTING",
            "job_description": "Python Data Scientist/AnalystExperience: 4 - 20 YearsLocation: - Anywhere in the World - Permanent RemoteContract Duration:  6-12 monthsWork Hours: 5 hours overlap with PST time zoneStandard work hours are 8 AM PST - 4 PM PST.Must-HaveBachelor’s/Master’s degree in Engineering, Computer Science (or equivalent experience) At least 4 years of relevant experience as a data scientist 3+ years of data analysis experience and a desire to have a significant impact on the field of artificial intelligence 4+ years of experience working with Python programming.Fluent in conversational and written English communication skills.Job DescriptionWe are actively seeking talented Data Scientists & Analysts proficient in Python to join our ambitious team dedicated to pushing the frontiers of AI technology. This opportunity is tailored for professionals who thrive on developing innovative solutions and aspire to be at the forefront of AI advancements. You will work with companies in the US looking to develop cutting-edge commercial and research AI solutions.Job ResponsibilitiesWrite effective Python code to tackle complex issues, but also use your business sense and analytical abilities to glean valuable insights from public databases Communicate clearly with researchers and help the organization in realizing its objectives Clearly express the reasoning and logic when writing code in Jupyter notebooks, or other suitable mediums Fix bugs in the code and create thorough documentation Utilize extensive data analysis skills to develop and respond to important business queries using available datasets (such as those from Kaggle, the UN, the US government, etc.) Effectively communicate with the researchers to comprehend the needs and provide the resultsJob RequirementsBachelor’s/Master’s degree in Engineering, Computer Science (or equivalent experience) At least 4 years of relevant experience as a data scientist 3+ years of data analysis experience and a desire to have a significant impact on the field of artificial intelligence 4+ years of experience working with Python programming Strong data analytic abilities and business sense are required to draw the appropriate conclusions from the dataset, respond to those conclusions, and clearly convey the key findings Excellent problem-solving and analytical skills Excellent communication abilities to work with stakeholders and researchers successfully Fluent in conversational and written English communication skills Skills: computer science,problem-solving skills,bug fixing,spoken communication,conversational english communication skills,written english communication skills,data scientist,communication skills,problem-solving,us government datasets,python code,english communication,written english communication,stakeholder management,business sense,python code writing,data analysis,extensive data analysis,conversational english,analytical abilities,excellent communication abilities,engineering,data analysis skills,data,documentation,business queries,data analyst,communication abilities,artificial intelligence,data analytic abilities,coding,data science,un datasets,python,english communication skills,communication,written and conversational english communication,conversational english communication,kaggle datasets,bachelor’s/master’s degree in engineering,jupyter notebooks,stakeholder communication,analytical skills,data analytics,problem solving,ai technology,python programming,programming,data analytic,written communication",
            "score": 0.8786230683326721
        },
        {
            "job_position": "Data Scientist - LLM",
            "company_name": "YO IT Group",
            "job_description": "Python Data Scientist/AnalystExperience: 4 - 20 YearsLocation: - Anywhere in the World - Permanent RemoteContract Duration:  6-12 monthsWork Hours: 5 hours overlap with PST time zoneStandard work hours are 8 AM PST - 4 PM PST.Must-HaveBachelor’s/Master’s degree in Engineering, Computer Science (or equivalent experience) At least 4 years of relevant experience as a data scientist 3+ years of data analysis experience and a desire to have a significant impact on the field of artificial intelligence 4+ years of experience working with Python programming.Fluent in conversational and written English communication skills.Job DescriptionWe are actively seeking talented Data Scientists & Analysts proficient in Python to join our ambitious team dedicated to pushing the frontiers of AI technology. This opportunity is tailored for professionals who thrive on developing innovative solutions and aspire to be at the forefront of AI advancements. You will work with companies in the US looking to develop cutting-edge commercial and research AI solutions.Job ResponsibilitiesWrite effective Python code to tackle complex issues, but also use your business sense and analytical abilities to glean valuable insights from public databases Communicate clearly with researchers and help the organization in realizing its objectives Clearly express the reasoning and logic when writing code in Jupyter notebooks, or other suitable mediums Fix bugs in the code and create thorough documentation Utilize extensive data analysis skills to develop and respond to important business queries using available datasets (such as those from Kaggle, the UN, the US government, etc.) Effectively communicate with the researchers to comprehend the needs and provide the resultsJob RequirementsBachelor’s/Master’s degree in Engineering, Computer Science (or equivalent experience) At least 4 years of relevant experience as a data scientist 3+ years of data analysis experience and a desire to have a significant impact on the field of artificial intelligence 4+ years of experience working with Python programming Strong data analytic abilities and business sense are required to draw the appropriate conclusions from the dataset, respond to those conclusions, and clearly convey the key findings Excellent problem-solving and analytical skills Excellent communication abilities to work with stakeholders and researchers successfully Fluent in conversational and written English communication skills Skills: computer science,problem-solving skills,bug fixing,spoken communication,conversational english communication skills,written english communication skills,data scientist,communication skills,problem-solving,us government datasets,python code,english communication,written english communication,stakeholder management,business sense,python code writing,data analysis,extensive data analysis,conversational english,analytical abilities,excellent communication abilities,engineering,data analysis skills,data,documentation,business queries,data analyst,communication abilities,artificial intelligence,data analytic abilities,coding,data science,un datasets,python,english communication skills,communication,written and conversational english communication,conversational english communication,kaggle datasets,bachelor’s/master’s degree in engineering,jupyter notebooks,stakeholder communication,analytical skills,data analytics,problem solving,ai technology,python programming,programming,data analytic,written communication",
            "score": 0.8786230683326721
        }
    ]
}