{
    "cv": {
        "full_name": "31243710",
        "skills": "Skills",
        "experience": "Ten years of management experience with a focus on team building and project management. Ten years of experience as a network engineer and systems administrator. The majority of my experience has been working with Microsoft, Dell, HP, IBM, Symantec, McAfee, Trend Micro and Cisco hardware and software business solutions. I have extensive experience with Microsoft Exchange Server. I am comfortable with Cisco issues. I have experience in business, education, medical and manufacturing environments. Recently, I have been working a great deal with Hyper- VPN Client, Adobe, Foxit Phantom PDF, JobBOSS, Made2Manage ERP, Word, Excel, Access Experience",
        "education": "issues. I have experience in business, education, medical and manufacturing environments. Recently, I have been working a great deal with Hyper- Industries Business, Manufacturing, Education and Medical Education Davenport University - City , State , USA Information Technology Certification Classes Network Engineering A+, Network+, MCSA, CCNA, 1988 Western Michigan University - City , State , USA M.A Counselor Education and Counseling Psychology Administration of Student Personnel Services and Counseling in Post-Secondary Education 1985 Indiana University - City , State , USA B.A Sociology Sociology and Psychology"
    },
    "top_cosine_jobs": [
        {
            "job_position": "Senior Test Automation Engineer",
            "company_name": "Netcetera",
            "job_description": "We are a team of experts who work together to design and develop software that matters. Netcetera strongly believes in and supports continuous professional development. We care about our well-being. At Netcetera, we share our expertise, foster exchange, and appreciate different approaches. Respect, reliability, commitment, and professionalism define us. Our teams work with agile development methodologies and use the latest technology. Netcetera specialists are part of an extensive network within the IT industry.As a Senior Test Automation Engineer you'll work in a very dynamic team of professionals assuring that our software products gets maximum support and reliability. We're looking for a bright, talented, experienced and responsible individual with great technical background, but in the same time a team player and someone who can stood up for the new demanding challenges on a daily basis. The ideal candidate must be self-organizing, proactive, self-starter and able to seek out information.Looking for a new challenge? Take the next big step in your career!The job ad is valid until 31.12.2024Your role: Designing, developing, and refining of automated testsPlanning, implementation, and execution of tests in the Mobile Payment/Authentication areaExtending the existing automated test framework covering aspects like functional tests, error provocation, performance tests and high-availability testsEnsuring high test coverage using automated continues integration testsTesting, qualification and ensuring quality of the delivered team artifacts for all customer projectsPresenting status and issues in clear concise manner to appropriate levels in managementWorking in conjunction with Product Management, Operations team and other stakeholdersBe able to function in a matrix environment with multiple stake holder often with competing priorities and requirements and with strict timelinesEvaluating new testing tools and provide POCsRequirementsYour profile:Bachelor's or Master's degree in Computer science, Information Science or related educational area from an education institution with strong reputation8+ years overall IT experience involving:Agile Methodologies, ScrumTest Management ToolsContinuous Integration through Jenkins, CI/CDManual Testing, API Testing experienceTest Automation experience:Good programming skills with one or more programming languages (e.g. Java, Perl, Shell and Bash Scripting)Good knowledge of Java, Spring Boot, Hibernate, Apache MavenPerformance Testing experience is nice to haveGood knowledge of HTTP(S), JMS and other modern protocolsGit, Stash and BitbucketExperience with DevOps tools and workflows such as Jira, Bamboo or equivalentsKnowledge of cryptography, authentication and authorization schemes and protocolsGood knowledge of databases and SQLKnowledge of any Linux OS (e.g. CentOS) i.e. should be familiar with Linux OS server deployment, starting/stopping processes, checking logs, sound knowledge of Linux/Unix CommandLineHands on experience of using Tools like - SOAPUI, Postman, SQL Developer etcKnowledge of different testing types like Unit, Integration, Regression, Functional etcExcellent written communication skills, as well as verbal; must be able to articulate technical aspects of solution/services to business executives and customersProven experience working in a distributed team setup and/or international teamAbility to:Translate business requirements into use case or test case and plan test activitiesDrive strategy through influence with leadership qualities which engineers recognize and respectInnovate and lead explorations into new technologies and strategiesEvaluate new technologies or tools, stay abreast with industry trendsNice to have knowledge in some of the listed technologies:DockerCucumberMicroservicesBenefits Flexibility: Adjust your time to work efficiently, be it working hours, part-time options, home office, or unpaid leave Extra vacation days: Need to take some extra time off? With us, you have the possibility to activate 5 additional paid days per year on top of your vacation plan Private health & Family Insurance: The company policy covers a private health insurance plan for you and your family Yearly Education Fund: We strongly believe in continuous development and would love to see you enrich your knowledge. Ever Netceterian has a dedicated yearly fund to invest in their professional and personal development through conferences, courses, lectures or long-term education Meals & Snacks: Enjoy a lunch allowance each working day, free fruit and drinks in the officeDiscover more benefits",
            "score": 0.10193197530726929
        },
        {
            "job_position": "Data Scientist",
            "company_name": "Scalefocus",
            "job_description": "Are you a motivated Data Scientist, willing to grow as a professional and work on large-scale projects, using different working approaches that are both diverse and cutting-edge? Are you passionate about innovative and top-notch software solutions and want to be part of like-minded professionals? Do you enjoy working in a fast-paced, yet collaborative environment?If your answer is “Yes”, we would love to talk to you.What your responsibilities are going to be?Apply large language models (LLMs) to specific business problems to extract, process, classify and derive insights from the information hidden in unstructured datasets.Develop domain- or task-specific language models for business problems when proprietary or off-the-shelf models cannot be used.Evaluate the performance of machine learning models and make recommendations for improvement.Research and experiment with key technologies to remain up to date with the state of the art in NLP and generative AI research.Generate clean, efficient, and documented Python code.Offer direction and expertise to junior team members, promoting a culture of learning and knowledge sharing.Actively participate in code reviews and contribute to the establishment of software development best practices.Assist in data projects assessment, discovery, and design phasesWhat qualifications are needed?3+ years of experience as Data Scientist and hands-on experience with large language models (GPT, XLNet, T5, etc.).Advanced skills in Python development including libraries like NumPy, SciPy and experience with SQL.Strong communication and presentation skills, with the ability to explain technical concepts to non-technical stakeholders.Practical experience in working with cloud platforms, MS Azure, AWS or Google Cloud.AdvantagePhD or Master’s degree in Computer Science, Data Science, Machine Learning, Theoretical Linguistics or a related field. Relevant working experience may compensate for lack of education.Experience with containerization, Kubernetes (K8S) and application deployment.Knowledge or experience with vector databases such as Pinecone, Milvus, or Weaviate would be beneficialBy joining us:• You will have the chance to bring your technical expertise, enthusiasm, and entrepreneurial mindset, and shape the way we transform the business (and lives) of our clients, partners and society.• You will be surrounded by other highly performing team members and will have the chance to grow and scale with us.• You will become part of a thrilling and collaborative environment where you will be able to share your ideas and gain insightful feedback.• You will enjoy flexibility and be able to keep the balance between your personal and professional life and focus on what’s important.All applications will be treated in strict confidentiality.",
            "score": 0.08475021987050053
        },
        {
            "job_position": "Technical Business Analyst",
            "company_name": "scandiweb",
            "job_description": "Department: Business DevelopmentLocation: North MacedoniaCompensation: €1,765 - €2,245 / monthDescriptionFor every person joining us for any position, there is a path and an opportunity to reach an executive role and become a company partnerAntons Sapriko, Company FounderHere is a video story of a colleague who joined the Key Account Manager team:Laura Balode, Gaining experience and becoming an eCommerce expert Key Account Manager. Latvia.﻿﻿*Please note that the salary is stated as a NET amount due to international hiring considerations. In the event of employment, the specified ranges will be adjusted to include applicable taxes.How to Become a Technical Business Analyst at scandiweb eCommerce Expert Team?We are a very inclusive company with colleagues from over 30 countries across all continents. Our ratio of females is among the highest in the industry. We welcome people from all walks of life who can complete a test by showing their skill and knowledge.While a solid understanding of web technologies and development processes, experience in managing projects, and ability to analyze complex business requirements are expected in this role, we value your ability to deliver results starting from the test task, and your enthusiasm and openness to embrace new knowledge and processes. Continuous learning and acting on feedback are among our core organizational values.What are the responsibilities of a Technical Business Analyst?As a Technical Business Analyst at scandiweb, you will play a pivotal role in bridging the gap between our client's business objectives and our technical solutions.Your primary responsibility will be to conduct comprehensive discovery sessions, both onsite and online, to analyze and plan potential web projects. This involves leading workshops with clients to delve into various aspects of their projects, meticulously scoping out requirements, and producing detailed documentation.The culmination of your efforts will be a thorough estimate of the project's development costs, which you will present to the client before transitioning the project to our delivery department.Our projects range from large-scale eCommerce solutions to mobile applications and custom-built systems, ensuring a diverse and challenging work environment.What do we expect from you?Detail Orientation: A keen eye for detail is essential to ensure all project aspects are accurately captured and documented;Technical Proficiency: A solid understanding of web technologies and development processes to effectively communicate with both clients and technical teams; Analytical and Logical Thinking: Ability to analyze complex business requirements and translate them into actionable project plans; Communication Skills: Excellent verbal and written communication skills to facilitate clear and effective client interactions and documentation; Confident written and spoken English skills. You will be working internationally;Project Management: Experience in managing projects from inception through planning, ensuring timelines and deliverables are met; Client Engagement: Proven ability to build and maintain strong client relationships, understanding their needs and delivering solutions that meet their objectives; Business Insight: A proactive ability to understand the client's business and identify potential opportunities where our solutions can bring additional value.Further career growth for Technical Business Analyst?You will get support in career counseling from our HR department as each career path is unique taking into account your personal strengths and ambitions.Further professional growth and development can lead you to become a senior, team lead for one and/or multiple teams, heading a particular practice, and ultimately working with top accounts like Puma, The New York Times, or Läderach.What is the compensation package of a Technical Business Analyst at scandiweb?Competitive starting salary relative to the market;Valuable eCommerce experience at the industry leader scandiweb;Substantial monetary bonuses based on successful lead conversion to client;Exciting travel opportunities;Support for hardware upgrades;Core health insurance coverage and sports bonuses;A diverse multinational team of experts to learn from;Company-covered training and certification;Legendary online and onsite events to celebrate our success together.Next stepsApply and fill in the application form;Receive the test task and complete it.Here is what people who joined the Key Account Management team want to share with you:\"My journey with scandiweb started unexpectedly and out of curiosity. I saw an ad for a Junior Project Manager position and since I was somehow in IT but with little experience, I decided to try it out. It was a huge surprise to receive an offer and make it all happen.My first projects were in different stages and on different levels of experience needed. However, I was not hesitant to jump on them! North Coast Pottery (US client), Stenders (LV client), and Hebes Code (Spanish client). Being able to work on projects within different stages of development allowed me to learn the full cycle fairly quickly and progress in a speedy mode!With the vast experience from the 3 projects, I continued my growth by joining Business Development (BD) - and that's when my career took a massive turn. After learning all the basics, I was made a Key Account Manager of 5 different accounts at scandiweb.The best things I have learned and gained thanks to scandiweb? Self-confidence and believing in my experience. They allowed me to grow at my own pace and gave me an enormous amount of trust. The freedom of being able to work within your own frames makes you feel like the processes are not there! All of the teams and managers I worked with, valued me for who I am, and leveraged my strengths to the best advantage.\"Dominika Plata, Key Account Manager from Poland. Joined the company on 4/3/2023.\"I was looking for a company working in a variety of technologies and frameworks related to eCommerce, and scandiweb was the best suitable for this. I remember my first project was Christmas Tree World in which we did a Magento 2 Fresh build with data migration from the old Magento 2 website.I had the opportunity to lead the project discovery calls with the client to finalize the requirements, analyze and document the proposed implementation, and provide a project work estimate. Getting a chance to be involved in all things discovery enhances your technical skills and develops interpersonal skills and client communication.I have learned that the best things on scandiweb are teamwork, handling responsibilities, and knowledge of eCommerce related technologies like iPaaS and PIM.\"Anup Wankhede, Key Account Manager from India. Joined the company 10/30/2023.",
            "score": 0.07513384799733633
        }
    ],
    "top_bert_jobs": [
        {
            "job_position": "Python Full Stack Developer",
            "company_name": "YO IT CONSULTING",
            "job_description": "Python Full Stack Developer -JavaScript/TypescriptExperience: 3 - 20 YearsLocation: - Anywhere in the World - Permanent RemoteContract Duration:  6-12 monthsOpportunity- Full Time, 8 hoursWork Hours: 5 hours overlap with the PST time zoneTotal Years Of exp- 3+ years experience Mandatory Skills-Python: min 3 yrs,JavaScript: min 3 yrs or Typescript: min 3 yrs,Nest.js: min 1 yr, or React: min 2 yrsRequired Skills3+ years of professional experience in PythonStrong SQL expertise with hands-on experience in database design, optimization, and management.2+ years of experience with Nest JS or other backend frameworks.Familiarity with AWS/GCP is a plus.Ability to work independently as well as collaboratively within a team.Strong problem-solving skills with a focus on delivering high-quality code.Nice to Have : Familiarity with front-end technologies (React or Angular) is a plus.Familiarity with Python for scripting data analysis is a plus.Excellent spoken and written English communication skillsJob DescriptionWe are seeking a full-stack engineer with a strong focus on backend development to join our growing team. In this role, you will be responsible for designing, developing, and maintaining high-performance software applications. Your expertise in Python and JavaScript (JS) will be crucial in building scalable and reliable backend systems.Ideal Candidate Profile3+ years of overall experienceEager to learn and grow within the company, with a proactive approach to personal and professional development.Reliable and consistent in delivering high-quality work.Strong communication skills and a collaborative mindset.Skills: sql,full stack development,css,gcp,javascript/typescript,html,python,nest.js,javascript,aws,angular,nestjs,react,typescript,aws/gcp",
            "score": 0.9178933501243591
        },
        {
            "job_position": "Verilog Design Verification Engineer",
            "company_name": "YO IT CONSULTING",
            "job_description": "Hardware Design DeveloperExperience: 3 - 25 YearsLocation: - Permanent Remote anywhere in the WorldContract Length: 6 MonthsType: Full time contract(8 hrs/day) Overlap Hours: 4 hrs/day with PSTMandatory SkillsOverall - 5 years of exp.Min of 2 years of relevant experience in Hardware Design and/or Hardware VerificationExperience With One Or More On The List Below>ASIC>VLSI>FPGA>SOCExperience with one or more on the list below>SystemVerilog development>Verilog development>Testbench development and/or verification.Good communication skills in English.LLM experience is not mandatory, however, the candidate should be fine to work as a LLM Engineer for Verilog.Must-HaveBS or MS degree in Electrical, Engineering, or related field.3-5 years of proven experience in hardware design development.Expertise in HDLs such as Verilog, SystemVerilog, VHDL, and SystemC.Expertise in scripting, front-end and verification workflows, and integrations within the hardware design environment.Expertise in UVM environmentsExpertise in Formal VerificationExpertise in Lint process and refinementGood communication skills in EnglishJob DescriptionWe're searching for an exceptional hardware design Developer to play a pivotal role in using the hardware design platform to generate the training data to enhance enterprise LLMs' capabilities. This unique position offers the chance to directly contribute to the sophistication of enterprise LLMs, ensuring they operate with unparalleled efficiency and intelligence.Your MissionDevelop, configure, and customize the hardware design platform, utilizing it to generate vital training data for enterprise LLMs.Liaise with research teams to translate requirements into actionable data insights, directly impacting our LLMs' performance.Uphold the highest standards in coding, debugging, and documentation, ensuring the hardware design solutions are optimized for LLM training and benchmarking.Collaborate across teams to identify and prioritize needs, contributing to the LLMs' ability to understand and automate complex processes.We NeedBS or MS degree in Electrical, Engineering, or related field.3-5 years of proven experience in hardware design development.Expertise in HDLs such as Verilog, SystemVerilog, VHDL, and SystemC.Expertise in scripting, front-end and verification workflows, and integrations within the hardware design environment.Exceptional problem-solving, communication, and collaborative skills.Familiarity with ML and AI systemsSkills: ai systems,verilog-a,soc,communication skills,hdl expertise,formal verification,hdl,integrations within hardware design environment,vhdl,collaboration,lint process refinement,systemverilog development,verification,hdls,knowledge of ml and ai systems,integration,verification workflows,integrations in hardware design,communication,systemverilog,integrations,vlsi,fpga,lint process and refinement,hdls (verilog, systemverilog, vhdl, systemc),uvm environments,electronics hardware design,hardware design development,good communication skills,front-end,ai,hardware design,verilog development,systemc,hdls (vhdl, systemc),machine learning,lint process,front-end and verification workflows,scripting,coding,ml,front-end verification workflows,uvm,asic,front-end development,design,integration within hardware design environment,debugging,hardware verification,ml and ai systems,integrations within the hardware design environment,electrical engineering,verilog,problem-solving,familiarity with ml and ai systems,testbench development,documentation,collaborative skills,front-end workflows",
            "score": 0.9113619923591614
        },
        {
            "job_position": "Sr Lua Developer",
            "company_name": "YO IT Group",
            "job_description": "LLM Lua DeveloperExperience: 3 - 20 YearsLocation- Permanent Remote Anywhere in the worldContract Duration: 6 - 12 MonthsOpportunity- Full Time, 8 hours, 5 hours Mandatory overlap with PSTTotal Years Of exp: 3+ years experienceMandatory Skills: min 3 yrs experience as a Lua DeveloperRequired Skills3+ years of experience as a Lua Developer or similar role Proficiency in Lua programming language.Solid understanding of software development principles and best practices.Experience with version control systems (e.g., Git).Strong problem-solving skills and attention to detail.Excellent communication and teamwork skills.Ability to work in a fast-paced and dynamic environment.Knowledge of using LLMs / AI for coding Nice To HaveExperience with game development or scripting in gaming engines or Embedded Systems or ML or DevOps.Familiarity with other programming languages such as Python, C++, or JavaScript.About RoleA NASDAQ-listed company that has effectively maintained its position as the front-runner technology sector, is looking to onboard a skilled Python developer keen is helping them expand the power of AI in the mobile coding ecosystem with the ultimate goal of creating new assisting AI-powered tools for the development domain. The company is developing the next generation of coding assisting agents, which will have a wide range of uses. For those who are keen to learn in a fast-paced setting, this is an exciting opportunity.Skills: lua programming,python,ml,llms / ai for coding,communication,problem solving,knowledge of llms / ai for coding,software engineers,c++,scripting,scripting in gaming engines,problem-solving skills,llms / ai,using llms / ai for coding,llms/ai for coding,embedded systems,knowledge of using llms / ai for coding,ai for coding,lua,communication skills,llms,version control systems (git),version control systems (e.g., git),javascript,knowledge of llms/ai,ai in coding,software development principles,fast-paced environment,git,problem-solving,llms / ai knowledge,game development,version control (git),machine learning,teamwork,embedded,teamwork skills,knowledge of llms / ai,attention to detail,version control systems,c,devops,software development,lua programming language,knowledge of llms/ai for coding,ai coding,ai",
            "score": 0.9106347560882568
        }
    ]
}