{
    "cv": {
        "full_name": "20024870",
        "skills": "Skills Professional Skills:",
        "experience": "Experience Worked at different stations of hospital, including:ER, Registration, Pharmacy, Central Sterile Supplies Department (CSSD), and Medical Supplies",
        "education": "Planned summer and winter camps for kids who lack educational resources. Education Metropolitan State University National Taipei University of Nursing and Health Science"
    },
    "top_cosine_jobs": [
        {
            "job_position": "Data Scientist",
            "company_name": "Scalefocus",
            "job_description": "Are you a motivated Data Scientist, willing to grow as a professional and work on large-scale projects, using different working approaches that are both diverse and cutting-edge? Are you passionate about innovative and top-notch software solutions and want to be part of like-minded professionals? Do you enjoy working in a fast-paced, yet collaborative environment?If your answer is “Yes”, we would love to talk to you.What your responsibilities are going to be?Apply large language models (LLMs) to specific business problems to extract, process, classify and derive insights from the information hidden in unstructured datasets.Develop domain- or task-specific language models for business problems when proprietary or off-the-shelf models cannot be used.Evaluate the performance of machine learning models and make recommendations for improvement.Research and experiment with key technologies to remain up to date with the state of the art in NLP and generative AI research.Generate clean, efficient, and documented Python code.Offer direction and expertise to junior team members, promoting a culture of learning and knowledge sharing.Actively participate in code reviews and contribute to the establishment of software development best practices.Assist in data projects assessment, discovery, and design phasesWhat qualifications are needed?3+ years of experience as Data Scientist and hands-on experience with large language models (GPT, XLNet, T5, etc.).Advanced skills in Python development including libraries like NumPy, SciPy and experience with SQL.Strong communication and presentation skills, with the ability to explain technical concepts to non-technical stakeholders.Practical experience in working with cloud platforms, MS Azure, AWS or Google Cloud.AdvantagePhD or Master’s degree in Computer Science, Data Science, Machine Learning, Theoretical Linguistics or a related field. Relevant working experience may compensate for lack of education.Experience with containerization, Kubernetes (K8S) and application deployment.Knowledge or experience with vector databases such as Pinecone, Milvus, or Weaviate would be beneficialBy joining us:• You will have the chance to bring your technical expertise, enthusiasm, and entrepreneurial mindset, and shape the way we transform the business (and lives) of our clients, partners and society.• You will be surrounded by other highly performing team members and will have the chance to grow and scale with us.• You will become part of a thrilling and collaborative environment where you will be able to share your ideas and gain insightful feedback.• You will enjoy flexibility and be able to keep the balance between your personal and professional life and focus on what’s important.All applications will be treated in strict confidentiality.",
            "score": 0.06064837294530973
        },
        {
            "job_position": "Back-End Software Engineer",
            "company_name": "Worldly",
            "job_description": "Backend Software EngineerLocation: Remote in South or Central America (Brazil, Colombia, Mexico preferred)About WorldlyWorldly is the world’s most comprehensive impact intelligence platform — delivering real data to businesses on impacts within their supply chain. Worldly is trusted by 40,000 global brands, retailers, and manufacturers to provide the single source of ESG intelligence they need to accelerate business and industry transformation.Through strategic and meaningful customer relationships, Worldly provides key insights into supplier performance, product impact, trends analysis, and compliance. When a company wants to change how business is done, we enable that systemic shift.Backed by a dedicated global team of individuals aligned by values, Worldly proudly operates as a public benefit corporation with backing from mission-aligned investors. Want to learn more? Read our story.About The RoleAs a Software Developer at Worldly, you will play a crucial role in the development and maintenance of our platform. You'll be an integral member of the Data Architecture Team, focusing on software development for data collection, transformation, and analysis. This role involves shaping our data strategy and ensuring data integrity and quality.We are looking for a talented individual with expertise in JavaScript, Node.js, and TypeScript, as well as experience with both relational and non-relational databases, such as PostgreSQL and CouchDB. The ideal candidate will have a passion for technology and a strong desire to contribute to the success of our projects.What You'll DoCollaborate in the development and maintenance of our platform. This includes coding, debugging, and troubleshooting to ensure optimal functionality. Develop software solutions for data collection, transformation, and analysis. Collaborate on shaping the data strategy to meet business objectives while ensuring data integrity and quality. Develop APIs for seamless data integration and exports, enabling efficient data exchange and interaction. Collaborate closely with the product management team to understand requirements, prioritize tasks, and deliver solutions that meet business objectives. Participate in code reviews and contribute to the improvement of coding standards and development processes. We'd Like to SeeBachelor’s degree in computer science, Engineering, or related field. 5+ years of experience in backend development, with a focus on JavaScript, Node.js, and TypeScript. Proven expertise in designing and working with relational and non-relational databases, such as PostgreSQL and CouchDB. Strong data-related skills, including data analysis, manipulation, and visualization, with experience in handling large datasets. Experience working closely with product management teams to translate requirements into technical solutions. Excellent problem-solving skills and attention to detail. Strong communication and collaboration skills, with the ability to work effectively in a cross-functional team environment. It Helps If You HaveHigh level of detail orientationA proactive mindset and ability to work independently as well as within cross-functional squads. Experience writing unit and integration tests, Jest experience a plus. Experience with GIT and the ability to determine the approach in handling code and repository management (forking, branching, merging, and rebasing)What We Can Offer YouComprehensive benefits offerings. 90% employee premium and 75% spouse/dependent premium covered by Worldly. Company-sponsored 401k with up to 4% match. Incentive Stock Options100% Parental Paid LeaveUnlimited PTO 13 company holidaysLife at WorldlyOur team is motivated to transform the way products are made. By helping our customers succeed in a new era of sustainable production, we can build technology that makes a difference on a planetary level.Our team represents over 15 countries and brings unique experiences from technology to farming to the table. Surround yourself with kind, enthusiastic, and dedicated people who put collaboration and growth at the center of our shared goals.Benefits And PerksEarn a competitive salary and performance-based bonuses. Get healthcare, retirement matching, and equity for US employees. Use the office stipend to get the supplies you need. Combat Zoom fatigue with no-meeting Fridays. Flexible time off. Take the time you need to recharge. Our culture encourages team members to explore and rest to be their best selves. We're remote, not lonely. Join the culture committee, coffee chats, or a variety of other interest groups. Equity StatementWe believe it’s essential to reflect the diversity of those we strive to serve. True innovation happens when everyone has room at the table, including the tools, resources, and opportunity to excel. We’re dedicated to building a culturally and experientially diverse team that leads and works with empathy and respect.Compensation$30,000 - $34,500 USD Annual Salary (South/Central America)$40,000 - $46,000 USD Annual Salary (Balkan Region - Europe)5% Annual BonusEquity Stock Options ProgramFinal compensation figures will be determined based on a wide variety of factors, including experience and location. These factors will be evaluated and considered by Worldly throughout the entirety of this process. Compensation Range: $30K - $46K",
            "score": 0.052584650281825955
        },
        {
            "job_position": "Senior Test Automation Engineer",
            "company_name": "Netcetera",
            "job_description": "We are a team of experts who work together to design and develop software that matters. Netcetera strongly believes in and supports continuous professional development. We care about our well-being. At Netcetera, we share our expertise, foster exchange, and appreciate different approaches. Respect, reliability, commitment, and professionalism define us. Our teams work with agile development methodologies and use the latest technology. Netcetera specialists are part of an extensive network within the IT industry.As a Senior Test Automation Engineer you'll work in a very dynamic team of professionals assuring that our software products gets maximum support and reliability. We're looking for a bright, talented, experienced and responsible individual with great technical background, but in the same time a team player and someone who can stood up for the new demanding challenges on a daily basis. The ideal candidate must be self-organizing, proactive, self-starter and able to seek out information.Looking for a new challenge? Take the next big step in your career!The job ad is valid until 31.12.2024Your role: Designing, developing, and refining of automated testsPlanning, implementation, and execution of tests in the Mobile Payment/Authentication areaExtending the existing automated test framework covering aspects like functional tests, error provocation, performance tests and high-availability testsEnsuring high test coverage using automated continues integration testsTesting, qualification and ensuring quality of the delivered team artifacts for all customer projectsPresenting status and issues in clear concise manner to appropriate levels in managementWorking in conjunction with Product Management, Operations team and other stakeholdersBe able to function in a matrix environment with multiple stake holder often with competing priorities and requirements and with strict timelinesEvaluating new testing tools and provide POCsRequirementsYour profile:Bachelor's or Master's degree in Computer science, Information Science or related educational area from an education institution with strong reputation8+ years overall IT experience involving:Agile Methodologies, ScrumTest Management ToolsContinuous Integration through Jenkins, CI/CDManual Testing, API Testing experienceTest Automation experience:Good programming skills with one or more programming languages (e.g. Java, Perl, Shell and Bash Scripting)Good knowledge of Java, Spring Boot, Hibernate, Apache MavenPerformance Testing experience is nice to haveGood knowledge of HTTP(S), JMS and other modern protocolsGit, Stash and BitbucketExperience with DevOps tools and workflows such as Jira, Bamboo or equivalentsKnowledge of cryptography, authentication and authorization schemes and protocolsGood knowledge of databases and SQLKnowledge of any Linux OS (e.g. CentOS) i.e. should be familiar with Linux OS server deployment, starting/stopping processes, checking logs, sound knowledge of Linux/Unix CommandLineHands on experience of using Tools like - SOAPUI, Postman, SQL Developer etcKnowledge of different testing types like Unit, Integration, Regression, Functional etcExcellent written communication skills, as well as verbal; must be able to articulate technical aspects of solution/services to business executives and customersProven experience working in a distributed team setup and/or international teamAbility to:Translate business requirements into use case or test case and plan test activitiesDrive strategy through influence with leadership qualities which engineers recognize and respectInnovate and lead explorations into new technologies and strategiesEvaluate new technologies or tools, stay abreast with industry trendsNice to have knowledge in some of the listed technologies:DockerCucumberMicroservicesBenefits Flexibility: Adjust your time to work efficiently, be it working hours, part-time options, home office, or unpaid leave Extra vacation days: Need to take some extra time off? With us, you have the possibility to activate 5 additional paid days per year on top of your vacation plan Private health & Family Insurance: The company policy covers a private health insurance plan for you and your family Yearly Education Fund: We strongly believe in continuous development and would love to see you enrich your knowledge. Ever Netceterian has a dedicated yearly fund to invest in their professional and personal development through conferences, courses, lectures or long-term education Meals & Snacks: Enjoy a lunch allowance each working day, free fruit and drinks in the officeDiscover more benefits",
            "score": 0.05229218751701262
        }
    ],
    "top_bert_jobs": [
        {
            "job_position": "HTML/CSS Developer (Relocation to Bulgaria Required)",
            "company_name": "Sofia Stars",
            "job_description": "❗️Please note that this position is office-based for our Bulgarian office (Office X, near Mall Paradise).❗️If you live outside of Bulgaria, we can provide support in relocation.Embark on an exhilarating journey with Sofia Stars as we amplify our IT hub in Sofia.Role in a nutshell:Lead innovation as a pioneer in our R&D teams. Elevate your career by becoming one of the first IT people we have in Sofia!✅ Requirements :✔️ 3+ years of professional experience as an HTML-coder✔️ Excellent knowledge of HTML, CSS✔️ Good understanding of UI/UX design and cross-browser layout✔️ Strong knowledge in CSS/JS animation✔️ Experience working with CSS Pre-Processors: Sass/Less✔️ Understanding of web application performance optimization✔️ Experience with Figma / Sketch / Photoshop✔️ At least Intermediate lvl of English✅ Nice to Have:✔️ Understanding of front-end build tools (Gulp, Webpack, etc)✔️ Knowledge of HTML email templates✔️ Experience working with CSS frameworks✔️ Experience working with template engines (pug, Handlebars, etc)✔️ Experience with Canvas API / WebGL / ThreeJS / GSAP✅Duties and opportunities:✔️ Develop the efficient, fast and adaptive layout of interfaces✔️ Collaborate with developers and web designers to improve product✔️ Introduce ideas, solutions and optimise existing applications✅Why Sofia Stars?✔️Official employment and full medical insurance with the highest limits in the country (including in-patient and out-patient care, maternity, dental, and annual health check-ups);✔️ Working with a brand new MacBookPro;✔️Competitive salary;✔️Working in a dynamic international company;✔️Birthday celebration present;✔️Possibility for career and professional growth within the company;✔️Sportscard (Multisport);✔️Team-building events and activities;✔️Sunny, spacious office;✔️Wedding and newborn gifts;✔️Up to 25 vacation days, starting from 20;✔️Breakfast x3 times a week, Friday team lunch, food vouchers, fruits, and snacks in the office.Join Sofia Stars and rock with us! 🚀",
            "score": 0.7933199405670166
        },
        {
            "job_position": "C# .net Developer (MacOS) ",
            "company_name": "Hornetsecurity",
            "job_description": "Join our fight against cybercrime and become a crucial part in Software Development! This is a full-time remote position from Macedonia.Your tasks: You will be responsible for creating, improving and maintaining business logic and UI parts of the Emsisoft / Hornetsecurity endpoint protection products that help users around the world to remove malware from their systems and stay protected. This role is specifically dedicated to macOS development.Responsibilities:Primary responsibility is focused on architecture, development and maintenance related to new and existing Emsisoft / Hornetsecurity client software components that are designed to support multiple platforms (macOS and Windows). This involves everything from minor code changes to design of new modules, including writing code, debugging, testing, and documentation.Ability to develop written design specifications from project management input, discussions with key team members and customer feedback.Complete documentation and provide input to improve procedures for installation, development and maintenance processes.Skills and qualifications:Strong background in C#/.net Core development for desktop applications (7+ years). Knowledge of other programming languages, especially Delphi is a major plus.Solid knowledge of macOS and Windows architectures.Hands-on experience in development of macOS daemons.Hands-on experience in crash dump analysis.Knowledge of common source control systems.Fluent verbal and written communication skills in English.Your Benefits:Free space for innovation and independent action in a fast-growing international company.Temporary Employee Exchange Program – we provide the ability for you to work at our global office locations and explore the world (e.g. Berlin, Madrid, Malta, Montréal, Washington D.C.).Team events like Laser Tag, Office Movie Nights, Foodie Fridays and much more – let yourself be surprised!FitKit subscription and private insurance for your health!Unlimited contracts – we’re looking for hornets to grow long-term with us.And, of course, the usual standards such as development opportunities, coffee, tea, soft drinks & fresh fruit, office dogs, no dress code and much more!",
            "score": 0.7872797846794128
        },
        {
            "job_position": "Machine Learning Intern",
            "company_name": "ITQuarks",
            "job_description": "< BackMachine Learning InternApply NowSkopje, MacedoniaJob Type3 MonthsITQuarks is a research and development company that provides a unique combination of expertise in machine learning, optimization and data processing.What We Offer Paid with the duration of 3 months. Startup culture and ability to gain experience in real projects.What will your job look like?As a Machine Learning Intern, Your Responsibilities Will Include Pass a programing course. Learn basics of Mongo DB and Elastic Search. Learn the concepts of Machine learning models. Bring in fresh ideas into our machine learning products and platform. Designing experiments with Tensorflow (JS) and Keras to advance our machine learning algorithms and techniques. Data preparation and analysis.All You need is ... Have a proven track record of academic learning in fields related tomachine learning and signal processing. Knowledge of statistical and machine learning approaches and problemdomains acquired by courses, course projects, assignments, or researchwork. Good at Algorithms and out of the box thinking. Coding ability and familiarity with C/C++ , Python or JavaScript.Apply at mycareer@itquarks.comApply Now",
            "score": 0.7849398851394653
        }
    ]
}