{
    "cv": {
        "full_name": "23864648",
        "skills": "Expertise includes team leadership, technical architecture, training and development, disaster recovery planning, and information protection Skills",
        "experience": "Results-driven IT executive management professional with 20 years of experience in diverse industries, including healthcare and marketing. Experience",
        "education": "Education and Training Bachelor of Science : Computer Science TROY STATE UNIVERSITY , City , State , Montgomery"
    },
    "top_cosine_jobs": [
        {
            "job_position": "Social Media & Digital Marketing Lecturer",
            "company_name": "ROI Academy",
            "job_description": "Company DescriptionROI Academy is a training center that specializes in professional courses in the field of information technology. Established on September 6, 2019, ROI Academy has physical locations in Kosovo, Albania, and North Macedonia. The training programs offered cover various fields, including Video Editing, as well as Programming, Digital Marketing, Graphic Design, Video Animation, and Cybersecurity.Role DescriptionThis is a part-time on-site role in Skopje for a Digital Marketing Lecturer. The Social Media & Digital Marketing Lecturer will be responsible for providing instruction on Social Media Marketing & Management, SEO, Google Ads, and Email Marketing.Qualifications & Experience:- Minimum 3-4 years of professional experience in Digital Marketing.- Strong understanding of Digital Marketing strategies, including SEO, SEM, Social Media Marketing, Email Marketing, and Content Marketing.- Familiarity with marketing analytics tools such as Google Analytics, Facebook Business Manager, and SEO tools.Key Responsibilities:- Deliver engaging and practical lectures on Digital Marketing topics.- Develop course materials, presentations, and hands-on exercises.- Guide students through real-world digital marketing case studies and projects.- Stay updated with the latest digital marketing trends and tools.- Evaluate student performance and provide constructive feedback.- Collaborate with the academy’s team to enhance course offerings.",
            "score": 0.154724269239
        },
        {
            "job_position": "Data Scientist",
            "company_name": "Scalefocus",
            "job_description": "Are you a motivated Data Scientist, willing to grow as a professional and work on large-scale projects, using different working approaches that are both diverse and cutting-edge? Are you passionate about innovative and top-notch software solutions and want to be part of like-minded professionals? Do you enjoy working in a fast-paced, yet collaborative environment?If your answer is “Yes”, we would love to talk to you.What your responsibilities are going to be?Apply large language models (LLMs) to specific business problems to extract, process, classify and derive insights from the information hidden in unstructured datasets.Develop domain- or task-specific language models for business problems when proprietary or off-the-shelf models cannot be used.Evaluate the performance of machine learning models and make recommendations for improvement.Research and experiment with key technologies to remain up to date with the state of the art in NLP and generative AI research.Generate clean, efficient, and documented Python code.Offer direction and expertise to junior team members, promoting a culture of learning and knowledge sharing.Actively participate in code reviews and contribute to the establishment of software development best practices.Assist in data projects assessment, discovery, and design phasesWhat qualifications are needed?3+ years of experience as Data Scientist and hands-on experience with large language models (GPT, XLNet, T5, etc.).Advanced skills in Python development including libraries like NumPy, SciPy and experience with SQL.Strong communication and presentation skills, with the ability to explain technical concepts to non-technical stakeholders.Practical experience in working with cloud platforms, MS Azure, AWS or Google Cloud.AdvantagePhD or Master’s degree in Computer Science, Data Science, Machine Learning, Theoretical Linguistics or a related field. Relevant working experience may compensate for lack of education.Experience with containerization, Kubernetes (K8S) and application deployment.Knowledge or experience with vector databases such as Pinecone, Milvus, or Weaviate would be beneficialBy joining us:• You will have the chance to bring your technical expertise, enthusiasm, and entrepreneurial mindset, and shape the way we transform the business (and lives) of our clients, partners and society.• You will be surrounded by other highly performing team members and will have the chance to grow and scale with us.• You will become part of a thrilling and collaborative environment where you will be able to share your ideas and gain insightful feedback.• You will enjoy flexibility and be able to keep the balance between your personal and professional life and focus on what’s important.All applications will be treated in strict confidentiality.",
            "score": 0.11922841981914813
        },
        {
            "job_position": "Machine Learning Lead",
            "company_name": "Loka",
            "job_description": "At Loka we use a modern tech stack to support meaningful projects across a huge range of industries. In the last year we’ve helped clients advance the world’s #1 AI reading tutor, eliminate $1B in food waste and develop novel drugs for fighting cancer, all while enjoying every other Friday off. Join us, feed your need to grow and ship projects you believe in with a team you’re proud to lead.We’re seeking a Machine Learning Team Lead to deploy, secure and maintain ML models in production environments, mainly AWS. The ideal candidate will not only apply their technical brilliance but also take a leadership role in contributing positively to Loka’s unique culture.The RoleLead a team of ML engineers in architecting, building and optimizing scalable, cost-efficient ML models and ensuring performance in production environments.Provide constructive team feedback through regular one-on-one meetings and drive technical and professional development.Manage end-to-end ML projects, including data exploration, model development, deployment and scaling while delivering solutions that meet business and client needs.Collaborate with stakeholders to align ML initiatives with strategic objectives, ensuring clear communication with both technical and non-technical audiences.Drive technical innovation within the team by staying current with the latest AI/ML trends, implementing cutting-edge techniques.Foster the team's professional growth by creating development plans and encouraging a positive, collaborative remote working environment.Own the development and automation of ML workflows, including data pipelines and model deployment, with a focus on scalability and efficiency.Ensure strong cross-functional collaboration with Data Engineering, DevOps, BackEnd and other teams to deliver cohesive solutions.Work closely with senior leadership to align ML initiatives with long-term company strategies.Hard Skills Requirements5+ years of experience in machine learning, with 3+ years leading a teamStrong knowledge of Python, ML libraries and frameworks such as PyTorch, HuggingFace and TensorFlowHands-on experience with GenAI solutions using LLMs (even if not at an expert level), including prompt engineering and an understanding of common patterns like RAG and NLQClient-facing experience, including the ability to gather requirements, set expectations and deliver technical presentations, sometimes to non-technical peopleBachelor’s degree in Computer Science, Engineering or related fieldAdditional RequirementsExcellent English language skills - Being a global team, we work entirely in English for meetings, customer calls and business communicationsCV written in EnglishNot Required but Nice to HaveExperience with AWSExperience in consultancy environments or startups, including working directly with clients, managing projects and adapting to different settingsFamiliarity with MLOps best practices and toolsPersonality ProfileCuriosity: Eager to stay ahead in the rapidly evolving ML field and apply new technologiesAutonomy & Positivity: Thrives in a remote, globally distributed teamLeadership: Capable of leading with empathy, motivating team members and fostering a collaborative cultureAdaptability: Comfortable operating with a startup mindset, able to pivot and scale quicklyClient-Focused: Understand client needs and balance them with technical realities to deliver impactful solutionsBenefitsEvery other Friday off (26 extra days off a year)Remote and flexibleExplore and Relocation programs (three months work abroad or full international relo)Paid sick days and local holidaysPremium mental health subscriptionsAccess to LokaLabs™, our internal research and development programLokaLabs incubatorFitness subscriptionMental wellness programsDefined career pathBusiness English classesYour achievements matter to us! Ensure your CV, LinkedIn and GitHub profiles are up to date and accurately reflect your experience.",
            "score": 0.09672336623483686
        }
    ],
    "top_bert_jobs": [
        {
            "job_position": "Social Media & Digital Marketing Lecturer",
            "company_name": "ROI Academy",
            "job_description": "Company DescriptionROI Academy is a training center that specializes in professional courses in the field of information technology. Established on September 6, 2019, ROI Academy has physical locations in Kosovo, Albania, and North Macedonia. The training programs offered cover various fields, including Video Editing, as well as Programming, Digital Marketing, Graphic Design, Video Animation, and Cybersecurity.Role DescriptionThis is a part-time on-site role in Skopje for a Digital Marketing Lecturer. The Social Media & Digital Marketing Lecturer will be responsible for providing instruction on Social Media Marketing & Management, SEO, Google Ads, and Email Marketing.Qualifications & Experience:- Minimum 3-4 years of professional experience in Digital Marketing.- Strong understanding of Digital Marketing strategies, including SEO, SEM, Social Media Marketing, Email Marketing, and Content Marketing.- Familiarity with marketing analytics tools such as Google Analytics, Facebook Business Manager, and SEO tools.Key Responsibilities:- Deliver engaging and practical lectures on Digital Marketing topics.- Develop course materials, presentations, and hands-on exercises.- Guide students through real-world digital marketing case studies and projects.- Stay updated with the latest digital marketing trends and tools.- Evaluate student performance and provide constructive feedback.- Collaborate with the academy’s team to enhance course offerings.",
            "score": 0.8692118525505066
        },
        {
            "job_position": "Systems Engineer - North Macedonia",
            "company_name": "Fortinet",
            "job_description": "Job DescriptionSystems Engineer – North MacedoniaLocation: Remote / North MacedoniaWhy Fortinet?Fortinet is one of the fastest-growing cybersecurity companies in the world. We have proven to be a truly innovative technology driven IT security Company. Fortinet’s mission is to deliver the most innovative, highest-performing network security fabric to secure and simplify IT infrastructures. Today we secure the largest enterprises, service providers and government organizations across the globe.Systems Engineering teamExperienced and passionate professionals, who lead all technical aspects of a sales cycle with the customer, from the initial RFIs, through to RFPs & RFQs when required. This includes the project management and active participation in POCs in partnership with the relevant teams both internally and within the customer and/or commercial partner.Your GoalsMaximize the Fortinet opportunity coverage and brand awareness in the market. Continuously improve knowledge around the Fortinet products and solutions, along with maintaining a deep understanding of the competitive landscape and Fortinet’s ability to provide long lasting protection against the ever-evolving threats. Position Fortinet solutions to the customer, whether this be remotely or in person.Develop relationships with key enterprise partnersAbout YouHave a high aptitude for security technology in network, endpoint and application areas. The CISSP accreditation would also be beneficial.Expert in the current technologies and trends in IT securitystrong understanding of RADIUS, PKI, IKE, Certificates, L2TP, IPSEC, FIREWALL, 802.1Q, MD5, SSH, SSL, SHA1, DES, 3DESAre currently or have previously worked in a pre-sales engineer role, managing end-to-end technical aspects of deals, through to technical closure.Can demonstrate your problem solving skills and how this impacted key wins within your current organization.Understand and can demonstrate your ability to build and maintain customer and partner relationships, including your ability to effectively communicate technically to a range of both external and internal stakeholdersWhat we offer?Competitive basic salary, uncapped commission with progressive multiplicators, employee stock and stock awards, health and welfare benefits.Flexible working approach, this is a field-based role, you can operate from anywhere in North MacedoniaEmpowering and supportive working environment, where you can be yourselfInnovative, collaborative and dynamic company with a double-digit growth over the last decade.Training on the job with many other formal trainings and industry recognized certifications.Our CommitmentFortinet is an equal opportunity employer. We value the diversity in our company, and all qualified applicants will receive consideration for employment without regard to race, colour, religion, gender, sexual orientation, gender identity, nationality in addition to any other applicable legally protected characteristics in the location in which the candidate is applying.",
            "score": 0.8615782856941223
        },
        {
            "job_position": "Technical Customer Success Manager",
            "company_name": "Blackfluo.ai",
            "job_description": "Job Description:Location: Fully remote, EU timezone (CET +/- 2hours)Start date: ASAPLanguages: Fluent English is mandatoryIndustry: Cloud Computing / Web3 / AI - European SaasBlackfluo.ai is a fully remote company with teams located around the globe. We specialize in developing SaaS solutions for businesses and consulting firms. Our innovative AI assistant is designed to support daily operations by taking over repetitive and time-consuming tasks, allowing our clients to focus on what truly matters.Responsibilities:Direct Customer Engagement: Take an active, hands-on approach to customer communication, personally responding to inquiries, feedback, and reviews across all channels, including emails, social media, community forums, and particularly app stores. Your direct responses will not only resolve issues but also build trust and loyalty among our customer base.Voice of the Customer: Champion the customer's voice ensuring that feedback gathered from direct interactions is clearly communicated and acted upon.Automation and Efficiency: Implement and optimize AI-driven tools and other technologies to streamline routine support tasks, aiming for faster and more effective resolutions to customer inquiries.Multi-Channel Support Management: Oversee a cohesive and integrated customer support strategy across various platforms to ensure a seamless and high-quality customer experience.Knowledge Base and FAQ Enrichment: Regularly update our knowledge ensuring that our self-help tools are accurate, comprehensive, and effective.Cross-Functional Collaboration: inform and influence product development, feature prioritization, and issue resolution, ensuring a customer-centric approach in all product decisions.Skills and Competencies:Exceptional Direct Communication Skills: Demonstrated ability to engage directly with customers across multiple channels, providing empathetic, clear, and effective responses to inquiries, feedback, and reviews. Your communication skills bridge the gap between our customers and our product, making you the face and voice of our clients brand.Advanced Technical Proficiency and Tool Use: Experience with customer support platforms (e.g., Zendesk, Salesforce), feedback management on digital platforms (e.g., Google Play Store, Apple App Store), and agile collaboration tools (e.g., JIRA, Confluence) to ensure efficient operation and continuous improvement of the support function.Qualifications:A relevant diploma or associate degree in Business Administration, Communication, or a related field. While a Bachelors degree is advantageous, we highly value practical experience and specific skills in our candidates.A minimum of 8 years of experience in customer support, with a focus on digital or tech products. Experience in a leadership role is a plus.Demonstrated proficiency in using customer support technologies, including experience with CRM platforms (e.g., Zendesk, Salesforce) and familiarity with managing feedback on digital platforms (e.g., Google Play Store, Apple App Store).Solid understanding of agile methodologies and experience with collaboration tools such as JIRA and Confluence, showcasing the ability to work effectively in a dynamic and fast-paced environment.Fluency in English is a must (written and spoken)Web3 / Blockchain experience is a ++",
            "score": 0.8604272603988647
        }
    ]
}