{
    "cv": {
        "full_name": "15297298",
        "skills": "Skills",
        "experience": "Strategic, motivational, and solutions-focused leader with an MBA and with extensive experience in analyzing systems/processes and implementing mission-critical infrastructure improvements Broad based experience in the healthcare industry including regulatory/corporate compliance, strategic compliance Proven track record of success in developing solutions which significantly improve the efficiency of business operations; experience Professional Experience",
        "education": "Mentored and ensured the professional development of new clinical employees by providing onsite educational programs and supported cell phone plan to replace pagers, and included the Field Force Manager that Integrated into backend clinical system to do scheduling.Education Bachelor of Science , Telecommunications Management DeVry University ï¼​ City , State Cisco Certified Network Associate (CCNA/CCAI) Leadership Training ITIL Foundations Certification Sniffer University - Sniffer Distributed Customer Relations, disaster recovery, educational programs, Employee Relations, financial, Ghost, information systems, Innovation, instruction,"
    },
    "top_cosine_jobs": [
        {
            "job_position": "Software Engineer",
            "company_name": "JWP (JW Player)",
            "job_description": "About JWP Connatix:JWP Connatix is the most comprehensive independent video technology and monetization platform, helping broadcasters, publishers, and advertisers deliver premium streaming and online video experiences while maximizing video revenue across all screens. The company offers an end-to-end platform that streamlines live and on-demand video with hybrid monetization models, unique data and insights, unmatched customer service, and the largest independent premium video marketplace, providing the entire media ecosystem with enhanced scale, transparency, and revenue.Our video players are embedded directly on publisher sites including Accuweather, Axel Springer, Dotdash Meredith, McClatchy, Penske Media Co., and more.We work with leading brands and agencies including American Express, Citi, Dentsu, Mars, UM, and more helping them target ads against our publishers' video content.We power streaming for over 2,000 blue-chip media companies, including 80% of the top 25 Comscore US publishers. As the largest independent global video network across CTV and OLV, we reach over 1B unique users and deliver 30B+ combined video plays and ad impressions every month.Flexible Work Policy:At JWP Connatix, we support a flexible work policy, with most employees working remotely. However, to align with our operational needs, we can only consider candidates residing in the same country as the job posting. This means applicants located outside the job's designated country will not be considered, and relocation assistance is unavailable.The Engineering Team:Our Engineering team at JWP Connatix is composed of passionate problem-solvers dedicated to building cutting-edge technology solutions. With a focus on monetizing customer content across billions of devices, our engineers thrive on innovation and collaboration. As part of this team, you will work closely with product and engineering leaders to develop frameworks and standards that impact the entire organization, driving efficiency and excellence across all projects.The Opportunity:We are looking for a talented and passionate Software Engineer to join our influential team, driving innovation and setting the standard for back-end development across our organization. You will play a crucial role in architecting scalable solutions, enhancing productivity through reusable components, and ensuring a consistent user experience across our products. This role offers the opportunity to work with a modern tech stack, contribute to industry-leading solutions, and keep our systems at the forefront of technology.As a Software Engineer, you will:Architect, design, and build robust, scalable back-end solutions to deliver a seamless customer experience across our product suite.Lead the implementation and deployment of critical platform components, ensuring reliability, performance optimization, and adherence to best practices.Work closely with product engineering teams to guide the integration of platform services, providing technical expertise and strategic direction.Identify and resolve performance bottlenecks, system failures, and operational challenges, proactively enhancing platform performance.Foster a culture of continuous improvement by driving process automation and implementing advanced observability protocols.Collaborate with early-career engineers, promoting technical excellence and professional development within the team.Stay updated on industry trends and emerging technologies, advocating for their integration into our platform architecture when appropriate.Requirements for the role:3+ years of experience in back-end engineering, with a track record of designing and developing large-scale, distributed systems.Proficiency in one or more programming languages: Python, Java, or Go.Experience with cloud platforms such as AWS, Azure, or GCP.Solid understanding of microservices architecture, containerization tools (Docker, Kubernetes), and infrastructure automation (Terraform, CloudFormation).Hands-on experience with CI/CD pipelines, automated testing, and deployment methodologies.Excellent problem-solving, organizational, and analytical skills.Strong communication and collaboration abilities, thriving in cross-functional environments.Bonus Points:Bachelor's or Master's degree in Computer Science, Engineering, or a related field.Experience with NoSQL databases, particularly Cassandra.Familiarity with large-scale data processing and analytics systems.Perks of being at JWP Connatix, North MacedoniaOur goal is to take care of you and ensure you will be successful in your new role. Your success is our success!As a full time employee, you will qualify for:Private Medical Insurance25 Paid Time OffNew Employee Home Office Setup StipendMonthly Connectivity StipendProfessional Development Reimbursement Program & Career Development ProgressionBi-Annual Hack Weeks for those who are interested in using their coding knowledgeFireside chats with individuals at JWP ConnatixCheck out our website and social channels: JWP ConnatixWe are an equal opportunity employer and value diversity at our company. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, and/or disability status.",
            "score": 0.08868520619453925
        },
        {
            "job_position": "Senior Test Automation Engineer",
            "company_name": "Netcetera",
            "job_description": "We are a team of experts who work together to design and develop software that matters. Netcetera strongly believes in and supports continuous professional development. We care about our well-being. At Netcetera, we share our expertise, foster exchange, and appreciate different approaches. Respect, reliability, commitment, and professionalism define us. Our teams work with agile development methodologies and use the latest technology. Netcetera specialists are part of an extensive network within the IT industry.As a Senior Test Automation Engineer you'll work in a very dynamic team of professionals assuring that our software products gets maximum support and reliability. We're looking for a bright, talented, experienced and responsible individual with great technical background, but in the same time a team player and someone who can stood up for the new demanding challenges on a daily basis. The ideal candidate must be self-organizing, proactive, self-starter and able to seek out information.Looking for a new challenge? Take the next big step in your career!The job ad is valid until 31.12.2024Your role: Designing, developing, and refining of automated testsPlanning, implementation, and execution of tests in the Mobile Payment/Authentication areaExtending the existing automated test framework covering aspects like functional tests, error provocation, performance tests and high-availability testsEnsuring high test coverage using automated continues integration testsTesting, qualification and ensuring quality of the delivered team artifacts for all customer projectsPresenting status and issues in clear concise manner to appropriate levels in managementWorking in conjunction with Product Management, Operations team and other stakeholdersBe able to function in a matrix environment with multiple stake holder often with competing priorities and requirements and with strict timelinesEvaluating new testing tools and provide POCsRequirementsYour profile:Bachelor's or Master's degree in Computer science, Information Science or related educational area from an education institution with strong reputation8+ years overall IT experience involving:Agile Methodologies, ScrumTest Management ToolsContinuous Integration through Jenkins, CI/CDManual Testing, API Testing experienceTest Automation experience:Good programming skills with one or more programming languages (e.g. Java, Perl, Shell and Bash Scripting)Good knowledge of Java, Spring Boot, Hibernate, Apache MavenPerformance Testing experience is nice to haveGood knowledge of HTTP(S), JMS and other modern protocolsGit, Stash and BitbucketExperience with DevOps tools and workflows such as Jira, Bamboo or equivalentsKnowledge of cryptography, authentication and authorization schemes and protocolsGood knowledge of databases and SQLKnowledge of any Linux OS (e.g. CentOS) i.e. should be familiar with Linux OS server deployment, starting/stopping processes, checking logs, sound knowledge of Linux/Unix CommandLineHands on experience of using Tools like - SOAPUI, Postman, SQL Developer etcKnowledge of different testing types like Unit, Integration, Regression, Functional etcExcellent written communication skills, as well as verbal; must be able to articulate technical aspects of solution/services to business executives and customersProven experience working in a distributed team setup and/or international teamAbility to:Translate business requirements into use case or test case and plan test activitiesDrive strategy through influence with leadership qualities which engineers recognize and respectInnovate and lead explorations into new technologies and strategiesEvaluate new technologies or tools, stay abreast with industry trendsNice to have knowledge in some of the listed technologies:DockerCucumberMicroservicesBenefits Flexibility: Adjust your time to work efficiently, be it working hours, part-time options, home office, or unpaid leave Extra vacation days: Need to take some extra time off? With us, you have the possibility to activate 5 additional paid days per year on top of your vacation plan Private health & Family Insurance: The company policy covers a private health insurance plan for you and your family Yearly Education Fund: We strongly believe in continuous development and would love to see you enrich your knowledge. Ever Netceterian has a dedicated yearly fund to invest in their professional and personal development through conferences, courses, lectures or long-term education Meals & Snacks: Enjoy a lunch allowance each working day, free fruit and drinks in the officeDiscover more benefits",
            "score": 0.08691634598694395
        },
        {
            "job_position": "Information Security Officer",
            "company_name": "Semos Cloud",
            "job_description": "Role SummaryWe are looking for a motivated Information Security Officer (ISO) to support our security efforts across the organization. In this role, you will contribute to securing our product, protecting company assets, and providing security assurance to our customers. This position is perfect for someone with a solid background in information security who is eager to take on practical responsibilities and grow in a SaaS environment.Key ResponsibilitiesAs an Information Security Officer, you will work in three main areas: Secure the Product and Infrastructure (Security Engineering), Protect the Company (Security Operations), and Assure the Customer (Security Assurance). Your specific tasks will include:Secure the Product and Infrastructure - Security EngineeringApplication and Infrastructure Security:Conduct security assessments and tests before and after deployment to spot vulnerabilities.Help find flaws in software configurations, detect malicious code, and manage patches or upgrades.Assist in putting a secure software development lifecycle (SDLC) into place and help train developers on current security best practices.Conduct security assessments for our PaaS and IaaS providers to ensure compliance with security standards.Enrich product security by implementing and improving the security measures by default and by design Security Research:Support research into vulnerabilities in company assets and SaaS applications we use.Assist in tracking fixes to ensure vulnerabilities are resolved on time.Protect The Company - Security OperationsSecurity Measures:Help put security measures in place and monitor them to protect the company and its assets.Security Improvements:Support efforts to improve security for the product and the company.Penetration Testing:Take part in realistic cyber attack simulations against company systems, property, and employees to find weaknesses.Incident Management:Help identify security anomalies and events, and support the Security Incident Response Team (SIRT) in handling incidents.Assure the Customer - Security AssuranceSecurity Compliance:Support the governance, risk, and compliance program tailored for SaaS as part of the second line of defense.Help keep a certification roadmap on track based on customer needs, including ISO 27001 and SOC 2.Assist in checking security controls, supporting fixes for audit findings, and participating in external certification audits.Risk and Field Security:Assist in supporting customer assurance activities as part of the company’s security team by providing materials, RFP updates, and customer assistance.Help to respond to customer inquiries and manage security questions accurately and on time, reporting any risks or trends you notice.Contribute to maintaining a Third Party Risk Management program to handle risks from external vendors.Develop and maintain security awareness training programs for employees to mitigate human-related security risks.To be successful in this role, you need Bachelor’s degree in Computer Science, Information Security, or a related field.3-5 years of experience in information security.Proficiency in English, both written and spoken.Good technical knowledge in areas like application security, vulnerability research, penetration testing, incident response, and security compliance.Familiarity with SaaS security and compliance frameworks such as ISO 27001 and SOC 2.Familiarity with security aspects of PaaS and IaaS providers (Azure, AWS)Hands-on experience with risk assessments, vulnerability management, security testing tools, and preparing and maintaining security documentation (white papers, policies, and guidelines).Strong communication and teamwork skills, with the ability to collaborate with technical teams, developers, and customers.Nice to HaveExperience in a B2B SaaS setting is a plus.Some understanding of data privacy regulations and compliance needs.Eagerness to learn and grow in a fast-moving security environment.Reasons to join our team Already proven, qualified, certified to play in the Champs League.  Truly global, enterprise customer base & brands to grow. In serving customers, together we grow for a better world. Read more about our customers here  You get to play with superb innovative cloud technology and agile working framework Learn more about our platform here  Our people at placed the center of the business. Dynamic SaaS, visionary leadership, and team spirit to win Learn more about us here  Our values derive from our people-centered culture. We are culture believers, driven by continuous growth, quick to move from planning to action, fearless in experimenting, and humbly working to change the world for the better. Read more about our culture here What We OfferCompetitive Salary Private Health Insurance Referral Bonus Program Hybrid Work Training and Coaching Opportunities Culture Fest (tickets for cultural events) Ergonomic workspace with kitchen offering healthy food options and beverages Sportmaster or FitKit Membership Psychological Health Support Program Off-site Team Building Events Office Skopje (hybrid)Team Legal & ComplianceReport toHead of LegalWorking Hours Monday – Friday 09:00 – 17:00 CET",
            "score": 0.08072378527930937
        }
    ],
    "top_bert_jobs": [
        {
            "job_position": "Systems Engineer - North Macedonia",
            "company_name": "Fortinet",
            "job_description": "Job DescriptionSystems Engineer – North MacedoniaLocation: Remote / North MacedoniaWhy Fortinet?Fortinet is one of the fastest-growing cybersecurity companies in the world. We have proven to be a truly innovative technology driven IT security Company. Fortinet’s mission is to deliver the most innovative, highest-performing network security fabric to secure and simplify IT infrastructures. Today we secure the largest enterprises, service providers and government organizations across the globe.Systems Engineering teamExperienced and passionate professionals, who lead all technical aspects of a sales cycle with the customer, from the initial RFIs, through to RFPs & RFQs when required. This includes the project management and active participation in POCs in partnership with the relevant teams both internally and within the customer and/or commercial partner.Your GoalsMaximize the Fortinet opportunity coverage and brand awareness in the market. Continuously improve knowledge around the Fortinet products and solutions, along with maintaining a deep understanding of the competitive landscape and Fortinet’s ability to provide long lasting protection against the ever-evolving threats. Position Fortinet solutions to the customer, whether this be remotely or in person.Develop relationships with key enterprise partnersAbout YouHave a high aptitude for security technology in network, endpoint and application areas. The CISSP accreditation would also be beneficial.Expert in the current technologies and trends in IT securitystrong understanding of RADIUS, PKI, IKE, Certificates, L2TP, IPSEC, FIREWALL, 802.1Q, MD5, SSH, SSL, SHA1, DES, 3DESAre currently or have previously worked in a pre-sales engineer role, managing end-to-end technical aspects of deals, through to technical closure.Can demonstrate your problem solving skills and how this impacted key wins within your current organization.Understand and can demonstrate your ability to build and maintain customer and partner relationships, including your ability to effectively communicate technically to a range of both external and internal stakeholdersWhat we offer?Competitive basic salary, uncapped commission with progressive multiplicators, employee stock and stock awards, health and welfare benefits.Flexible working approach, this is a field-based role, you can operate from anywhere in North MacedoniaEmpowering and supportive working environment, where you can be yourselfInnovative, collaborative and dynamic company with a double-digit growth over the last decade.Training on the job with many other formal trainings and industry recognized certifications.Our CommitmentFortinet is an equal opportunity employer. We value the diversity in our company, and all qualified applicants will receive consideration for employment without regard to race, colour, religion, gender, sexual orientation, gender identity, nationality in addition to any other applicable legally protected characteristics in the location in which the candidate is applying.",
            "score": 0.9209638237953186
        },
        {
            "job_position": "Machine Learning Lead",
            "company_name": "Loka",
            "job_description": "At Loka we use a modern tech stack to support meaningful projects across a huge range of industries. In the last year we’ve helped clients advance the world’s #1 AI reading tutor, eliminate $1B in food waste and develop novel drugs for fighting cancer, all while enjoying every other Friday off. Join us, feed your need to grow and ship projects you believe in with a team you’re proud to lead.We’re seeking a Machine Learning Team Lead to deploy, secure and maintain ML models in production environments, mainly AWS. The ideal candidate will not only apply their technical brilliance but also take a leadership role in contributing positively to Loka’s unique culture.The RoleLead a team of ML engineers in architecting, building and optimizing scalable, cost-efficient ML models and ensuring performance in production environments.Provide constructive team feedback through regular one-on-one meetings and drive technical and professional development.Manage end-to-end ML projects, including data exploration, model development, deployment and scaling while delivering solutions that meet business and client needs.Collaborate with stakeholders to align ML initiatives with strategic objectives, ensuring clear communication with both technical and non-technical audiences.Drive technical innovation within the team by staying current with the latest AI/ML trends, implementing cutting-edge techniques.Foster the team's professional growth by creating development plans and encouraging a positive, collaborative remote working environment.Own the development and automation of ML workflows, including data pipelines and model deployment, with a focus on scalability and efficiency.Ensure strong cross-functional collaboration with Data Engineering, DevOps, BackEnd and other teams to deliver cohesive solutions.Work closely with senior leadership to align ML initiatives with long-term company strategies.Hard Skills Requirements5+ years of experience in machine learning, with 3+ years leading a teamStrong knowledge of Python, ML libraries and frameworks such as PyTorch, HuggingFace and TensorFlowHands-on experience with GenAI solutions using LLMs (even if not at an expert level), including prompt engineering and an understanding of common patterns like RAG and NLQClient-facing experience, including the ability to gather requirements, set expectations and deliver technical presentations, sometimes to non-technical peopleBachelor’s degree in Computer Science, Engineering or related fieldAdditional RequirementsExcellent English language skills - Being a global team, we work entirely in English for meetings, customer calls and business communicationsCV written in EnglishNot Required but Nice to HaveExperience with AWSExperience in consultancy environments or startups, including working directly with clients, managing projects and adapting to different settingsFamiliarity with MLOps best practices and toolsPersonality ProfileCuriosity: Eager to stay ahead in the rapidly evolving ML field and apply new technologiesAutonomy & Positivity: Thrives in a remote, globally distributed teamLeadership: Capable of leading with empathy, motivating team members and fostering a collaborative cultureAdaptability: Comfortable operating with a startup mindset, able to pivot and scale quicklyClient-Focused: Understand client needs and balance them with technical realities to deliver impactful solutionsBenefitsEvery other Friday off (26 extra days off a year)Remote and flexibleExplore and Relocation programs (three months work abroad or full international relo)Paid sick days and local holidaysPremium mental health subscriptionsAccess to LokaLabs™, our internal research and development programLokaLabs incubatorFitness subscriptionMental wellness programsDefined career pathBusiness English classesYour achievements matter to us! Ensure your CV, LinkedIn and GitHub profiles are up to date and accurately reflect your experience.",
            "score": 0.9068203568458557
        },
        {
            "job_position": "Technical Customer Success Manager",
            "company_name": "Blackfluo.ai",
            "job_description": "Job Description:Location: Fully remote, EU timezone (CET +/- 2hours)Start date: ASAPLanguages: Fluent English is mandatoryIndustry: Cloud Computing / Web3 / AI - European SaasBlackfluo.ai is a fully remote company with teams located around the globe. We specialize in developing SaaS solutions for businesses and consulting firms. Our innovative AI assistant is designed to support daily operations by taking over repetitive and time-consuming tasks, allowing our clients to focus on what truly matters.Responsibilities:Direct Customer Engagement: Take an active, hands-on approach to customer communication, personally responding to inquiries, feedback, and reviews across all channels, including emails, social media, community forums, and particularly app stores. Your direct responses will not only resolve issues but also build trust and loyalty among our customer base.Voice of the Customer: Champion the customer's voice ensuring that feedback gathered from direct interactions is clearly communicated and acted upon.Automation and Efficiency: Implement and optimize AI-driven tools and other technologies to streamline routine support tasks, aiming for faster and more effective resolutions to customer inquiries.Multi-Channel Support Management: Oversee a cohesive and integrated customer support strategy across various platforms to ensure a seamless and high-quality customer experience.Knowledge Base and FAQ Enrichment: Regularly update our knowledge ensuring that our self-help tools are accurate, comprehensive, and effective.Cross-Functional Collaboration: inform and influence product development, feature prioritization, and issue resolution, ensuring a customer-centric approach in all product decisions.Skills and Competencies:Exceptional Direct Communication Skills: Demonstrated ability to engage directly with customers across multiple channels, providing empathetic, clear, and effective responses to inquiries, feedback, and reviews. Your communication skills bridge the gap between our customers and our product, making you the face and voice of our clients brand.Advanced Technical Proficiency and Tool Use: Experience with customer support platforms (e.g., Zendesk, Salesforce), feedback management on digital platforms (e.g., Google Play Store, Apple App Store), and agile collaboration tools (e.g., JIRA, Confluence) to ensure efficient operation and continuous improvement of the support function.Qualifications:A relevant diploma or associate degree in Business Administration, Communication, or a related field. While a Bachelors degree is advantageous, we highly value practical experience and specific skills in our candidates.A minimum of 8 years of experience in customer support, with a focus on digital or tech products. Experience in a leadership role is a plus.Demonstrated proficiency in using customer support technologies, including experience with CRM platforms (e.g., Zendesk, Salesforce) and familiarity with managing feedback on digital platforms (e.g., Google Play Store, Apple App Store).Solid understanding of agile methodologies and experience with collaboration tools such as JIRA and Confluence, showcasing the ability to work effectively in a dynamic and fast-paced environment.Fluency in English is a must (written and spoken)Web3 / Blockchain experience is a ++",
            "score": 0.903957724571228
        }
    ]
}