{
    "cv": {
        "full_name": "15651486",
        "skills": "Skills",
        "experience": "Seeking a position as a Director of I.T. in a company where I am able to utilize my experience and training in networking, troubleshooting, and Work Experience",
        "education": "Education and Training"
    },
    "top_cosine_jobs": [
        {
            "job_position": "Senior Test Automation Engineer",
            "company_name": "Netcetera",
            "job_description": "We are a team of experts who work together to design and develop software that matters. Netcetera strongly believes in and supports continuous professional development. We care about our well-being. At Netcetera, we share our expertise, foster exchange, and appreciate different approaches. Respect, reliability, commitment, and professionalism define us. Our teams work with agile development methodologies and use the latest technology. Netcetera specialists are part of an extensive network within the IT industry.As a Senior Test Automation Engineer you'll work in a very dynamic team of professionals assuring that our software products gets maximum support and reliability. We're looking for a bright, talented, experienced and responsible individual with great technical background, but in the same time a team player and someone who can stood up for the new demanding challenges on a daily basis. The ideal candidate must be self-organizing, proactive, self-starter and able to seek out information.Looking for a new challenge? Take the next big step in your career!The job ad is valid until 31.12.2024Your role: Designing, developing, and refining of automated testsPlanning, implementation, and execution of tests in the Mobile Payment/Authentication areaExtending the existing automated test framework covering aspects like functional tests, error provocation, performance tests and high-availability testsEnsuring high test coverage using automated continues integration testsTesting, qualification and ensuring quality of the delivered team artifacts for all customer projectsPresenting status and issues in clear concise manner to appropriate levels in managementWorking in conjunction with Product Management, Operations team and other stakeholdersBe able to function in a matrix environment with multiple stake holder often with competing priorities and requirements and with strict timelinesEvaluating new testing tools and provide POCsRequirementsYour profile:Bachelor's or Master's degree in Computer science, Information Science or related educational area from an education institution with strong reputation8+ years overall IT experience involving:Agile Methodologies, ScrumTest Management ToolsContinuous Integration through Jenkins, CI/CDManual Testing, API Testing experienceTest Automation experience:Good programming skills with one or more programming languages (e.g. Java, Perl, Shell and Bash Scripting)Good knowledge of Java, Spring Boot, Hibernate, Apache MavenPerformance Testing experience is nice to haveGood knowledge of HTTP(S), JMS and other modern protocolsGit, Stash and BitbucketExperience with DevOps tools and workflows such as Jira, Bamboo or equivalentsKnowledge of cryptography, authentication and authorization schemes and protocolsGood knowledge of databases and SQLKnowledge of any Linux OS (e.g. CentOS) i.e. should be familiar with Linux OS server deployment, starting/stopping processes, checking logs, sound knowledge of Linux/Unix CommandLineHands on experience of using Tools like - SOAPUI, Postman, SQL Developer etcKnowledge of different testing types like Unit, Integration, Regression, Functional etcExcellent written communication skills, as well as verbal; must be able to articulate technical aspects of solution/services to business executives and customersProven experience working in a distributed team setup and/or international teamAbility to:Translate business requirements into use case or test case and plan test activitiesDrive strategy through influence with leadership qualities which engineers recognize and respectInnovate and lead explorations into new technologies and strategiesEvaluate new technologies or tools, stay abreast with industry trendsNice to have knowledge in some of the listed technologies:DockerCucumberMicroservicesBenefits Flexibility: Adjust your time to work efficiently, be it working hours, part-time options, home office, or unpaid leave Extra vacation days: Need to take some extra time off? With us, you have the possibility to activate 5 additional paid days per year on top of your vacation plan Private health & Family Insurance: The company policy covers a private health insurance plan for you and your family Yearly Education Fund: We strongly believe in continuous development and would love to see you enrich your knowledge. Ever Netceterian has a dedicated yearly fund to invest in their professional and personal development through conferences, courses, lectures or long-term education Meals & Snacks: Enjoy a lunch allowance each working day, free fruit and drinks in the officeDiscover more benefits",
            "score": 0.09109339935701603
        },
        {
            "job_position": "Junior Data Extraction Developer (Python)",
            "company_name": "ProjectFitter.ai",
            "job_description": "Our team keeps expanding! We are looking for a fast-learning Junior Data Extraction Developer who loves Python, code quality and ensures data security to unlock the raw potential of Big Web Data.Together We Will:Develop efficient web scraping scripts for E-Commerce data extraction using Python;Ensure high-quality data output through the identification and resolution of issues;Troubleshoot and provide support for client-reported bugs and system problems;Collaborate with team members, maintaining regular communication and escalating unresolved issues to the appropriate personnel;Implement testing procedures for Python-based web scraping scriptsRequirementsWhat We Will Need: Fluent written and spoken English;1-2 years of commercial experience with Python coding and scripting;  Strong web scraping experience using Python or Java;Experience in code development with JavaScript, HTML & CSS;HTML structure knowledge (how to extract entities);Hands-on experience with Linux;Strong familiarity with GitHub;Experience working with Relational Databases;Experience with web protocols, HTTP, networking problem-solving;Ability to prioritize tasks; Good documentation skills. Would Be a Plus:Experience working with Non-relational Databases;Understanding or experience with data collection, big data;Experience in the field of E-commerce / News, blogs; Ability to work for a common result;Great sense of humor 🙂BenefitsWe Offer:Lots of interesting work with a Big Web Data solutions;Compensation in USD;International team;Schedule: Sunday to Thursday; Fully remote",
            "score": 0.07901851422025101
        },
        {
            "job_position": "Data Scientist",
            "company_name": "Scalefocus",
            "job_description": "Are you a motivated Data Scientist, willing to grow as a professional and work on large-scale projects, using different working approaches that are both diverse and cutting-edge? Are you passionate about innovative and top-notch software solutions and want to be part of like-minded professionals? Do you enjoy working in a fast-paced, yet collaborative environment?If your answer is “Yes”, we would love to talk to you.What your responsibilities are going to be?Apply large language models (LLMs) to specific business problems to extract, process, classify and derive insights from the information hidden in unstructured datasets.Develop domain- or task-specific language models for business problems when proprietary or off-the-shelf models cannot be used.Evaluate the performance of machine learning models and make recommendations for improvement.Research and experiment with key technologies to remain up to date with the state of the art in NLP and generative AI research.Generate clean, efficient, and documented Python code.Offer direction and expertise to junior team members, promoting a culture of learning and knowledge sharing.Actively participate in code reviews and contribute to the establishment of software development best practices.Assist in data projects assessment, discovery, and design phasesWhat qualifications are needed?3+ years of experience as Data Scientist and hands-on experience with large language models (GPT, XLNet, T5, etc.).Advanced skills in Python development including libraries like NumPy, SciPy and experience with SQL.Strong communication and presentation skills, with the ability to explain technical concepts to non-technical stakeholders.Practical experience in working with cloud platforms, MS Azure, AWS or Google Cloud.AdvantagePhD or Master’s degree in Computer Science, Data Science, Machine Learning, Theoretical Linguistics or a related field. Relevant working experience may compensate for lack of education.Experience with containerization, Kubernetes (K8S) and application deployment.Knowledge or experience with vector databases such as Pinecone, Milvus, or Weaviate would be beneficialBy joining us:• You will have the chance to bring your technical expertise, enthusiasm, and entrepreneurial mindset, and shape the way we transform the business (and lives) of our clients, partners and society.• You will be surrounded by other highly performing team members and will have the chance to grow and scale with us.• You will become part of a thrilling and collaborative environment where you will be able to share your ideas and gain insightful feedback.• You will enjoy flexibility and be able to keep the balance between your personal and professional life and focus on what’s important.All applications will be treated in strict confidentiality.",
            "score": 0.07834528750555209
        }
    ],
    "top_bert_jobs": [
        {
            "job_position": "IT Sales Development Specialist (BG)",
            "company_name": "SupportYourApp",
            "job_description": "Passionate about technology and possess excellent communication and negotiation skills? Now you have a chance to be a part of the world's leading SaaS, Software, or Hardware solutions as a Sales Development Specialist.In this role, you will be responsible for establishing the first contact with leads, generating qualified leads, nurturing strategies with potential clients and contributing to the overall sales pipeline.Excited? Let's see what it takes 💛What you will do:Generate new leads through multiple channels;Qualify inbound leads based on predefined criteria and do the first communication touchpoint;Create, develop and implement outbound strategies;Build relationships with key decision-makers at target companies to grow opportunities in the sales pipeline;Nurture existing leads: build and maintain relationships with prospects through consistent communication;Ensure smooth handoff and communication with the Growth Team on qualified leads;Keep records in the CRM system accurate and up-to-date;Collaborate with senior staff members in order to develop sales opportunities (communication with clients, agreement preparation, update deals in CRM, etc.);Coordinate with other team members and departments to optimize the sales effort (e.g. research tasks);Achieve and exceed individual targets and KPIs, such the number of qualified leads, conversion rates and appointments set;Attend regular team meetings, discussions, brainstormsWhat you need to succeed in this role:Fluent English (C1-C2 both in writing and speaking);Excellent communication and negotiation skills;1+ years of experience in sales development, leadgen or related roles in a B2B environment, ideally within the IT industry;Familiarity with CRM systems (HubSpot) and prospecting tools;Experience in building outbound and lead generation strategies to engage leads into the overall sales pipeline;Inbound lead qualification skills to respond to inbound inquiries and qualify them based on predefined criteria;Discipline and great time management skills;Stress resistance and ability to communicate assertively, handle feedback and work on improvement;Ability to perceive, use, understand, manage, and handle emotions in different situations;Ability to work independently and as part of a team in a fast-paced environment;Fast learning skills, adaptability to new environments and flexibility to quickly grasp new concepts;Out of the box thinking with desire to explore creative ideas with a proactive approachBenefits and Perks:Business hours;Opportunity to work fully remotely;Inclusive international environment;Compensation in USD;Good bonuses for referring friends;Paid intensive training and probation;Work-life balance;Responsive management interested in your growth and long-lasting cooperation;Greenhouse conditions for self-developmentWho we are:SupportYourApp is a Support-as-a-Service company that provides secure technical, customer support, and CX services for tech companies around the globe.We work with clients from over 30 countries and speak over 60 languages.Since 2010, we've become an industry leader in premium outsourced customer support and turned global with 8 hubs around the world.We treat our team like our clients, surrounding them with unlimited care, an individual approach, and a wholesome positive experience.We welcome people with various backgrounds and experiences. Grab the chance to join us and send your CV in English, pointing out your outstanding skills!Visit our website: http://www.supportyourapp.com/ We are a multinational company with unbiased views. The assessment of candidates is not affected by such characteristics as race, sex, color, religion, age, national origin, marital status, disability, veteran status, genetic information, sexual orientation, gender identity, or any other reason prohibited by law in provision of employment opportunities and benefits",
            "score": 0.8417452573776245
        },
        {
            "job_position": "Technical Business Analyst",
            "company_name": "scandiweb",
            "job_description": "Department: Business DevelopmentLocation: North MacedoniaCompensation: €1,765 - €2,245 / monthDescriptionFor every person joining us for any position, there is a path and an opportunity to reach an executive role and become a company partnerAntons Sapriko, Company FounderHere is a video story of a colleague who joined the Key Account Manager team:Laura Balode, Gaining experience and becoming an eCommerce expert Key Account Manager. Latvia.﻿﻿*Please note that the salary is stated as a NET amount due to international hiring considerations. In the event of employment, the specified ranges will be adjusted to include applicable taxes.How to Become a Technical Business Analyst at scandiweb eCommerce Expert Team?We are a very inclusive company with colleagues from over 30 countries across all continents. Our ratio of females is among the highest in the industry. We welcome people from all walks of life who can complete a test by showing their skill and knowledge.While a solid understanding of web technologies and development processes, experience in managing projects, and ability to analyze complex business requirements are expected in this role, we value your ability to deliver results starting from the test task, and your enthusiasm and openness to embrace new knowledge and processes. Continuous learning and acting on feedback are among our core organizational values.What are the responsibilities of a Technical Business Analyst?As a Technical Business Analyst at scandiweb, you will play a pivotal role in bridging the gap between our client's business objectives and our technical solutions.Your primary responsibility will be to conduct comprehensive discovery sessions, both onsite and online, to analyze and plan potential web projects. This involves leading workshops with clients to delve into various aspects of their projects, meticulously scoping out requirements, and producing detailed documentation.The culmination of your efforts will be a thorough estimate of the project's development costs, which you will present to the client before transitioning the project to our delivery department.Our projects range from large-scale eCommerce solutions to mobile applications and custom-built systems, ensuring a diverse and challenging work environment.What do we expect from you?Detail Orientation: A keen eye for detail is essential to ensure all project aspects are accurately captured and documented;Technical Proficiency: A solid understanding of web technologies and development processes to effectively communicate with both clients and technical teams; Analytical and Logical Thinking: Ability to analyze complex business requirements and translate them into actionable project plans; Communication Skills: Excellent verbal and written communication skills to facilitate clear and effective client interactions and documentation; Confident written and spoken English skills. You will be working internationally;Project Management: Experience in managing projects from inception through planning, ensuring timelines and deliverables are met; Client Engagement: Proven ability to build and maintain strong client relationships, understanding their needs and delivering solutions that meet their objectives; Business Insight: A proactive ability to understand the client's business and identify potential opportunities where our solutions can bring additional value.Further career growth for Technical Business Analyst?You will get support in career counseling from our HR department as each career path is unique taking into account your personal strengths and ambitions.Further professional growth and development can lead you to become a senior, team lead for one and/or multiple teams, heading a particular practice, and ultimately working with top accounts like Puma, The New York Times, or Läderach.What is the compensation package of a Technical Business Analyst at scandiweb?Competitive starting salary relative to the market;Valuable eCommerce experience at the industry leader scandiweb;Substantial monetary bonuses based on successful lead conversion to client;Exciting travel opportunities;Support for hardware upgrades;Core health insurance coverage and sports bonuses;A diverse multinational team of experts to learn from;Company-covered training and certification;Legendary online and onsite events to celebrate our success together.Next stepsApply and fill in the application form;Receive the test task and complete it.Here is what people who joined the Key Account Management team want to share with you:\"My journey with scandiweb started unexpectedly and out of curiosity. I saw an ad for a Junior Project Manager position and since I was somehow in IT but with little experience, I decided to try it out. It was a huge surprise to receive an offer and make it all happen.My first projects were in different stages and on different levels of experience needed. However, I was not hesitant to jump on them! North Coast Pottery (US client), Stenders (LV client), and Hebes Code (Spanish client). Being able to work on projects within different stages of development allowed me to learn the full cycle fairly quickly and progress in a speedy mode!With the vast experience from the 3 projects, I continued my growth by joining Business Development (BD) - and that's when my career took a massive turn. After learning all the basics, I was made a Key Account Manager of 5 different accounts at scandiweb.The best things I have learned and gained thanks to scandiweb? Self-confidence and believing in my experience. They allowed me to grow at my own pace and gave me an enormous amount of trust. The freedom of being able to work within your own frames makes you feel like the processes are not there! All of the teams and managers I worked with, valued me for who I am, and leveraged my strengths to the best advantage.\"Dominika Plata, Key Account Manager from Poland. Joined the company on 4/3/2023.\"I was looking for a company working in a variety of technologies and frameworks related to eCommerce, and scandiweb was the best suitable for this. I remember my first project was Christmas Tree World in which we did a Magento 2 Fresh build with data migration from the old Magento 2 website.I had the opportunity to lead the project discovery calls with the client to finalize the requirements, analyze and document the proposed implementation, and provide a project work estimate. Getting a chance to be involved in all things discovery enhances your technical skills and develops interpersonal skills and client communication.I have learned that the best things on scandiweb are teamwork, handling responsibilities, and knowledge of eCommerce related technologies like iPaaS and PIM.\"Anup Wankhede, Key Account Manager from India. Joined the company 10/30/2023.",
            "score": 0.8381874561309814
        },
        {
            "job_position": "Junior IT System Administrator",
            "company_name": "Casumo",
            "job_description": "Casumo is an equal opportunity employer. We celebrate diversity and are committed to creating an inclusive environment for all employees.Join us at Casumo, where you are invited to be your authentic YOU-MO!Company Overview:Welcome to Casumo, your passport to a world of fun, excitement, and responsible gaming. We're an international online casino company with a knack for creating unforgettable gaming experiences. Our secret sauce? A blend of innovation, security, and a dash of playful charm.Nowadays, we're on the hunt for a dynamic Junior System Administrator!Position Overview:Our Internal IT team offers the most pleasant and productive environment to Casumo’s biggest asset: its people. Reporting to the Internal IT Lead, the system administrator researches, analyses, implements and iterates in order to find the best tools which will help our employees focus on what matters. We pride ourselves in our ability to never stop improving; continuously striving to make things better and better. We love innovative, yet simple things, that just work, and help us do our job.Responsibilities:Assisting in support and daily running of internal IT, making it your own and continuously improving it.Working in tandem with other teams to make the on-boarding of new colleagues as smooth as possible.Continuously learning and understanding SaaS applications, endpoints and networks to further enhance our day to day tasks.Administering our Atlassian Portfolio - assisting our employees to increase productivity across the board.Working towards automating day to day tasks and maintaining up-to-date technical documentation.Understanding that the remote collaboration experience is core to us, and finding the best ways to make our colleagues on remote feel like they’re right here in the office.On occasions, the position may include travel to other offices to offer hands-on supportRequirements:You have a sharp technical mind with a passion to learn.You possess a solid understanding of network fundamentals and security concepts in a corporate environment.Willing to make up for your lack of experience by investing time and energy in research and expanding your knowledge and applying what you have learned in a structured approach.Day to day experience managing Google Workspace or Microsoft Office 365. No expert background required - just basic administration.Knowledge in Atlassian products (Jira, confluence..) will be considered as an asset.Additionally, you also bring:A solid and logical approach to troubleshooting.Strong team player skills and the ability to work harmoniously with a diverse workforce.True passion about technology and automation.You can't wait to learn something new, apply it and share the information with your colleagues.You are diligent and self organised.The ability to communicate simply to technical and non-technical audiences.Think we're a good match? Apply now!The Perks (Macedonia Office)Being a part of the Casumo group provides an unparalleled experience. You’ll find yourself surrounded by the brightest minds within the most inspiring and collaborative office spaces! In addition to that, you’ll enjoy:Private health insuranceWellness incentives, including a fitness allowance and mental well-being services2 weeks Work From Anywhere (10 days), increased to 4 weeks (20 days) after longer duration of employment within the Company: explore the world while working remotelyOffice lunches - three times per weekAccess to some of the greatest tools and platforms for developing your professional skills and building success within your roleA range of training courses, known as Casumo College, for continuous learning and growthSocial events for building strong relationships with colleagues from all across the organisationOur ABC values:ASPIREAt Casumo, \"aspire\" means pushing beyond the ordinary and transforming obstacles into stepping stones. Challenges are our breakfast of champions, and comfort zones are out of bounds. Mediocrity? Left behind. Our mantra? Dream big, aim high, and always be ready for the next adventure in innovation.BELIEVEBelief at Casumo isn't just a feel-good sticker; it's the glue that binds us. Turning \"me\" achievements into \"we\" victories, we're a tight-knit crew of dreamers, doers, and relentless supporters. With a high-five arsenal and a trusty cheerleading squad, we're on a mission to prove that together, we're not just strong; we're Casumo strong.CARECare is our secret ingredient, the cherry on top of our game. It's not only about ensuring our players have a blast (responsibly, of course); it's about weaving a fabric of support so tight, even the toughest challenges can't tear us apart. From tailoring player experiences to being there for each other, we're all about creating memorable moments.",
            "score": 0.8286035656929016
        }
    ]
}