{
    "cv": {
        "full_name": "16186411",
        "skills": "Net Technologies: .Net Framework 4.0/4.5, ASP.Net, ASP.NET MVC, VB.Net, ADO.Net, Entity Framework, AJAX, Web Service, Skills",
        "experience": "JavaScript, jQuery, CSS, Bootstrap CSS, HTML, XML and AJAX. Strong experience in data retrieval and manipulation using ADO.Net data objects such as Dataset, Data Reader, Data list, Data Adaptor, Entity Frame work. Good experience in writing Class Library using C# , LINQ to Based Authentication and Role-Based Authorization. Involved in bug fixes and production support. Worked closely with Scrum Master for Professional Experience There are three roles tied to application they are Tutee, Tutor, and Scheduler. Used role based authorization for various pages. Filtering of the data of listview based on the role. for late fee assessment Access to page based on the role (Role based authentication) Personalized Email for Outlook: The goal of the",
        "education": "(ADN), DoIT which supports University of Missouri System faculty and students through agile and rapid creation of new applications. GoAdmin: Description: GoMizzou is the University of Missouri flagship mobile application, designed to provide services to all possible users of the university. Education Master of Science , Computer Engineering Present University of Missouri ï¼​ State GPA: GPA: 3.7 Computer Engineering GPA: 3.7 Bachelor of Technology , Electrical and Electronics Engineering May 2013 Jawaharlal Nehru Technological University India GPA: GPA: 3.65"
    },
    "top_cosine_jobs": [
        {
            "job_position": "R&D Full-Stack AI Engineer & Data Scientist",
            "company_name": "Deltatre",
            "job_description": "In this role you will research, develop and test cutting-edge algorithms/models to analyze diverse sources of data. Additionally, you will produce new Demo and Proof of Concepts (small-scale projects to test the feasibility of new ideas) that will become part of Deltatre Innovation Lab assets.Curiosity and a desire of continuous learning are highly valued in this role, as you will be working within the Deltatre Innovation Lab. This entity focuses on developing solutions based on advanced technologies to enhance Deltatre’s value proposition.As part of the job, you will:Research, develop, and deploy AI/ML solutions in various contexts like audio, images, video, text, Generative AI, Spatial Computing, etc.Build prototypes and PoCs to assess the feasibility of new AI-driven ideasSupport design and implementation of full-stack applications, including frontend, backend, and infrastructure componentsOptimize and monitor AI models performance and scalabilityExplore and propose emerging technologies and tools in AI and software engineeringWork closely with cross-functional teams to transform prototypes into production-ready solutionsShare knowledge and mentor team members in AI, software development, and best practicesRequirements:3+ years of relevant work experience in the same role or a similar oneProgramming languages – proficiency in Python + experience with one or more of C++/C#/Java/Rust/TypeScript (the more the better)Development Experience in backend (Python, .NET, ASP.NET, Node.js) and/or frontend (React, or Angular)Strong statistical and mathematical foundationExperience with common Data Science toolkits (scikit-learn, Pandas, NumPy, Jupyter Notebooks…)Understanding of common ML/DL libraries and frameworksExperience with at least one the frameworks such as Tensorflow / Pytorch. Both is a plusProblem solving ability, particularly when dealing with large datasetsComfortable in working in international teamsAbility to work independently and be a self-starterAbility to work on multiple projects and sustaining frequent context switchesGood organizational and communication skillsFluent in EnglishCuriosity and desire to learnBonus knowledge:Agile (Scrum) best practicesExperience with platforms for AI model deployment, such as: Azure AI Services, Google Vertex AI, AWS SageMaker, IBM Watson ML StudioInfrastructure & Ops experience (Docker, Kubernetes, Terraform, GitOps, MLOps, or similar).Certifications from MOOCs (fast.ai, Coursera, Stanford, etc.)Experience with public speaking or technical workshops",
            "score": 0.11062103033570524
        },
        {
            "job_position": "Business Analyst",
            "company_name": "PXC",
            "job_description": "This role is based in North Macedonia.PXC (part of the TalkTalk Group) is the UK’s leading value for money connectivity provider. We believe that simple, affordable, reliable, and fair connectivity should be available to everyone, and we reward our team for being part of that mission of change.About the teamThe Senior Data Quality Analyst role sits in the Data Quality team within the Data Authority team. Data Authority is part of the Architecture and Software Solutions Function and is part of the Software Engineering and Complex Services Department, which sits within the Technology Business Unit. The role reports to the Data Quality Manager. Dealing directly with the business to provide data quality solutions and data expertise support for business problems.About the roleThe Senior Data Quality Analyst will work across all the PXC domains and be responsible for providing data quality reporting for all data across the PXC working to ensure data is accurate and compliant.The role consists of leading Data Quality projects, completing data audits, ensuring the Business are adhering to the data quality standards, enabling the business to proactively monitor the quality of our data, to educate and support the Business on the data quality dimensions.Key Responsibilities in the role:Accountability, Ownership, Authority· Analyse and validate data for accuracy, consistency, and integrity.· Work collaboratively with the business to understand their data quality challenges and formulate solutions for proactive monitoring and treatment· Implement data quality standards and processes· Generate reports and presentations for business stakeholders· Use statistical tools and software to interpret and analyse data· Manage and deliver data quality projects/requests within agreed timelines· Document processes and solutions for both business and technical audiences· Promote data quality awareness across the business, highlighting benefits and risks· Develop and apply expertise in data mining, problem solving, and data presentation for accurate insights· Complete data quality impact assessments on new projects and BAU activities· Educate and support the business in defining data quality rules and KPI targets· Promote the Data Governance framework across PXC· Provide support and mentorship to other Data Quality team members· Act as an advocate for better quality data, engaging key stakeholders to drive an understanding of the value of good quality data · Work closely with the Data Owners/Stewards across the group to improve the quality and value of dataRequirementsTechnical skillsProven experience as a Senior Data Quality Analyst or similar roleProficiency in data management tools (e.g. Purview, Atlan) Expert proficiency in analysis tools (e.g., SQL, Excel)Expert proficiency in various Database Management Systems (e.g. Snowflake, Azure, Netezza)Experience with data visualisation tools (e.g. Power BI)Excellent analytical and problem-solving skillsKnowledge of data quality standards and best practicesSoft skillsStrong communication skills to convey complex technical information to non-technical stakeholdersAbility to work collaboratively with cross-functional teamsExcellent attention to detail and organisational skillsStrong time management skillsAbility to provide feedback and impart knowledge and expertise to less experienced members of the teamStaff BenefitsInternational career Hybrid working policy Collective insurance2 days off a year to volunteerPrivate healthcare post-probation1 day off for your birthday per annumFit Kit appWellness programReward and recognition programModern office space in the city center with free parkingLatest technology and equipmentFree food and beveragesInternal platform for learning and developmentAnnual bonusWorking hours: 10 am – 06pm MK time *By sending your CV and motivation letter, you agree that your personal data will be processed for the needs of recruitment and selection by Causeway Connect (КоннектвејДОО Скопје) and they will be stored in our database.Note: Candidates can withdraw their permission to process their personal documents at any time by sending a notification to the e-mail: jobs@causewayconnect.com",
            "score": 0.10910669059331768
        },
        {
            "job_position": "Data Analyst",
            "company_name": "PXC",
            "job_description": "This role is based in North Macedonia.PXC is the UK’s leading value for money connectivity provider. We believe that simple, affordable, reliable, and fair connectivity should be available to everyone, and we reward our team for being part of that mission of change.About the roleThe Data Quality Analyst will work across all the PXC domains and be responsible for providing data quality reporting for all data across the PXC working to ensure data is accurate and compliant.The role consists of leading Data Quality projects, completing data audits, ensuring the Business are adhering to the data quality standards, enabling the business to proactively monitor the quality of our data, to educate and support the Business on the data quality dimensionsAbout the teamThe Data Quality Analyst role sits in the Data Quality team within the Data Authority team. Data Authority is part of the Architecture and Software Solutions Function and is part of the Software Engineering and Complex Services Department, which sits within the Technology Business Unit. The role reports to the Data Quality Manager. Dealing directly with the business to provide data quality solutions and data expertise support for business problems.Key Responsibilities in the role:Accountability, Ownership, Authority• Analyse and validate data for accuracy, consistency, and integrity.• Work collaboratively with the business to understand their data quality challenges and formulate solutions for proactive monitoring and treatment• Implement data quality standards and processes• Generate reports and presentations for business stakeholders• Use statistical tools and software to interpret and analyse data• Manage and deliver data quality projects/requests within agreed timelines• Document processes and solutions for both business and technical audiences• Promote data quality awareness across the business, highlighting benefits and risks• Develop expertise in data mining, problem solving, and data presentation for accurate insights• Complete data quality impact assessments on new projects and BAU activities• Educate and support the business in defining data quality rules and KPI targets• Promote the Data Governance framework across PXCRequirementsTechnical skillsProven experience as a Data Quality Analyst or similar roleProficiency in data management tools (e.g. Purview, Atlan)Strong proficiency in analysis tools (e.g., SQL, Excel, Python)Proficiency in various Database Management Systems (e.g. Snowflake, Azure, Netezza)Experience with data visualisation tools (e.g. Power BI)Strong analytical and problem-solving skillsKnowledge of data quality standards and best practicesSoft skillsStrong communication skills to convey complex technical information to non-technical stakeholdersAbility to work collaboratively with cross-functional teamsExcellent attention to detail and organisational skillsStrong time management skillsBenefitsStaff BenefitsInternational career Hybrid working policy Collective insurance2 days off a year to volunteerPrivate healthcare post-probation1 day off for your birthday per annumFit Kit appWellness programReward and recognition programModern office space in the city center with free parkingLatest technology and equipmentFree food and beveragesInternal platform for learning and developmentAnnual bonusWorking hours: 10 am – 06pm MK time (but with flexibility for 9am - 05pm)*By sending your CV and motivation letter, you agree that your personal data will be processed for the needs of recruitment and selection by Causeway Connect (КоннектвејДОО Скопје) and they will be stored in our database.Note: Candidates can withdraw their permission to process their personal documents at any time by sending a notification to the e-mail: jobs@causewayconnect.com",
            "score": 0.10833884895444568
        }
    ],
    "top_bert_jobs": [
        {
            "job_position": "AI Software Engineer (Remote)",
            "company_name": "Pragmatike",
            "job_description": "Job Description:Location: Fully remote, EU timezone (CET +/- 2hours)Start date: ASAPLanguages: English is mandatory; French is a plusWe are hiring at Pragmatike to expand our team and drive the growth of our internal projects.Our focus is on developing cutting-edge solutions in Cloud Computing, Blockchain, and Artificial Intelligence, while fostering a culture of collaboration and innovation. Joining us means being part of a passionate team where your ideas and skills directly contribute to shaping tomorrow's technologies.If you're excited about working on ambitious projects in a dynamic and flexible environment, we'd love to hear from you!Responsibilities:Development of an autonomous framework for the extraction and processing of legal and regulatory documentation: LangChain/LangGraph, AI Agents, OCR, API design based on existing official databases (EurLex, Legifrance, etc.Development of a framework for annotating legal documentation and vector storage with relation graph: LangChain/LangGraph, AI Agents, Postgres, NetworkX.Development of a legal reasoning framework: LangChain/LangGraph, explicit reasoning models.Exposing the legal engine via API (extraction, indexing, reasoning)Inference of models on clusters (Mistral, Llama, Moshi, TTS, etc.): PyTorch, CUDA, IaaS.Development of high-level application layers (use cases in legal tech): Python/Go, Next.js, Node (open to frameworks, but nothing exotic).DevOps Responsabilities: Infrastructure Management (cloud, on-prem): AWS, GCP, Fluidstack.Automation of deployment and environments: Terraform, Ansible, CI/CD.Container orchestration: Docker, Kubernetes.Monitoring and security: Prometheus, Grafana, IAM.Soft Skills:Strong analytical and problem-solving skills, with the ability to think critically and creatively in a fast-paced, dynamic environment.Excellent communication skills, both verbal and written, to explain complex technical concepts to non-technical stakeholders.Ability to work independently and collaboratively in cross-functional teams.Detail-oriented, proactive, and able to manage multiple tasks simultaneously.",
            "score": 0.930026650428772
        },
        {
            "job_position": "Python Full Stack Developer",
            "company_name": "YO IT CONSULTING",
            "job_description": "Python Full Stack Developer -JavaScript/TypescriptExperience: 3 - 20 YearsLocation: - Anywhere in the World - Permanent RemoteContract Duration:  6-12 monthsOpportunity- Full Time, 8 hoursWork Hours: 5 hours overlap with the PST time zoneTotal Years Of exp- 3+ years experience Mandatory Skills-Python: min 3 yrs,JavaScript: min 3 yrs or Typescript: min 3 yrs,Nest.js: min 1 yr, or React: min 2 yrsRequired Skills3+ years of professional experience in PythonStrong SQL expertise with hands-on experience in database design, optimization, and management.2+ years of experience with Nest JS or other backend frameworks.Familiarity with AWS/GCP is a plus.Ability to work independently as well as collaboratively within a team.Strong problem-solving skills with a focus on delivering high-quality code.Nice to Have : Familiarity with front-end technologies (React or Angular) is a plus.Familiarity with Python for scripting data analysis is a plus.Excellent spoken and written English communication skillsJob DescriptionWe are seeking a full-stack engineer with a strong focus on backend development to join our growing team. In this role, you will be responsible for designing, developing, and maintaining high-performance software applications. Your expertise in Python and JavaScript (JS) will be crucial in building scalable and reliable backend systems.Ideal Candidate Profile3+ years of overall experienceEager to learn and grow within the company, with a proactive approach to personal and professional development.Reliable and consistent in delivering high-quality work.Strong communication skills and a collaborative mindset.Skills: sql,full stack development,css,gcp,javascript/typescript,html,python,nest.js,javascript,aws,angular,nestjs,react,typescript,aws/gcp",
            "score": 0.9213321208953857
        },
        {
            "job_position": "Machine Learning Intern",
            "company_name": "ITQuarks",
            "job_description": "< BackMachine Learning InternApply NowSkopje, MacedoniaJob Type3 MonthsITQuarks is a research and development company that provides a unique combination of expertise in machine learning, optimization and data processing.What We Offer Paid with the duration of 3 months. Startup culture and ability to gain experience in real projects.What will your job look like?As a Machine Learning Intern, Your Responsibilities Will Include Pass a programing course. Learn basics of Mongo DB and Elastic Search. Learn the concepts of Machine learning models. Bring in fresh ideas into our machine learning products and platform. Designing experiments with Tensorflow (JS) and Keras to advance our machine learning algorithms and techniques. Data preparation and analysis.All You need is ... Have a proven track record of academic learning in fields related tomachine learning and signal processing. Knowledge of statistical and machine learning approaches and problemdomains acquired by courses, course projects, assignments, or researchwork. Good at Algorithms and out of the box thinking. Coding ability and familiarity with C/C++ , Python or JavaScript.Apply at mycareer@itquarks.comApply Now",
            "score": 0.9209192991256714
        }
    ]
}