{
    "cv": {
        "full_name": "64017585",
        "skills": "Solutions toÂ include:Â Infrastructure/ Network design andÂ impletation,Â server basedÂ technologies and remote support services. Technical Skills",
        "experience": "Experience",
        "education": "Education and Training BS : Print Production, Graphic Design Computer Science , 1993 St. John's University Print Production, Graphic Design Computer Science"
    },
    "top_cosine_jobs": [
        {
            "job_position": "Verilog Design Verification Engineer",
            "company_name": "YO IT CONSULTING",
            "job_description": "Hardware Design DeveloperExperience: 3 - 25 YearsLocation: - Permanent Remote anywhere in the WorldContract Length: 6 MonthsType: Full time contract(8 hrs/day) Overlap Hours: 4 hrs/day with PSTMandatory SkillsOverall - 5 years of exp.Min of 2 years of relevant experience in Hardware Design and/or Hardware VerificationExperience With One Or More On The List Below>ASIC>VLSI>FPGA>SOCExperience with one or more on the list below>SystemVerilog development>Verilog development>Testbench development and/or verification.Good communication skills in English.LLM experience is not mandatory, however, the candidate should be fine to work as a LLM Engineer for Verilog.Must-HaveBS or MS degree in Electrical, Engineering, or related field.3-5 years of proven experience in hardware design development.Expertise in HDLs such as Verilog, SystemVerilog, VHDL, and SystemC.Expertise in scripting, front-end and verification workflows, and integrations within the hardware design environment.Expertise in UVM environmentsExpertise in Formal VerificationExpertise in Lint process and refinementGood communication skills in EnglishJob DescriptionWe're searching for an exceptional hardware design Developer to play a pivotal role in using the hardware design platform to generate the training data to enhance enterprise LLMs' capabilities. This unique position offers the chance to directly contribute to the sophistication of enterprise LLMs, ensuring they operate with unparalleled efficiency and intelligence.Your MissionDevelop, configure, and customize the hardware design platform, utilizing it to generate vital training data for enterprise LLMs.Liaise with research teams to translate requirements into actionable data insights, directly impacting our LLMs' performance.Uphold the highest standards in coding, debugging, and documentation, ensuring the hardware design solutions are optimized for LLM training and benchmarking.Collaborate across teams to identify and prioritize needs, contributing to the LLMs' ability to understand and automate complex processes.We NeedBS or MS degree in Electrical, Engineering, or related field.3-5 years of proven experience in hardware design development.Expertise in HDLs such as Verilog, SystemVerilog, VHDL, and SystemC.Expertise in scripting, front-end and verification workflows, and integrations within the hardware design environment.Exceptional problem-solving, communication, and collaborative skills.Familiarity with ML and AI systemsSkills: ai systems,verilog-a,soc,communication skills,hdl expertise,formal verification,hdl,integrations within hardware design environment,vhdl,collaboration,lint process refinement,systemverilog development,verification,hdls,knowledge of ml and ai systems,integration,verification workflows,integrations in hardware design,communication,systemverilog,integrations,vlsi,fpga,lint process and refinement,hdls (verilog, systemverilog, vhdl, systemc),uvm environments,electronics hardware design,hardware design development,good communication skills,front-end,ai,hardware design,verilog development,systemc,hdls (vhdl, systemc),machine learning,lint process,front-end and verification workflows,scripting,coding,ml,front-end verification workflows,uvm,asic,front-end development,design,integration within hardware design environment,debugging,hardware verification,ml and ai systems,integrations within the hardware design environment,electrical engineering,verilog,problem-solving,familiarity with ml and ai systems,testbench development,documentation,collaborative skills,front-end workflows",
            "score": 0.08654493111399629
        },
        {
            "job_position": "Frontend developer (Remote)",
            "company_name": "Blackfluo.ai",
            "job_description": "Job Description:Location: Fully remote, EU timezone (CET +/- 2hours)Start date: ASAPLanguages: English is mandatory; French is a plusBlackfluo.ai is a fully remote company with teams located around the globe. We specialize in developing SaaS solutions for businesses and consulting firms. Our innovative AI assistant is designed to support daily operations by taking over repetitive and time-consuming tasks, allowing our clients to focus on what truly matters.Responsibilities:Development of high-level application layers for Legal Tech use cases, focusing on creating seamless and user-friendly experiences.UX/UI design, integration of AI tools into applications using CopilotSDK.Collaborating with backend developers to design and implement the frontend architecture for AI-powered legal solutions.Creating responsive, scalable, and accessible UI components for various legal tech products.Optimizing user interfaces for performance, usability, and responsiveness across a range of devices and browsers.Participating in the integration of AI tools into the user interface, ensuring smooth interaction between the frontend and AI backend services.Implementing modern JavaScript frameworks such as React.js, Next.js, or Vue.js to build dynamic, real-time user interfaces.Working closely with the design team to ensure UI/UX is aligned with user needs and business goals.Requirements: Proven experience as a Frontend Developer with a focus on UI/UX design and development for modern web applications.Proficiency in JavaScript (React.js, Next.js, or similar frameworks), HTML5, CSS3, and modern frontend development tools and workflows (e.g., Webpack, Babel).Experience with AI integration in frontend development, particularly using CopilotSDK or similar AI tools.Familiarity with design principles and the ability to translate wireframes and prototypes into fully functional and high-performance user interfaces.Soft Skills:Creative and problem-solving mindset, with a passion for crafting exceptional user experiences.Strong communication skills, able to collaborate with cross-functional teams (design, backend, AI engineers).Ability to work independently and in a remote team environment.Proactive, detail-oriented, and able to manage multiple tasks and deadlines effectively.Nice to Have: Experience with AI/ML-based applications and understanding how to design and optimize UIs that interact with AI tools.Familiarity with cloud platforms (AWS, GCP) and understanding their role in frontend application deployment.Basic understanding of backend technologies, which will aid in collaborating with backend developers (e.g., Node.js, GraphQL).",
            "score": 0.07418224888094654
        },
        {
            "job_position": "Machine Learning Lead",
            "company_name": "Loka",
            "job_description": "At Loka we use a modern tech stack to support meaningful projects across a huge range of industries. In the last year we’ve helped clients advance the world’s #1 AI reading tutor, eliminate $1B in food waste and develop novel drugs for fighting cancer, all while enjoying every other Friday off. Join us, feed your need to grow and ship projects you believe in with a team you’re proud to lead.We’re seeking a Machine Learning Team Lead to deploy, secure and maintain ML models in production environments, mainly AWS. The ideal candidate will not only apply their technical brilliance but also take a leadership role in contributing positively to Loka’s unique culture.The RoleLead a team of ML engineers in architecting, building and optimizing scalable, cost-efficient ML models and ensuring performance in production environments.Provide constructive team feedback through regular one-on-one meetings and drive technical and professional development.Manage end-to-end ML projects, including data exploration, model development, deployment and scaling while delivering solutions that meet business and client needs.Collaborate with stakeholders to align ML initiatives with strategic objectives, ensuring clear communication with both technical and non-technical audiences.Drive technical innovation within the team by staying current with the latest AI/ML trends, implementing cutting-edge techniques.Foster the team's professional growth by creating development plans and encouraging a positive, collaborative remote working environment.Own the development and automation of ML workflows, including data pipelines and model deployment, with a focus on scalability and efficiency.Ensure strong cross-functional collaboration with Data Engineering, DevOps, BackEnd and other teams to deliver cohesive solutions.Work closely with senior leadership to align ML initiatives with long-term company strategies.Hard Skills Requirements5+ years of experience in machine learning, with 3+ years leading a teamStrong knowledge of Python, ML libraries and frameworks such as PyTorch, HuggingFace and TensorFlowHands-on experience with GenAI solutions using LLMs (even if not at an expert level), including prompt engineering and an understanding of common patterns like RAG and NLQClient-facing experience, including the ability to gather requirements, set expectations and deliver technical presentations, sometimes to non-technical peopleBachelor’s degree in Computer Science, Engineering or related fieldAdditional RequirementsExcellent English language skills - Being a global team, we work entirely in English for meetings, customer calls and business communicationsCV written in EnglishNot Required but Nice to HaveExperience with AWSExperience in consultancy environments or startups, including working directly with clients, managing projects and adapting to different settingsFamiliarity with MLOps best practices and toolsPersonality ProfileCuriosity: Eager to stay ahead in the rapidly evolving ML field and apply new technologiesAutonomy & Positivity: Thrives in a remote, globally distributed teamLeadership: Capable of leading with empathy, motivating team members and fostering a collaborative cultureAdaptability: Comfortable operating with a startup mindset, able to pivot and scale quicklyClient-Focused: Understand client needs and balance them with technical realities to deliver impactful solutionsBenefitsEvery other Friday off (26 extra days off a year)Remote and flexibleExplore and Relocation programs (three months work abroad or full international relo)Paid sick days and local holidaysPremium mental health subscriptionsAccess to LokaLabs™, our internal research and development programLokaLabs incubatorFitness subscriptionMental wellness programsDefined career pathBusiness English classesYour achievements matter to us! Ensure your CV, LinkedIn and GitHub profiles are up to date and accurately reflect your experience.",
            "score": 0.07070728816891075
        }
    ],
    "top_bert_jobs": [
        {
            "job_position": "Machine Learning Intern",
            "company_name": "ITQuarks",
            "job_description": "< BackMachine Learning InternApply NowSkopje, MacedoniaJob Type3 MonthsITQuarks is a research and development company that provides a unique combination of expertise in machine learning, optimization and data processing.What We Offer Paid with the duration of 3 months. Startup culture and ability to gain experience in real projects.What will your job look like?As a Machine Learning Intern, Your Responsibilities Will Include Pass a programing course. Learn basics of Mongo DB and Elastic Search. Learn the concepts of Machine learning models. Bring in fresh ideas into our machine learning products and platform. Designing experiments with Tensorflow (JS) and Keras to advance our machine learning algorithms and techniques. Data preparation and analysis.All You need is ... Have a proven track record of academic learning in fields related tomachine learning and signal processing. Knowledge of statistical and machine learning approaches and problemdomains acquired by courses, course projects, assignments, or researchwork. Good at Algorithms and out of the box thinking. Coding ability and familiarity with C/C++ , Python or JavaScript.Apply at mycareer@itquarks.comApply Now",
            "score": 0.8413488268852234
        },
        {
            "job_position": "AI Software Engineer (Remote)",
            "company_name": "Pragmatike",
            "job_description": "Job Description:Location: Fully remote, EU timezone (CET +/- 2hours)Start date: ASAPLanguages: English is mandatory; French is a plusWe are hiring at Pragmatike to expand our team and drive the growth of our internal projects.Our focus is on developing cutting-edge solutions in Cloud Computing, Blockchain, and Artificial Intelligence, while fostering a culture of collaboration and innovation. Joining us means being part of a passionate team where your ideas and skills directly contribute to shaping tomorrow's technologies.If you're excited about working on ambitious projects in a dynamic and flexible environment, we'd love to hear from you!Responsibilities:Development of an autonomous framework for the extraction and processing of legal and regulatory documentation: LangChain/LangGraph, AI Agents, OCR, API design based on existing official databases (EurLex, Legifrance, etc.Development of a framework for annotating legal documentation and vector storage with relation graph: LangChain/LangGraph, AI Agents, Postgres, NetworkX.Development of a legal reasoning framework: LangChain/LangGraph, explicit reasoning models.Exposing the legal engine via API (extraction, indexing, reasoning)Inference of models on clusters (Mistral, Llama, Moshi, TTS, etc.): PyTorch, CUDA, IaaS.Development of high-level application layers (use cases in legal tech): Python/Go, Next.js, Node (open to frameworks, but nothing exotic).DevOps Responsabilities: Infrastructure Management (cloud, on-prem): AWS, GCP, Fluidstack.Automation of deployment and environments: Terraform, Ansible, CI/CD.Container orchestration: Docker, Kubernetes.Monitoring and security: Prometheus, Grafana, IAM.Soft Skills:Strong analytical and problem-solving skills, with the ability to think critically and creatively in a fast-paced, dynamic environment.Excellent communication skills, both verbal and written, to explain complex technical concepts to non-technical stakeholders.Ability to work independently and collaboratively in cross-functional teams.Detail-oriented, proactive, and able to manage multiple tasks simultaneously.",
            "score": 0.8276054859161377
        },
        {
            "job_position": "Verilog Design Verification Engineer",
            "company_name": "YO IT CONSULTING",
            "job_description": "Hardware Design DeveloperExperience: 3 - 25 YearsLocation: - Permanent Remote anywhere in the WorldContract Length: 6 MonthsType: Full time contract(8 hrs/day) Overlap Hours: 4 hrs/day with PSTMandatory SkillsOverall - 5 years of exp.Min of 2 years of relevant experience in Hardware Design and/or Hardware VerificationExperience With One Or More On The List Below>ASIC>VLSI>FPGA>SOCExperience with one or more on the list below>SystemVerilog development>Verilog development>Testbench development and/or verification.Good communication skills in English.LLM experience is not mandatory, however, the candidate should be fine to work as a LLM Engineer for Verilog.Must-HaveBS or MS degree in Electrical, Engineering, or related field.3-5 years of proven experience in hardware design development.Expertise in HDLs such as Verilog, SystemVerilog, VHDL, and SystemC.Expertise in scripting, front-end and verification workflows, and integrations within the hardware design environment.Expertise in UVM environmentsExpertise in Formal VerificationExpertise in Lint process and refinementGood communication skills in EnglishJob DescriptionWe're searching for an exceptional hardware design Developer to play a pivotal role in using the hardware design platform to generate the training data to enhance enterprise LLMs' capabilities. This unique position offers the chance to directly contribute to the sophistication of enterprise LLMs, ensuring they operate with unparalleled efficiency and intelligence.Your MissionDevelop, configure, and customize the hardware design platform, utilizing it to generate vital training data for enterprise LLMs.Liaise with research teams to translate requirements into actionable data insights, directly impacting our LLMs' performance.Uphold the highest standards in coding, debugging, and documentation, ensuring the hardware design solutions are optimized for LLM training and benchmarking.Collaborate across teams to identify and prioritize needs, contributing to the LLMs' ability to understand and automate complex processes.We NeedBS or MS degree in Electrical, Engineering, or related field.3-5 years of proven experience in hardware design development.Expertise in HDLs such as Verilog, SystemVerilog, VHDL, and SystemC.Expertise in scripting, front-end and verification workflows, and integrations within the hardware design environment.Exceptional problem-solving, communication, and collaborative skills.Familiarity with ML and AI systemsSkills: ai systems,verilog-a,soc,communication skills,hdl expertise,formal verification,hdl,integrations within hardware design environment,vhdl,collaboration,lint process refinement,systemverilog development,verification,hdls,knowledge of ml and ai systems,integration,verification workflows,integrations in hardware design,communication,systemverilog,integrations,vlsi,fpga,lint process and refinement,hdls (verilog, systemverilog, vhdl, systemc),uvm environments,electronics hardware design,hardware design development,good communication skills,front-end,ai,hardware design,verilog development,systemc,hdls (vhdl, systemc),machine learning,lint process,front-end and verification workflows,scripting,coding,ml,front-end verification workflows,uvm,asic,front-end development,design,integration within hardware design environment,debugging,hardware verification,ml and ai systems,integrations within the hardware design environment,electrical engineering,verilog,problem-solving,familiarity with ml and ai systems,testbench development,documentation,collaborative skills,front-end workflows",
            "score": 0.8271561861038208
        }
    ]
}