{
    "cv": {
        "full_name": "10089434",
        "skills": "Versatile Systems Administrator possessing superior troubleshooting skills for networking issues, end user problems, and network security. and focused on taking a systematic approach to solving complex problems. Demonstrated exceptional technical knowledge and skills while Skills",
        "experience": "Experienced in server management, systems analysis, and offering in-depth understanding of IT infrastructure areas. Detail-oriented, independent, VMWare experience Disaster recovery Experience",
        "education": "Giving and participating in training and education programs to explain upgrades to end users. Education"
    },
    "top_cosine_jobs": [
        {
            "job_position": "Information Security Officer",
            "company_name": "Semos Cloud",
            "job_description": "Role SummaryWe are looking for a motivated Information Security Officer (ISO) to support our security efforts across the organization. In this role, you will contribute to securing our product, protecting company assets, and providing security assurance to our customers. This position is perfect for someone with a solid background in information security who is eager to take on practical responsibilities and grow in a SaaS environment.Key ResponsibilitiesAs an Information Security Officer, you will work in three main areas: Secure the Product and Infrastructure (Security Engineering), Protect the Company (Security Operations), and Assure the Customer (Security Assurance). Your specific tasks will include:Secure the Product and Infrastructure - Security EngineeringApplication and Infrastructure Security:Conduct security assessments and tests before and after deployment to spot vulnerabilities.Help find flaws in software configurations, detect malicious code, and manage patches or upgrades.Assist in putting a secure software development lifecycle (SDLC) into place and help train developers on current security best practices.Conduct security assessments for our PaaS and IaaS providers to ensure compliance with security standards.Enrich product security by implementing and improving the security measures by default and by design Security Research:Support research into vulnerabilities in company assets and SaaS applications we use.Assist in tracking fixes to ensure vulnerabilities are resolved on time.Protect The Company - Security OperationsSecurity Measures:Help put security measures in place and monitor them to protect the company and its assets.Security Improvements:Support efforts to improve security for the product and the company.Penetration Testing:Take part in realistic cyber attack simulations against company systems, property, and employees to find weaknesses.Incident Management:Help identify security anomalies and events, and support the Security Incident Response Team (SIRT) in handling incidents.Assure the Customer - Security AssuranceSecurity Compliance:Support the governance, risk, and compliance program tailored for SaaS as part of the second line of defense.Help keep a certification roadmap on track based on customer needs, including ISO 27001 and SOC 2.Assist in checking security controls, supporting fixes for audit findings, and participating in external certification audits.Risk and Field Security:Assist in supporting customer assurance activities as part of the company’s security team by providing materials, RFP updates, and customer assistance.Help to respond to customer inquiries and manage security questions accurately and on time, reporting any risks or trends you notice.Contribute to maintaining a Third Party Risk Management program to handle risks from external vendors.Develop and maintain security awareness training programs for employees to mitigate human-related security risks.To be successful in this role, you need Bachelor’s degree in Computer Science, Information Security, or a related field.3-5 years of experience in information security.Proficiency in English, both written and spoken.Good technical knowledge in areas like application security, vulnerability research, penetration testing, incident response, and security compliance.Familiarity with SaaS security and compliance frameworks such as ISO 27001 and SOC 2.Familiarity with security aspects of PaaS and IaaS providers (Azure, AWS)Hands-on experience with risk assessments, vulnerability management, security testing tools, and preparing and maintaining security documentation (white papers, policies, and guidelines).Strong communication and teamwork skills, with the ability to collaborate with technical teams, developers, and customers.Nice to HaveExperience in a B2B SaaS setting is a plus.Some understanding of data privacy regulations and compliance needs.Eagerness to learn and grow in a fast-moving security environment.Reasons to join our team Already proven, qualified, certified to play in the Champs League.  Truly global, enterprise customer base & brands to grow. In serving customers, together we grow for a better world. Read more about our customers here  You get to play with superb innovative cloud technology and agile working framework Learn more about our platform here  Our people at placed the center of the business. Dynamic SaaS, visionary leadership, and team spirit to win Learn more about us here  Our values derive from our people-centered culture. We are culture believers, driven by continuous growth, quick to move from planning to action, fearless in experimenting, and humbly working to change the world for the better. Read more about our culture here What We OfferCompetitive Salary Private Health Insurance Referral Bonus Program Hybrid Work Training and Coaching Opportunities Culture Fest (tickets for cultural events) Ergonomic workspace with kitchen offering healthy food options and beverages Sportmaster or FitKit Membership Psychological Health Support Program Off-site Team Building Events Office Skopje (hybrid)Team Legal & ComplianceReport toHead of LegalWorking Hours Monday – Friday 09:00 – 17:00 CET",
            "score": 0.11450121477562855
        },
        {
            "job_position": "Backend App Engineer/Developer",
            "company_name": "Move Your Business, Virtual Employment Agency",
            "job_description": "We are MOVE, a virtual employment agency, that aims to be #1 in the world by 2030.  We place the top 1% of talent globally with companies who want to achieve more at a fraction of the cost.  Our proprietary training and onboarding system guarantees results, or our client’s money back.   Check us out at www.moveyourbiz.com. One of our clients is looking for a highly skilled Backend App Engineer/Developer to maintain and enhance the backend infrastructure of a recently launched application. This role involves optimizing server-side functionality, managing databases, ensuring seamless API integrations, and improving application performance. The ideal candidate has a strong background in backend development, problem-solving abilities, and a passion for maintaining robust and scalable applications.Key ResponsibilitiesMaintain, optimize, and scale the backend infrastructure to ensure smooth application performance.Develop and manage server-side logic, database structures, and API integrations.Monitor application performance, troubleshoot issues, and implement fixes to enhance stability and security.Work closely with frontend developers to ensure seamless data flow and user experience.Implement data storage solutions and optimize database queries for efficiency.Ensure the application backend is secure, scalable, and aligned with industry best practices.Conduct regular system updates, security patches, and performance tuning.Maintain technical documentation and provide support for backend-related inquiries.Collaborate with cross-functional teams to improve app functionality and user experience.Perform ad hoc tasks related to backend development as required.Requirements & QualificationsExperience: Minimum of 3-5 years in backend development, preferably for mobile or web applications.Technical Skills: Proficiency in backend programming languages such as Node.js, Python, Java, Ruby, or PHP.Database Management: Strong experience with SQL and NoSQL databases (e.g., PostgreSQL, MySQL, MongoDB, Firebase).API Development: Expertise in RESTful and GraphQL APIs integration and management.Cloud & DevOps: Familiarity with AWS, Azure, or Google Cloud services and deployment pipelines.Security: Understanding of backend security best practices, authentication, and data protection.Version Control: Proficient in Git and GitHub/GitLab for code management and collaboration.Problem-Solving: Strong analytical and troubleshooting skills to resolve backend issues effectively.Collaboration: Ability to work independently and collaboratively with frontend developers, designers, and stakeholders.Amenable to work PART TIME Monday to Friday between 8 AM to 12 PM or 1 PM to 5 PM Pacific Standard Time (PST)Preferred QualificationsEducation: Bachelor’s degree in Computer Science, Software Engineering, or a related field.Experience with containerization (Docker, Kubernetes) for application deployment.Knowledge of serverless computing and microservices architecture.Prior experience maintaining and scaling applications post-launch.Familiarity with CI/CD pipelines for efficient development workflows.Pay: $700 + $50 Allowance per month$700 + $30 Allowance per month for candidates outside the PH Employment type: Part TimeWorking hours: Monday to Friday between 8 AM to 12 PM OR 1 PM to 5 PM Pacific Standard Time (PST)",
            "score": 0.08907664821968242
        },
        {
            "job_position": "Software Engineer",
            "company_name": "JWP (JW Player)",
            "job_description": "About JWP Connatix:JWP Connatix is the most comprehensive independent video technology and monetization platform, helping broadcasters, publishers, and advertisers deliver premium streaming and online video experiences while maximizing video revenue across all screens. The company offers an end-to-end platform that streamlines live and on-demand video with hybrid monetization models, unique data and insights, unmatched customer service, and the largest independent premium video marketplace, providing the entire media ecosystem with enhanced scale, transparency, and revenue.Our video players are embedded directly on publisher sites including Accuweather, Axel Springer, Dotdash Meredith, McClatchy, Penske Media Co., and more.We work with leading brands and agencies including American Express, Citi, Dentsu, Mars, UM, and more helping them target ads against our publishers' video content.We power streaming for over 2,000 blue-chip media companies, including 80% of the top 25 Comscore US publishers. As the largest independent global video network across CTV and OLV, we reach over 1B unique users and deliver 30B+ combined video plays and ad impressions every month.Flexible Work Policy:At JWP Connatix, we support a flexible work policy, with most employees working remotely. However, to align with our operational needs, we can only consider candidates residing in the same country as the job posting. This means applicants located outside the job's designated country will not be considered, and relocation assistance is unavailable.The Engineering Team:Our Engineering team at JWP Connatix is composed of passionate problem-solvers dedicated to building cutting-edge technology solutions. With a focus on monetizing customer content across billions of devices, our engineers thrive on innovation and collaboration. As part of this team, you will work closely with product and engineering leaders to develop frameworks and standards that impact the entire organization, driving efficiency and excellence across all projects.The Opportunity:We are looking for a talented and passionate Software Engineer to join our influential team, driving innovation and setting the standard for back-end development across our organization. You will play a crucial role in architecting scalable solutions, enhancing productivity through reusable components, and ensuring a consistent user experience across our products. This role offers the opportunity to work with a modern tech stack, contribute to industry-leading solutions, and keep our systems at the forefront of technology.As a Software Engineer, you will:Architect, design, and build robust, scalable back-end solutions to deliver a seamless customer experience across our product suite.Lead the implementation and deployment of critical platform components, ensuring reliability, performance optimization, and adherence to best practices.Work closely with product engineering teams to guide the integration of platform services, providing technical expertise and strategic direction.Identify and resolve performance bottlenecks, system failures, and operational challenges, proactively enhancing platform performance.Foster a culture of continuous improvement by driving process automation and implementing advanced observability protocols.Collaborate with early-career engineers, promoting technical excellence and professional development within the team.Stay updated on industry trends and emerging technologies, advocating for their integration into our platform architecture when appropriate.Requirements for the role:3+ years of experience in back-end engineering, with a track record of designing and developing large-scale, distributed systems.Proficiency in one or more programming languages: Python, Java, or Go.Experience with cloud platforms such as AWS, Azure, or GCP.Solid understanding of microservices architecture, containerization tools (Docker, Kubernetes), and infrastructure automation (Terraform, CloudFormation).Hands-on experience with CI/CD pipelines, automated testing, and deployment methodologies.Excellent problem-solving, organizational, and analytical skills.Strong communication and collaboration abilities, thriving in cross-functional environments.Bonus Points:Bachelor's or Master's degree in Computer Science, Engineering, or a related field.Experience with NoSQL databases, particularly Cassandra.Familiarity with large-scale data processing and analytics systems.Perks of being at JWP Connatix, North MacedoniaOur goal is to take care of you and ensure you will be successful in your new role. Your success is our success!As a full time employee, you will qualify for:Private Medical Insurance25 Paid Time OffNew Employee Home Office Setup StipendMonthly Connectivity StipendProfessional Development Reimbursement Program & Career Development ProgressionBi-Annual Hack Weeks for those who are interested in using their coding knowledgeFireside chats with individuals at JWP ConnatixCheck out our website and social channels: JWP ConnatixWe are an equal opportunity employer and value diversity at our company. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, and/or disability status.",
            "score": 0.08587389303021059
        }
    ],
    "top_bert_jobs": [
        {
            "job_position": "Senior Test Automation Engineer",
            "company_name": "Netcetera",
            "job_description": "We are a team of experts who work together to design and develop software that matters. Netcetera strongly believes in and supports continuous professional development. We care about our well-being. At Netcetera, we share our expertise, foster exchange, and appreciate different approaches. Respect, reliability, commitment, and professionalism define us. Our teams work with agile development methodologies and use the latest technology. Netcetera specialists are part of an extensive network within the IT industry.As a Senior Test Automation Engineer you'll work in a very dynamic team of professionals assuring that our software products gets maximum support and reliability. We're looking for a bright, talented, experienced and responsible individual with great technical background, but in the same time a team player and someone who can stood up for the new demanding challenges on a daily basis. The ideal candidate must be self-organizing, proactive, self-starter and able to seek out information.Looking for a new challenge? Take the next big step in your career!The job ad is valid until 31.12.2024Your role: Designing, developing, and refining of automated testsPlanning, implementation, and execution of tests in the Mobile Payment/Authentication areaExtending the existing automated test framework covering aspects like functional tests, error provocation, performance tests and high-availability testsEnsuring high test coverage using automated continues integration testsTesting, qualification and ensuring quality of the delivered team artifacts for all customer projectsPresenting status and issues in clear concise manner to appropriate levels in managementWorking in conjunction with Product Management, Operations team and other stakeholdersBe able to function in a matrix environment with multiple stake holder often with competing priorities and requirements and with strict timelinesEvaluating new testing tools and provide POCsRequirementsYour profile:Bachelor's or Master's degree in Computer science, Information Science or related educational area from an education institution with strong reputation8+ years overall IT experience involving:Agile Methodologies, ScrumTest Management ToolsContinuous Integration through Jenkins, CI/CDManual Testing, API Testing experienceTest Automation experience:Good programming skills with one or more programming languages (e.g. Java, Perl, Shell and Bash Scripting)Good knowledge of Java, Spring Boot, Hibernate, Apache MavenPerformance Testing experience is nice to haveGood knowledge of HTTP(S), JMS and other modern protocolsGit, Stash and BitbucketExperience with DevOps tools and workflows such as Jira, Bamboo or equivalentsKnowledge of cryptography, authentication and authorization schemes and protocolsGood knowledge of databases and SQLKnowledge of any Linux OS (e.g. CentOS) i.e. should be familiar with Linux OS server deployment, starting/stopping processes, checking logs, sound knowledge of Linux/Unix CommandLineHands on experience of using Tools like - SOAPUI, Postman, SQL Developer etcKnowledge of different testing types like Unit, Integration, Regression, Functional etcExcellent written communication skills, as well as verbal; must be able to articulate technical aspects of solution/services to business executives and customersProven experience working in a distributed team setup and/or international teamAbility to:Translate business requirements into use case or test case and plan test activitiesDrive strategy through influence with leadership qualities which engineers recognize and respectInnovate and lead explorations into new technologies and strategiesEvaluate new technologies or tools, stay abreast with industry trendsNice to have knowledge in some of the listed technologies:DockerCucumberMicroservicesBenefits Flexibility: Adjust your time to work efficiently, be it working hours, part-time options, home office, or unpaid leave Extra vacation days: Need to take some extra time off? With us, you have the possibility to activate 5 additional paid days per year on top of your vacation plan Private health & Family Insurance: The company policy covers a private health insurance plan for you and your family Yearly Education Fund: We strongly believe in continuous development and would love to see you enrich your knowledge. Ever Netceterian has a dedicated yearly fund to invest in their professional and personal development through conferences, courses, lectures or long-term education Meals & Snacks: Enjoy a lunch allowance each working day, free fruit and drinks in the officeDiscover more benefits",
            "score": 0.895653247833252
        },
        {
            "job_position": "Backend App Engineer/Developer",
            "company_name": "Move Your Business, Virtual Employment Agency",
            "job_description": "We are MOVE, a virtual employment agency, that aims to be #1 in the world by 2030.  We place the top 1% of talent globally with companies who want to achieve more at a fraction of the cost.  Our proprietary training and onboarding system guarantees results, or our client’s money back.   Check us out at www.moveyourbiz.com. One of our clients is looking for a highly skilled Backend App Engineer/Developer to maintain and enhance the backend infrastructure of a recently launched application. This role involves optimizing server-side functionality, managing databases, ensuring seamless API integrations, and improving application performance. The ideal candidate has a strong background in backend development, problem-solving abilities, and a passion for maintaining robust and scalable applications.Key ResponsibilitiesMaintain, optimize, and scale the backend infrastructure to ensure smooth application performance.Develop and manage server-side logic, database structures, and API integrations.Monitor application performance, troubleshoot issues, and implement fixes to enhance stability and security.Work closely with frontend developers to ensure seamless data flow and user experience.Implement data storage solutions and optimize database queries for efficiency.Ensure the application backend is secure, scalable, and aligned with industry best practices.Conduct regular system updates, security patches, and performance tuning.Maintain technical documentation and provide support for backend-related inquiries.Collaborate with cross-functional teams to improve app functionality and user experience.Perform ad hoc tasks related to backend development as required.Requirements & QualificationsExperience: Minimum of 3-5 years in backend development, preferably for mobile or web applications.Technical Skills: Proficiency in backend programming languages such as Node.js, Python, Java, Ruby, or PHP.Database Management: Strong experience with SQL and NoSQL databases (e.g., PostgreSQL, MySQL, MongoDB, Firebase).API Development: Expertise in RESTful and GraphQL APIs integration and management.Cloud & DevOps: Familiarity with AWS, Azure, or Google Cloud services and deployment pipelines.Security: Understanding of backend security best practices, authentication, and data protection.Version Control: Proficient in Git and GitHub/GitLab for code management and collaboration.Problem-Solving: Strong analytical and troubleshooting skills to resolve backend issues effectively.Collaboration: Ability to work independently and collaboratively with frontend developers, designers, and stakeholders.Amenable to work PART TIME Monday to Friday between 8 AM to 12 PM or 1 PM to 5 PM Pacific Standard Time (PST)Preferred QualificationsEducation: Bachelor’s degree in Computer Science, Software Engineering, or a related field.Experience with containerization (Docker, Kubernetes) for application deployment.Knowledge of serverless computing and microservices architecture.Prior experience maintaining and scaling applications post-launch.Familiarity with CI/CD pipelines for efficient development workflows.Pay: $700 + $50 Allowance per month$700 + $30 Allowance per month for candidates outside the PH Employment type: Part TimeWorking hours: Monday to Friday between 8 AM to 12 PM OR 1 PM to 5 PM Pacific Standard Time (PST)",
            "score": 0.8939989805221558
        },
        {
            "job_position": "Data Engineer – Palantir Foundry Platform",
            "company_name": "Bright Box",
            "job_description": "We are seeking a Data Engineer to join our dynamic team. You will play a crucial role in designing, building, and maintaining data pipelines, ETL workflows, and data models within the Palantir Foundry ecosystem.Requirements:Proven experience as a Data Engineer, preferably using Apache Spark.Strong proficiency in data modeling, ETL development, and data integration.Proficiency in one or more programming languages commonly used in data engineering, such as Python, Java, or Scala.Solid understanding of data warehousing concepts, database design, and data management principles.Familiarity with cloud-based data storage solutions and distributed computing frameworks (e.g., AWS, Azure, Hadoop) is a plus.Excellent problem-solving skills and ability to handle and prioritize multiple tasks in a fast-paced environment.Strong communication skills and the ability to work collaboratively in a team setting.Preferred Qualifications:Experience working on data projects in industries like finance, aviation, healthcare, government, or cybersecurity.Familiarity with data privacy and security best practices in the context of data engineering.Previous experience in building and deploying machine learning models using Palantir Foundry is a bonus.Responsibilities:Collaborate with cross-functional teams to understand data requirements and implement data solutions in the Palantir Foundry platform.Design and develop data pipelines and ETL workflows to ingest, process, and transform structured and unstructured data from various sources.Build and maintain data models, ensuring data integrity and optimal performance within the Palantir Foundry environment.Troubleshoot and resolve data-related issues, ensuring the reliability and accuracy of data in the platform.Monitor and optimize data pipelines for performance and scalability.Work closely with data analysts, scientists, and other stakeholders to ensure data availability and usability for analytics and reporting purposes.Stay updated with the latest features and enhancements in the Palantir Foundry platform and identify opportunities for innovation and improvement.Your work will directly contribute to enabling our clients to make data-driven decisions efficiently and effectively.We Offer:An organization that is open to your ideasCreative and supportive team of professionalsWork in a flat team structure with open honest feedbackPersonal growth - we encourage continuous learning and experimentationPrivate medical InsuranceCompetitive salaryHybrid working modelTeam building activitiesAwesome office space in Skopje and BitolaThe ideal candidate should be open-minded and with a polite attitude, and have a sense of ownership of tasks.You can send us your CV at jobs@thebrightbox.com",
            "score": 0.893792986869812
        }
    ]
}