{
    "cv": {
        "full_name": "21780877",
        "skills": "Skills",
        "experience": "Experience",
        "education": "Education and TrainingJUN 1996 BS Degree : Electrical Engineering University of TN ï¼​ City , State Electrical Engineering"
    },
    "top_cosine_jobs": [
        {
            "job_position": "Verilog Design Verification Engineer",
            "company_name": "YO IT CONSULTING",
            "job_description": "Hardware Design DeveloperExperience: 3 - 25 YearsLocation: - Permanent Remote anywhere in the WorldContract Length: 6 MonthsType: Full time contract(8 hrs/day) Overlap Hours: 4 hrs/day with PSTMandatory SkillsOverall - 5 years of exp.Min of 2 years of relevant experience in Hardware Design and/or Hardware VerificationExperience With One Or More On The List Below>ASIC>VLSI>FPGA>SOCExperience with one or more on the list below>SystemVerilog development>Verilog development>Testbench development and/or verification.Good communication skills in English.LLM experience is not mandatory, however, the candidate should be fine to work as a LLM Engineer for Verilog.Must-HaveBS or MS degree in Electrical, Engineering, or related field.3-5 years of proven experience in hardware design development.Expertise in HDLs such as Verilog, SystemVerilog, VHDL, and SystemC.Expertise in scripting, front-end and verification workflows, and integrations within the hardware design environment.Expertise in UVM environmentsExpertise in Formal VerificationExpertise in Lint process and refinementGood communication skills in EnglishJob DescriptionWe're searching for an exceptional hardware design Developer to play a pivotal role in using the hardware design platform to generate the training data to enhance enterprise LLMs' capabilities. This unique position offers the chance to directly contribute to the sophistication of enterprise LLMs, ensuring they operate with unparalleled efficiency and intelligence.Your MissionDevelop, configure, and customize the hardware design platform, utilizing it to generate vital training data for enterprise LLMs.Liaise with research teams to translate requirements into actionable data insights, directly impacting our LLMs' performance.Uphold the highest standards in coding, debugging, and documentation, ensuring the hardware design solutions are optimized for LLM training and benchmarking.Collaborate across teams to identify and prioritize needs, contributing to the LLMs' ability to understand and automate complex processes.We NeedBS or MS degree in Electrical, Engineering, or related field.3-5 years of proven experience in hardware design development.Expertise in HDLs such as Verilog, SystemVerilog, VHDL, and SystemC.Expertise in scripting, front-end and verification workflows, and integrations within the hardware design environment.Exceptional problem-solving, communication, and collaborative skills.Familiarity with ML and AI systemsSkills: ai systems,verilog-a,soc,communication skills,hdl expertise,formal verification,hdl,integrations within hardware design environment,vhdl,collaboration,lint process refinement,systemverilog development,verification,hdls,knowledge of ml and ai systems,integration,verification workflows,integrations in hardware design,communication,systemverilog,integrations,vlsi,fpga,lint process and refinement,hdls (verilog, systemverilog, vhdl, systemc),uvm environments,electronics hardware design,hardware design development,good communication skills,front-end,ai,hardware design,verilog development,systemc,hdls (vhdl, systemc),machine learning,lint process,front-end and verification workflows,scripting,coding,ml,front-end verification workflows,uvm,asic,front-end development,design,integration within hardware design environment,debugging,hardware verification,ml and ai systems,integrations within the hardware design environment,electrical engineering,verilog,problem-solving,familiarity with ml and ai systems,testbench development,documentation,collaborative skills,front-end workflows",
            "score": 0.06768332248528261
        },
        {
            "job_position": "Frontend (Angular2+) Developer",
            "company_name": "Sourcico",
            "job_description": "DescriptionAbout the Project:Security industry leaders and professionals with more than 20 years of deep technological experience in various fields of the market require the highest cybersecurity hygiene standards for cloud services and embedded software development. Working on development and management of systems considered as the bleeding edge of the technology helping our customers to mitigate security gaps in their products and shift out of IoT threats in seconds.Requirements:5+ years of Frontend Software Development5+ years' experience developing REST API clients, utilizing OAuth and JWT5+ years' experience in ES6+5+ years of experience working with Angular widget-driven developmentD3.js is a mustProficiency in NGRXGood understanding of secure client-server communicationUnderstanding of GIT and CI/CD practices, JIRAExperience implementing solutions working low level with network protocols is good to haveExperience in developing cybersecurity solution backend or frontend is a big advantageFamiliarity with K8S, Terraform, and the containerized environment is a big advantageExperience working with cloud environments AWSB.Sc. in Computer Science / Electrical Engineering or equivalent experienceCan-do attitudeIndustry:Cyber security and IoTAt Sourcico We Offer:A competitive salaryA comprehensive benefits package, including health, retirement plan, paid time off, etc.A flexible and hybrid work environmentA supportive and collaborative work cultureA chance to work on exciting and challenging projects with diverse clientsAn opportunity to grow and advance your career with continuous learning and developmentIf you are interested in joining our team, please apply now by sending your resume and cover letter. More details and application link are available here: https://sourcico.com/careers/?positionID=STP-1332We look forward to hearing from you soon!",
            "score": 0.055327350685688885
        },
        {
            "job_position": "Data Scientist - LLM",
            "company_name": "YO IT Group",
            "job_description": "Python Data Scientist/AnalystExperience: 4 - 20 YearsLocation: - Anywhere in the World - Permanent RemoteContract Duration:  6-12 monthsWork Hours: 5 hours overlap with PST time zoneStandard work hours are 8 AM PST - 4 PM PST.Must-HaveBachelor’s/Master’s degree in Engineering, Computer Science (or equivalent experience) At least 4 years of relevant experience as a data scientist 3+ years of data analysis experience and a desire to have a significant impact on the field of artificial intelligence 4+ years of experience working with Python programming.Fluent in conversational and written English communication skills.Job DescriptionWe are actively seeking talented Data Scientists & Analysts proficient in Python to join our ambitious team dedicated to pushing the frontiers of AI technology. This opportunity is tailored for professionals who thrive on developing innovative solutions and aspire to be at the forefront of AI advancements. You will work with companies in the US looking to develop cutting-edge commercial and research AI solutions.Job ResponsibilitiesWrite effective Python code to tackle complex issues, but also use your business sense and analytical abilities to glean valuable insights from public databases Communicate clearly with researchers and help the organization in realizing its objectives Clearly express the reasoning and logic when writing code in Jupyter notebooks, or other suitable mediums Fix bugs in the code and create thorough documentation Utilize extensive data analysis skills to develop and respond to important business queries using available datasets (such as those from Kaggle, the UN, the US government, etc.) Effectively communicate with the researchers to comprehend the needs and provide the resultsJob RequirementsBachelor’s/Master’s degree in Engineering, Computer Science (or equivalent experience) At least 4 years of relevant experience as a data scientist 3+ years of data analysis experience and a desire to have a significant impact on the field of artificial intelligence 4+ years of experience working with Python programming Strong data analytic abilities and business sense are required to draw the appropriate conclusions from the dataset, respond to those conclusions, and clearly convey the key findings Excellent problem-solving and analytical skills Excellent communication abilities to work with stakeholders and researchers successfully Fluent in conversational and written English communication skills Skills: computer science,problem-solving skills,bug fixing,spoken communication,conversational english communication skills,written english communication skills,data scientist,communication skills,problem-solving,us government datasets,python code,english communication,written english communication,stakeholder management,business sense,python code writing,data analysis,extensive data analysis,conversational english,analytical abilities,excellent communication abilities,engineering,data analysis skills,data,documentation,business queries,data analyst,communication abilities,artificial intelligence,data analytic abilities,coding,data science,un datasets,python,english communication skills,communication,written and conversational english communication,conversational english communication,kaggle datasets,bachelor’s/master’s degree in engineering,jupyter notebooks,stakeholder communication,analytical skills,data analytics,problem solving,ai technology,python programming,programming,data analytic,written communication",
            "score": 0.05326718175303592
        }
    ],
    "top_bert_jobs": [
        {
            "job_position": "Machine Learning Intern",
            "company_name": "ITQuarks",
            "job_description": "< BackMachine Learning InternApply NowSkopje, MacedoniaJob Type3 MonthsITQuarks is a research and development company that provides a unique combination of expertise in machine learning, optimization and data processing.What We Offer Paid with the duration of 3 months. Startup culture and ability to gain experience in real projects.What will your job look like?As a Machine Learning Intern, Your Responsibilities Will Include Pass a programing course. Learn basics of Mongo DB and Elastic Search. Learn the concepts of Machine learning models. Bring in fresh ideas into our machine learning products and platform. Designing experiments with Tensorflow (JS) and Keras to advance our machine learning algorithms and techniques. Data preparation and analysis.All You need is ... Have a proven track record of academic learning in fields related tomachine learning and signal processing. Knowledge of statistical and machine learning approaches and problemdomains acquired by courses, course projects, assignments, or researchwork. Good at Algorithms and out of the box thinking. Coding ability and familiarity with C/C++ , Python or JavaScript.Apply at mycareer@itquarks.comApply Now",
            "score": 0.6959750652313232
        },
        {
            "job_position": "Frontend (Angular2+) Developer",
            "company_name": "Sourcico",
            "job_description": "DescriptionAbout the Project:Security industry leaders and professionals with more than 20 years of deep technological experience in various fields of the market require the highest cybersecurity hygiene standards for cloud services and embedded software development. Working on development and management of systems considered as the bleeding edge of the technology helping our customers to mitigate security gaps in their products and shift out of IoT threats in seconds.Requirements:5+ years of Frontend Software Development5+ years' experience developing REST API clients, utilizing OAuth and JWT5+ years' experience in ES6+5+ years of experience working with Angular widget-driven developmentD3.js is a mustProficiency in NGRXGood understanding of secure client-server communicationUnderstanding of GIT and CI/CD practices, JIRAExperience implementing solutions working low level with network protocols is good to haveExperience in developing cybersecurity solution backend or frontend is a big advantageFamiliarity with K8S, Terraform, and the containerized environment is a big advantageExperience working with cloud environments AWSB.Sc. in Computer Science / Electrical Engineering or equivalent experienceCan-do attitudeIndustry:Cyber security and IoTAt Sourcico We Offer:A competitive salaryA comprehensive benefits package, including health, retirement plan, paid time off, etc.A flexible and hybrid work environmentA supportive and collaborative work cultureA chance to work on exciting and challenging projects with diverse clientsAn opportunity to grow and advance your career with continuous learning and developmentIf you are interested in joining our team, please apply now by sending your resume and cover letter. More details and application link are available here: https://sourcico.com/careers/?positionID=STP-1332We look forward to hearing from you soon!",
            "score": 0.6891038417816162
        },
        {
            "job_position": "DevOps Engineer",
            "company_name": "G+D Netcetera",
            "job_description": "G+D Netcetera specialists are part of an extensive network within the IT industry. Our teams work with agile development methodologies and use the latest technology.G+D Netcetera strongly believes in and supports continuous professional development. Mutual respect, reliability, personal commitment and a high degree of professionalism define our G+D Netcetera community. In international teams, we passionately develop customized solutions and products for the challenges of the future.We are looking for an experienced DevOps Engineer with software and system engineering skills and interests in highly critical risk-systems! The ideal candidate will be responsible for the reliability of our environments and software while working in a dynamic environment, driven by customers' requirements.We are a team of experts who work together in a DevOps team to design and develop software and operate it in our own datacenters or in well known cloud environments. Our team also supports our developers in architecture, deployment and operation of software to ensure our standards for a smooth operation and support.We are operating a critical, highly available, service-oriented architecture with 50+ applications over multiple datacenters and cloud providers.One area of our expertise is risk-analysis for credit-card transactions, and we are looking to extend our team in this part to ensure effective deployment and testing and making sure to have a reliable operation in the cloud.Join us and be part of a client-oriented culture and a fast-growing community with ambitious plans.The job ad is valid until 31.03.2025Your tasksContinuous Improvement of the architecture, build, deployment-and monitoring processes. local and cloud environmentWorking on numerous environments, applications (mainly Java), Tools (deployment, monitoring, ..), Containers running on many hosts on multiple environmentsProviding knowledge transfer to the 1st level support team for operational topics and providing 2nd and 3rd level supportRequirementsYour profileBachelor's or Master's degree in computer science or software engineering or relevant field and a lot of curiosity in DevOps topicsSystem engineering skills required (Linux, networking, security, deployment automation)Experience in Cloud Based container technologies is required; AWS is a plusExperience in integration & installation of 3rd party software in complex environments is very welcomeSoftware development and deployment (Java, Spring, Linux) experienceExperience in System & Software Architecture (incl. Container)Interests in high security Systems and compliance topicsFluent in English (written and spoken), knowledge of German is a plusBenefits Flexibility: Adjust your time to work efficiently, be it working hours, part-time options, home office, or unpaid leave Extra vacation days: Need to take some extra time off? With us, you have the possibility to activate 5 additional paid days per year on top of your vacation plan Private health & Family Insurance: The company policy covers a private health insurance plan for you and your family Yearly Education Fund: We strongly believe in continuous development and would love to see you enrich your knowledge. Every Netceterian has a dedicated yearly fund to invest in their professional and personal development through conferences, courses, lectures or long-term education Meals & Snacks: Enjoy a lunch allowance each working day, free fruit and drinks in the officeDiscover more benefits",
            "score": 0.6875045895576477
        }
    ]
}