{
    "cv": {
        "full_name": "27536013",
        "skills": "Skills",
        "experience": "EXPERIENCED INFORMATION TECHNOLOGY MANAGER Experience Experienced Information Technology Manager Highly accomplished professional with over 10 years of experience in a variety of management areas. Redesign of SharePoint end user experience to gain user acceptance and build stronger partnership with business units. Project brought our technology current and provided a more streamlined user experience.",
        "education": "EducationBA : Management 2012 Western Governor's University Management General Studies 2007 University of Phoenix General Studies business management focus"
    },
    "top_cosine_jobs": [
        {
            "job_position": "Technical Business Analyst",
            "company_name": "scandiweb",
            "job_description": "Department: Business DevelopmentLocation: North MacedoniaCompensation: €1,765 - €2,245 / monthDescriptionFor every person joining us for any position, there is a path and an opportunity to reach an executive role and become a company partnerAntons Sapriko, Company FounderHere is a video story of a colleague who joined the Key Account Manager team:Laura Balode, Gaining experience and becoming an eCommerce expert Key Account Manager. Latvia.﻿﻿*Please note that the salary is stated as a NET amount due to international hiring considerations. In the event of employment, the specified ranges will be adjusted to include applicable taxes.How to Become a Technical Business Analyst at scandiweb eCommerce Expert Team?We are a very inclusive company with colleagues from over 30 countries across all continents. Our ratio of females is among the highest in the industry. We welcome people from all walks of life who can complete a test by showing their skill and knowledge.While a solid understanding of web technologies and development processes, experience in managing projects, and ability to analyze complex business requirements are expected in this role, we value your ability to deliver results starting from the test task, and your enthusiasm and openness to embrace new knowledge and processes. Continuous learning and acting on feedback are among our core organizational values.What are the responsibilities of a Technical Business Analyst?As a Technical Business Analyst at scandiweb, you will play a pivotal role in bridging the gap between our client's business objectives and our technical solutions.Your primary responsibility will be to conduct comprehensive discovery sessions, both onsite and online, to analyze and plan potential web projects. This involves leading workshops with clients to delve into various aspects of their projects, meticulously scoping out requirements, and producing detailed documentation.The culmination of your efforts will be a thorough estimate of the project's development costs, which you will present to the client before transitioning the project to our delivery department.Our projects range from large-scale eCommerce solutions to mobile applications and custom-built systems, ensuring a diverse and challenging work environment.What do we expect from you?Detail Orientation: A keen eye for detail is essential to ensure all project aspects are accurately captured and documented;Technical Proficiency: A solid understanding of web technologies and development processes to effectively communicate with both clients and technical teams; Analytical and Logical Thinking: Ability to analyze complex business requirements and translate them into actionable project plans; Communication Skills: Excellent verbal and written communication skills to facilitate clear and effective client interactions and documentation; Confident written and spoken English skills. You will be working internationally;Project Management: Experience in managing projects from inception through planning, ensuring timelines and deliverables are met; Client Engagement: Proven ability to build and maintain strong client relationships, understanding their needs and delivering solutions that meet their objectives; Business Insight: A proactive ability to understand the client's business and identify potential opportunities where our solutions can bring additional value.Further career growth for Technical Business Analyst?You will get support in career counseling from our HR department as each career path is unique taking into account your personal strengths and ambitions.Further professional growth and development can lead you to become a senior, team lead for one and/or multiple teams, heading a particular practice, and ultimately working with top accounts like Puma, The New York Times, or Läderach.What is the compensation package of a Technical Business Analyst at scandiweb?Competitive starting salary relative to the market;Valuable eCommerce experience at the industry leader scandiweb;Substantial monetary bonuses based on successful lead conversion to client;Exciting travel opportunities;Support for hardware upgrades;Core health insurance coverage and sports bonuses;A diverse multinational team of experts to learn from;Company-covered training and certification;Legendary online and onsite events to celebrate our success together.Next stepsApply and fill in the application form;Receive the test task and complete it.Here is what people who joined the Key Account Management team want to share with you:\"My journey with scandiweb started unexpectedly and out of curiosity. I saw an ad for a Junior Project Manager position and since I was somehow in IT but with little experience, I decided to try it out. It was a huge surprise to receive an offer and make it all happen.My first projects were in different stages and on different levels of experience needed. However, I was not hesitant to jump on them! North Coast Pottery (US client), Stenders (LV client), and Hebes Code (Spanish client). Being able to work on projects within different stages of development allowed me to learn the full cycle fairly quickly and progress in a speedy mode!With the vast experience from the 3 projects, I continued my growth by joining Business Development (BD) - and that's when my career took a massive turn. After learning all the basics, I was made a Key Account Manager of 5 different accounts at scandiweb.The best things I have learned and gained thanks to scandiweb? Self-confidence and believing in my experience. They allowed me to grow at my own pace and gave me an enormous amount of trust. The freedom of being able to work within your own frames makes you feel like the processes are not there! All of the teams and managers I worked with, valued me for who I am, and leveraged my strengths to the best advantage.\"Dominika Plata, Key Account Manager from Poland. Joined the company on 4/3/2023.\"I was looking for a company working in a variety of technologies and frameworks related to eCommerce, and scandiweb was the best suitable for this. I remember my first project was Christmas Tree World in which we did a Magento 2 Fresh build with data migration from the old Magento 2 website.I had the opportunity to lead the project discovery calls with the client to finalize the requirements, analyze and document the proposed implementation, and provide a project work estimate. Getting a chance to be involved in all things discovery enhances your technical skills and develops interpersonal skills and client communication.I have learned that the best things on scandiweb are teamwork, handling responsibilities, and knowledge of eCommerce related technologies like iPaaS and PIM.\"Anup Wankhede, Key Account Manager from India. Joined the company 10/30/2023.",
            "score": 0.10679447071598892
        },
        {
            "job_position": "Frontend developer (Remote)",
            "company_name": "Blackfluo.ai",
            "job_description": "Job Description:Location: Fully remote, EU timezone (CET +/- 2hours)Start date: ASAPLanguages: English is mandatory; French is a plusBlackfluo.ai is a fully remote company with teams located around the globe. We specialize in developing SaaS solutions for businesses and consulting firms. Our innovative AI assistant is designed to support daily operations by taking over repetitive and time-consuming tasks, allowing our clients to focus on what truly matters.Responsibilities:Development of high-level application layers for Legal Tech use cases, focusing on creating seamless and user-friendly experiences.UX/UI design, integration of AI tools into applications using CopilotSDK.Collaborating with backend developers to design and implement the frontend architecture for AI-powered legal solutions.Creating responsive, scalable, and accessible UI components for various legal tech products.Optimizing user interfaces for performance, usability, and responsiveness across a range of devices and browsers.Participating in the integration of AI tools into the user interface, ensuring smooth interaction between the frontend and AI backend services.Implementing modern JavaScript frameworks such as React.js, Next.js, or Vue.js to build dynamic, real-time user interfaces.Working closely with the design team to ensure UI/UX is aligned with user needs and business goals.Requirements: Proven experience as a Frontend Developer with a focus on UI/UX design and development for modern web applications.Proficiency in JavaScript (React.js, Next.js, or similar frameworks), HTML5, CSS3, and modern frontend development tools and workflows (e.g., Webpack, Babel).Experience with AI integration in frontend development, particularly using CopilotSDK or similar AI tools.Familiarity with design principles and the ability to translate wireframes and prototypes into fully functional and high-performance user interfaces.Soft Skills:Creative and problem-solving mindset, with a passion for crafting exceptional user experiences.Strong communication skills, able to collaborate with cross-functional teams (design, backend, AI engineers).Ability to work independently and in a remote team environment.Proactive, detail-oriented, and able to manage multiple tasks and deadlines effectively.Nice to Have: Experience with AI/ML-based applications and understanding how to design and optimize UIs that interact with AI tools.Familiarity with cloud platforms (AWS, GCP) and understanding their role in frontend application deployment.Basic understanding of backend technologies, which will aid in collaborating with backend developers (e.g., Node.js, GraphQL).",
            "score": 0.10068900454518398
        },
        {
            "job_position": "Spring Internship Program - Machine Learning Engineer",
            "company_name": "G+D Netcetera",
            "job_description": "G+D Netcetera's 2025 Spring Internship Program is now open!Build your skillset, boost your knowledge, and expand your horizons during your 2025 Spring Internship at G+D Netcetera!Get hands-on experience working on real, tangible projects using the latest technologies, all while being guided by а dedicated mentor and supported by expert colleagues.We'll help you get started quickly through our onboarding program, support you with all the equipment, learning initiatives, and training, and keep your health, safety, and well-being as our top priorities, emphasized through our culture of caring, having fun, and exchanging knowledge.The fun doesn't stop there - you'll experience Netcetera to the fullest through our inclusive and diverse culture and work environment, embracing the variety of disciplines, backgrounds, and lifestyles of all our employees.Take the initiative - apply for your internship with Netcetera!Due to legal limitations, we are only able to offer internships to applicants who are below the age of 34.Your tasks:Learn all about a selected specialization:Gain knowledge and experince in a selected specialization through hands-on learningDevelop, implement, assess, and enhance data-driven models using various machine learning techniquesUtilize multi-modal large language models (LLMs) for different downstream tasks in specific domainsPerform ad-hoc analysis and present findings in a clear and concise mannerFamiliarize yourself with the assigned project ecosystem and its missionActively participate in team coordination meetings and eventsRequirementsYour profile:As a computer science student, you excel in a team-oriented environment, possess strong communication skills, and demonstrate familiarity with or interest in the following areas:Traditional machine learning approaches and deep learningDescriptive and predictive data analysis, data visualization and hypothesis testing and evaluationFamiliarity with the use of large language models (LLMs), retrieval augmented generation (RAG) and appropriate libraries (LangChain, LlamaIndex)Solid command of the Python programming language and associated libraries such as Scikit-Learn, Pandas, Pytorch, and NumPyAdvantageous to have general computer science and software development skillsThis internship round will last for three months with 50% capacity meaning half-time in April and May, and 100% meaning full-time in June. Within legal and company policies, Netceterians/you can choose whether to work remotely or from a G+D Netcetera office and enjoy flexible working hours. This hybrid working model demonstrates our commitment to achieving the best suitable private and professional life balance.This will be, of course, based on the interns' preferences, and agreed with their mentors.Expected start: 1st of AprilValid until 10.03.2025Benefits Flexibility: Adjust your time to work efficiently, be it working hours, part-time options, home office in our hybrid mode of work which will allow you to take care also of your studies and exams Education Fund: We'll get you couple of online courses for easy onboarding on the project that you'll work on Meals & Snacks: Enjoy a lunch allowance each working day, free fruit and drinks in the office",
            "score": 0.07176193071922522
        }
    ],
    "top_bert_jobs": [
        {
            "job_position": "Systems Engineer - North Macedonia",
            "company_name": "Fortinet",
            "job_description": "Job DescriptionSystems Engineer – North MacedoniaLocation: Remote / North MacedoniaWhy Fortinet?Fortinet is one of the fastest-growing cybersecurity companies in the world. We have proven to be a truly innovative technology driven IT security Company. Fortinet’s mission is to deliver the most innovative, highest-performing network security fabric to secure and simplify IT infrastructures. Today we secure the largest enterprises, service providers and government organizations across the globe.Systems Engineering teamExperienced and passionate professionals, who lead all technical aspects of a sales cycle with the customer, from the initial RFIs, through to RFPs & RFQs when required. This includes the project management and active participation in POCs in partnership with the relevant teams both internally and within the customer and/or commercial partner.Your GoalsMaximize the Fortinet opportunity coverage and brand awareness in the market. Continuously improve knowledge around the Fortinet products and solutions, along with maintaining a deep understanding of the competitive landscape and Fortinet’s ability to provide long lasting protection against the ever-evolving threats. Position Fortinet solutions to the customer, whether this be remotely or in person.Develop relationships with key enterprise partnersAbout YouHave a high aptitude for security technology in network, endpoint and application areas. The CISSP accreditation would also be beneficial.Expert in the current technologies and trends in IT securitystrong understanding of RADIUS, PKI, IKE, Certificates, L2TP, IPSEC, FIREWALL, 802.1Q, MD5, SSH, SSL, SHA1, DES, 3DESAre currently or have previously worked in a pre-sales engineer role, managing end-to-end technical aspects of deals, through to technical closure.Can demonstrate your problem solving skills and how this impacted key wins within your current organization.Understand and can demonstrate your ability to build and maintain customer and partner relationships, including your ability to effectively communicate technically to a range of both external and internal stakeholdersWhat we offer?Competitive basic salary, uncapped commission with progressive multiplicators, employee stock and stock awards, health and welfare benefits.Flexible working approach, this is a field-based role, you can operate from anywhere in North MacedoniaEmpowering and supportive working environment, where you can be yourselfInnovative, collaborative and dynamic company with a double-digit growth over the last decade.Training on the job with many other formal trainings and industry recognized certifications.Our CommitmentFortinet is an equal opportunity employer. We value the diversity in our company, and all qualified applicants will receive consideration for employment without regard to race, colour, religion, gender, sexual orientation, gender identity, nationality in addition to any other applicable legally protected characteristics in the location in which the candidate is applying.",
            "score": 0.8917883634567261
        },
        {
            "job_position": "Machine Learning Lead",
            "company_name": "Loka",
            "job_description": "At Loka we use a modern tech stack to support meaningful projects across a huge range of industries. In the last year we’ve helped clients advance the world’s #1 AI reading tutor, eliminate $1B in food waste and develop novel drugs for fighting cancer, all while enjoying every other Friday off. Join us, feed your need to grow and ship projects you believe in with a team you’re proud to lead.We’re seeking a Machine Learning Team Lead to deploy, secure and maintain ML models in production environments, mainly AWS. The ideal candidate will not only apply their technical brilliance but also take a leadership role in contributing positively to Loka’s unique culture.The RoleLead a team of ML engineers in architecting, building and optimizing scalable, cost-efficient ML models and ensuring performance in production environments.Provide constructive team feedback through regular one-on-one meetings and drive technical and professional development.Manage end-to-end ML projects, including data exploration, model development, deployment and scaling while delivering solutions that meet business and client needs.Collaborate with stakeholders to align ML initiatives with strategic objectives, ensuring clear communication with both technical and non-technical audiences.Drive technical innovation within the team by staying current with the latest AI/ML trends, implementing cutting-edge techniques.Foster the team's professional growth by creating development plans and encouraging a positive, collaborative remote working environment.Own the development and automation of ML workflows, including data pipelines and model deployment, with a focus on scalability and efficiency.Ensure strong cross-functional collaboration with Data Engineering, DevOps, BackEnd and other teams to deliver cohesive solutions.Work closely with senior leadership to align ML initiatives with long-term company strategies.Hard Skills Requirements5+ years of experience in machine learning, with 3+ years leading a teamStrong knowledge of Python, ML libraries and frameworks such as PyTorch, HuggingFace and TensorFlowHands-on experience with GenAI solutions using LLMs (even if not at an expert level), including prompt engineering and an understanding of common patterns like RAG and NLQClient-facing experience, including the ability to gather requirements, set expectations and deliver technical presentations, sometimes to non-technical peopleBachelor’s degree in Computer Science, Engineering or related fieldAdditional RequirementsExcellent English language skills - Being a global team, we work entirely in English for meetings, customer calls and business communicationsCV written in EnglishNot Required but Nice to HaveExperience with AWSExperience in consultancy environments or startups, including working directly with clients, managing projects and adapting to different settingsFamiliarity with MLOps best practices and toolsPersonality ProfileCuriosity: Eager to stay ahead in the rapidly evolving ML field and apply new technologiesAutonomy & Positivity: Thrives in a remote, globally distributed teamLeadership: Capable of leading with empathy, motivating team members and fostering a collaborative cultureAdaptability: Comfortable operating with a startup mindset, able to pivot and scale quicklyClient-Focused: Understand client needs and balance them with technical realities to deliver impactful solutionsBenefitsEvery other Friday off (26 extra days off a year)Remote and flexibleExplore and Relocation programs (three months work abroad or full international relo)Paid sick days and local holidaysPremium mental health subscriptionsAccess to LokaLabs™, our internal research and development programLokaLabs incubatorFitness subscriptionMental wellness programsDefined career pathBusiness English classesYour achievements matter to us! Ensure your CV, LinkedIn and GitHub profiles are up to date and accurately reflect your experience.",
            "score": 0.8852494955062866
        },
        {
            "job_position": "Senior Test Automation Engineer",
            "company_name": "Netcetera",
            "job_description": "We are a team of experts who work together to design and develop software that matters. Netcetera strongly believes in and supports continuous professional development. We care about our well-being. At Netcetera, we share our expertise, foster exchange, and appreciate different approaches. Respect, reliability, commitment, and professionalism define us. Our teams work with agile development methodologies and use the latest technology. Netcetera specialists are part of an extensive network within the IT industry.As a Senior Test Automation Engineer you'll work in a very dynamic team of professionals assuring that our software products gets maximum support and reliability. We're looking for a bright, talented, experienced and responsible individual with great technical background, but in the same time a team player and someone who can stood up for the new demanding challenges on a daily basis. The ideal candidate must be self-organizing, proactive, self-starter and able to seek out information.Looking for a new challenge? Take the next big step in your career!The job ad is valid until 31.12.2024Your role: Designing, developing, and refining of automated testsPlanning, implementation, and execution of tests in the Mobile Payment/Authentication areaExtending the existing automated test framework covering aspects like functional tests, error provocation, performance tests and high-availability testsEnsuring high test coverage using automated continues integration testsTesting, qualification and ensuring quality of the delivered team artifacts for all customer projectsPresenting status and issues in clear concise manner to appropriate levels in managementWorking in conjunction with Product Management, Operations team and other stakeholdersBe able to function in a matrix environment with multiple stake holder often with competing priorities and requirements and with strict timelinesEvaluating new testing tools and provide POCsRequirementsYour profile:Bachelor's or Master's degree in Computer science, Information Science or related educational area from an education institution with strong reputation8+ years overall IT experience involving:Agile Methodologies, ScrumTest Management ToolsContinuous Integration through Jenkins, CI/CDManual Testing, API Testing experienceTest Automation experience:Good programming skills with one or more programming languages (e.g. Java, Perl, Shell and Bash Scripting)Good knowledge of Java, Spring Boot, Hibernate, Apache MavenPerformance Testing experience is nice to haveGood knowledge of HTTP(S), JMS and other modern protocolsGit, Stash and BitbucketExperience with DevOps tools and workflows such as Jira, Bamboo or equivalentsKnowledge of cryptography, authentication and authorization schemes and protocolsGood knowledge of databases and SQLKnowledge of any Linux OS (e.g. CentOS) i.e. should be familiar with Linux OS server deployment, starting/stopping processes, checking logs, sound knowledge of Linux/Unix CommandLineHands on experience of using Tools like - SOAPUI, Postman, SQL Developer etcKnowledge of different testing types like Unit, Integration, Regression, Functional etcExcellent written communication skills, as well as verbal; must be able to articulate technical aspects of solution/services to business executives and customersProven experience working in a distributed team setup and/or international teamAbility to:Translate business requirements into use case or test case and plan test activitiesDrive strategy through influence with leadership qualities which engineers recognize and respectInnovate and lead explorations into new technologies and strategiesEvaluate new technologies or tools, stay abreast with industry trendsNice to have knowledge in some of the listed technologies:DockerCucumberMicroservicesBenefits Flexibility: Adjust your time to work efficiently, be it working hours, part-time options, home office, or unpaid leave Extra vacation days: Need to take some extra time off? With us, you have the possibility to activate 5 additional paid days per year on top of your vacation plan Private health & Family Insurance: The company policy covers a private health insurance plan for you and your family Yearly Education Fund: We strongly believe in continuous development and would love to see you enrich your knowledge. Ever Netceterian has a dedicated yearly fund to invest in their professional and personal development through conferences, courses, lectures or long-term education Meals & Snacks: Enjoy a lunch allowance each working day, free fruit and drinks in the officeDiscover more benefits",
            "score": 0.8838378190994263
        }
    ]
}