{
    "cv": {
        "full_name": "91121135",
        "skills": "Managing Confidential Records Strong interpersonal skills Skills",
        "experience": "Experience",
        "education": "Education"
    },
    "top_cosine_jobs": [
        {
            "job_position": "Software Developer",
            "company_name": "RLDatix",
            "job_description": "RLDatix is on a mission to transform care delivery worldwide, ensuring every patient receives the safest, highest-quality care. Through our innovative Healthcare Operations Platform, we're connecting data to unlock trusted insights that enable improved decision-making and help deliver safer healthcare for all.At RLDatix we’re making healthcare safer, together. Our shared passion for meaningful work drives us, while a supportive, respectful culture makes it all possible. As a team, we collaborate globally to reach our ultimate goal—helping people.We’re searching for a [location-based] Software Developer to join our Global R&D team, so that we can continue to innovate and deliver high-quality solutions within our Human Capital Management stack. The Software Developer will play a key role in designing, developing, and maintaining software solutions that drive efficiency and enhance healthcare operations.How You’ll Spend Your TimeReviewing, refining, estimating, and prioritizing functional changes in collaboration with the Scrum Squad to ensure high-quality deliverables. Producing clean and efficient code while adhering to relevant patterns and standards to maintain software excellence. Engaging in design and code review processes to ensure engineering excellence and timely delivery. Troubleshooting and debugging software issues to maintain system performance and reliability. Collaborating with stakeholders and internal teams to understand requirements and deliver scalable, secure, and high-quality solutions. What Kind of Things We’re Most Interested in You Having2+ years of experience as a PHP Software Developer within an Agile environment. Proven success in delivering high-quality software solutions within a multidisciplinary Agile Squad. In-depth knowledge and experience working with Microsoft and AWS technologies. Strong problem-solving skills with the ability to make well-considered, clear, and timely decisions. Excellent communication skills, both written and verbal, to effectively collaborate with internal teams and stakeholders. A knack for working collaboratively in a fast-paced, team-oriented environment. By enabling flexibility in how we work and prioritizing employee wellness, we empower our team to do and be their best. Key benefits include private health and group accident insurance, an Employee Assistance Program (EAP) for confidential support, and Loyalty Awards for long-service employees.RLDatix is an equal opportunity employer, and our employment decisions are made without regard to race, color, religion, age, gender, national origin, disability, handicap, marital status or any other status or condition protected by law.As part of RLDatix’s commitment to the inclusion of all qualified individuals, we ensure that persons with disabilities are provided reasonable accommodation in the job application and interview process. If reasonable accommodation is needed to participate in either step, please don’t hesitate to send a note to accessibility@rldatix.com.Salary offers are based on a wide range of factors including location, relevant skills, training, experience, education, and, where applicable, licensure or certifications obtained. Market and organizational factors are also taken into consideration.",
            "score": 0.07181987447838363
        },
        {
            "job_position": "Senior Test Automation Engineer",
            "company_name": "Netcetera",
            "job_description": "We are a team of experts who work together to design and develop software that matters. Netcetera strongly believes in and supports continuous professional development. We care about our well-being. At Netcetera, we share our expertise, foster exchange, and appreciate different approaches. Respect, reliability, commitment, and professionalism define us. Our teams work with agile development methodologies and use the latest technology. Netcetera specialists are part of an extensive network within the IT industry.As a Senior Test Automation Engineer you'll work in a very dynamic team of professionals assuring that our software products gets maximum support and reliability. We're looking for a bright, talented, experienced and responsible individual with great technical background, but in the same time a team player and someone who can stood up for the new demanding challenges on a daily basis. The ideal candidate must be self-organizing, proactive, self-starter and able to seek out information.Looking for a new challenge? Take the next big step in your career!The job ad is valid until 31.12.2024Your role: Designing, developing, and refining of automated testsPlanning, implementation, and execution of tests in the Mobile Payment/Authentication areaExtending the existing automated test framework covering aspects like functional tests, error provocation, performance tests and high-availability testsEnsuring high test coverage using automated continues integration testsTesting, qualification and ensuring quality of the delivered team artifacts for all customer projectsPresenting status and issues in clear concise manner to appropriate levels in managementWorking in conjunction with Product Management, Operations team and other stakeholdersBe able to function in a matrix environment with multiple stake holder often with competing priorities and requirements and with strict timelinesEvaluating new testing tools and provide POCsRequirementsYour profile:Bachelor's or Master's degree in Computer science, Information Science or related educational area from an education institution with strong reputation8+ years overall IT experience involving:Agile Methodologies, ScrumTest Management ToolsContinuous Integration through Jenkins, CI/CDManual Testing, API Testing experienceTest Automation experience:Good programming skills with one or more programming languages (e.g. Java, Perl, Shell and Bash Scripting)Good knowledge of Java, Spring Boot, Hibernate, Apache MavenPerformance Testing experience is nice to haveGood knowledge of HTTP(S), JMS and other modern protocolsGit, Stash and BitbucketExperience with DevOps tools and workflows such as Jira, Bamboo or equivalentsKnowledge of cryptography, authentication and authorization schemes and protocolsGood knowledge of databases and SQLKnowledge of any Linux OS (e.g. CentOS) i.e. should be familiar with Linux OS server deployment, starting/stopping processes, checking logs, sound knowledge of Linux/Unix CommandLineHands on experience of using Tools like - SOAPUI, Postman, SQL Developer etcKnowledge of different testing types like Unit, Integration, Regression, Functional etcExcellent written communication skills, as well as verbal; must be able to articulate technical aspects of solution/services to business executives and customersProven experience working in a distributed team setup and/or international teamAbility to:Translate business requirements into use case or test case and plan test activitiesDrive strategy through influence with leadership qualities which engineers recognize and respectInnovate and lead explorations into new technologies and strategiesEvaluate new technologies or tools, stay abreast with industry trendsNice to have knowledge in some of the listed technologies:DockerCucumberMicroservicesBenefits Flexibility: Adjust your time to work efficiently, be it working hours, part-time options, home office, or unpaid leave Extra vacation days: Need to take some extra time off? With us, you have the possibility to activate 5 additional paid days per year on top of your vacation plan Private health & Family Insurance: The company policy covers a private health insurance plan for you and your family Yearly Education Fund: We strongly believe in continuous development and would love to see you enrich your knowledge. Ever Netceterian has a dedicated yearly fund to invest in their professional and personal development through conferences, courses, lectures or long-term education Meals & Snacks: Enjoy a lunch allowance each working day, free fruit and drinks in the officeDiscover more benefits",
            "score": 0.06931438803719263
        },
        {
            "job_position": "Data Scientist - LLM",
            "company_name": "YO IT Group",
            "job_description": "Python Data Scientist/AnalystExperience: 4 - 20 YearsLocation: - Anywhere in the World - Permanent RemoteContract Duration:  6-12 monthsWork Hours: 5 hours overlap with PST time zoneStandard work hours are 8 AM PST - 4 PM PST.Must-HaveBachelor’s/Master’s degree in Engineering, Computer Science (or equivalent experience) At least 4 years of relevant experience as a data scientist 3+ years of data analysis experience and a desire to have a significant impact on the field of artificial intelligence 4+ years of experience working with Python programming.Fluent in conversational and written English communication skills.Job DescriptionWe are actively seeking talented Data Scientists & Analysts proficient in Python to join our ambitious team dedicated to pushing the frontiers of AI technology. This opportunity is tailored for professionals who thrive on developing innovative solutions and aspire to be at the forefront of AI advancements. You will work with companies in the US looking to develop cutting-edge commercial and research AI solutions.Job ResponsibilitiesWrite effective Python code to tackle complex issues, but also use your business sense and analytical abilities to glean valuable insights from public databases Communicate clearly with researchers and help the organization in realizing its objectives Clearly express the reasoning and logic when writing code in Jupyter notebooks, or other suitable mediums Fix bugs in the code and create thorough documentation Utilize extensive data analysis skills to develop and respond to important business queries using available datasets (such as those from Kaggle, the UN, the US government, etc.) Effectively communicate with the researchers to comprehend the needs and provide the resultsJob RequirementsBachelor’s/Master’s degree in Engineering, Computer Science (or equivalent experience) At least 4 years of relevant experience as a data scientist 3+ years of data analysis experience and a desire to have a significant impact on the field of artificial intelligence 4+ years of experience working with Python programming Strong data analytic abilities and business sense are required to draw the appropriate conclusions from the dataset, respond to those conclusions, and clearly convey the key findings Excellent problem-solving and analytical skills Excellent communication abilities to work with stakeholders and researchers successfully Fluent in conversational and written English communication skills Skills: computer science,problem-solving skills,bug fixing,spoken communication,conversational english communication skills,written english communication skills,data scientist,communication skills,problem-solving,us government datasets,python code,english communication,written english communication,stakeholder management,business sense,python code writing,data analysis,extensive data analysis,conversational english,analytical abilities,excellent communication abilities,engineering,data analysis skills,data,documentation,business queries,data analyst,communication abilities,artificial intelligence,data analytic abilities,coding,data science,un datasets,python,english communication skills,communication,written and conversational english communication,conversational english communication,kaggle datasets,bachelor’s/master’s degree in engineering,jupyter notebooks,stakeholder communication,analytical skills,data analytics,problem solving,ai technology,python programming,programming,data analytic,written communication",
            "score": 0.06903903873880363
        }
    ],
    "top_bert_jobs": [
        {
            "job_position": "IT Sales Development Specialist (BG)",
            "company_name": "SupportYourApp",
            "job_description": "Passionate about technology and possess excellent communication and negotiation skills? Now you have a chance to be a part of the world's leading SaaS, Software, or Hardware solutions as a Sales Development Specialist.In this role, you will be responsible for establishing the first contact with leads, generating qualified leads, nurturing strategies with potential clients and contributing to the overall sales pipeline.Excited? Let's see what it takes 💛What you will do:Generate new leads through multiple channels;Qualify inbound leads based on predefined criteria and do the first communication touchpoint;Create, develop and implement outbound strategies;Build relationships with key decision-makers at target companies to grow opportunities in the sales pipeline;Nurture existing leads: build and maintain relationships with prospects through consistent communication;Ensure smooth handoff and communication with the Growth Team on qualified leads;Keep records in the CRM system accurate and up-to-date;Collaborate with senior staff members in order to develop sales opportunities (communication with clients, agreement preparation, update deals in CRM, etc.);Coordinate with other team members and departments to optimize the sales effort (e.g. research tasks);Achieve and exceed individual targets and KPIs, such the number of qualified leads, conversion rates and appointments set;Attend regular team meetings, discussions, brainstormsWhat you need to succeed in this role:Fluent English (C1-C2 both in writing and speaking);Excellent communication and negotiation skills;1+ years of experience in sales development, leadgen or related roles in a B2B environment, ideally within the IT industry;Familiarity with CRM systems (HubSpot) and prospecting tools;Experience in building outbound and lead generation strategies to engage leads into the overall sales pipeline;Inbound lead qualification skills to respond to inbound inquiries and qualify them based on predefined criteria;Discipline and great time management skills;Stress resistance and ability to communicate assertively, handle feedback and work on improvement;Ability to perceive, use, understand, manage, and handle emotions in different situations;Ability to work independently and as part of a team in a fast-paced environment;Fast learning skills, adaptability to new environments and flexibility to quickly grasp new concepts;Out of the box thinking with desire to explore creative ideas with a proactive approachBenefits and Perks:Business hours;Opportunity to work fully remotely;Inclusive international environment;Compensation in USD;Good bonuses for referring friends;Paid intensive training and probation;Work-life balance;Responsive management interested in your growth and long-lasting cooperation;Greenhouse conditions for self-developmentWho we are:SupportYourApp is a Support-as-a-Service company that provides secure technical, customer support, and CX services for tech companies around the globe.We work with clients from over 30 countries and speak over 60 languages.Since 2010, we've become an industry leader in premium outsourced customer support and turned global with 8 hubs around the world.We treat our team like our clients, surrounding them with unlimited care, an individual approach, and a wholesome positive experience.We welcome people with various backgrounds and experiences. Grab the chance to join us and send your CV in English, pointing out your outstanding skills!Visit our website: http://www.supportyourapp.com/ We are a multinational company with unbiased views. The assessment of candidates is not affected by such characteristics as race, sex, color, religion, age, national origin, marital status, disability, veteran status, genetic information, sexual orientation, gender identity, or any other reason prohibited by law in provision of employment opportunities and benefits",
            "score": 0.715157151222229
        },
        {
            "job_position": "Technical Business Analyst",
            "company_name": "scandiweb",
            "job_description": "Department: Business DevelopmentLocation: North MacedoniaCompensation: €1,765 - €2,245 / monthDescriptionFor every person joining us for any position, there is a path and an opportunity to reach an executive role and become a company partnerAntons Sapriko, Company FounderHere is a video story of a colleague who joined the Key Account Manager team:Laura Balode, Gaining experience and becoming an eCommerce expert Key Account Manager. Latvia.﻿﻿*Please note that the salary is stated as a NET amount due to international hiring considerations. In the event of employment, the specified ranges will be adjusted to include applicable taxes.How to Become a Technical Business Analyst at scandiweb eCommerce Expert Team?We are a very inclusive company with colleagues from over 30 countries across all continents. Our ratio of females is among the highest in the industry. We welcome people from all walks of life who can complete a test by showing their skill and knowledge.While a solid understanding of web technologies and development processes, experience in managing projects, and ability to analyze complex business requirements are expected in this role, we value your ability to deliver results starting from the test task, and your enthusiasm and openness to embrace new knowledge and processes. Continuous learning and acting on feedback are among our core organizational values.What are the responsibilities of a Technical Business Analyst?As a Technical Business Analyst at scandiweb, you will play a pivotal role in bridging the gap between our client's business objectives and our technical solutions.Your primary responsibility will be to conduct comprehensive discovery sessions, both onsite and online, to analyze and plan potential web projects. This involves leading workshops with clients to delve into various aspects of their projects, meticulously scoping out requirements, and producing detailed documentation.The culmination of your efforts will be a thorough estimate of the project's development costs, which you will present to the client before transitioning the project to our delivery department.Our projects range from large-scale eCommerce solutions to mobile applications and custom-built systems, ensuring a diverse and challenging work environment.What do we expect from you?Detail Orientation: A keen eye for detail is essential to ensure all project aspects are accurately captured and documented;Technical Proficiency: A solid understanding of web technologies and development processes to effectively communicate with both clients and technical teams; Analytical and Logical Thinking: Ability to analyze complex business requirements and translate them into actionable project plans; Communication Skills: Excellent verbal and written communication skills to facilitate clear and effective client interactions and documentation; Confident written and spoken English skills. You will be working internationally;Project Management: Experience in managing projects from inception through planning, ensuring timelines and deliverables are met; Client Engagement: Proven ability to build and maintain strong client relationships, understanding their needs and delivering solutions that meet their objectives; Business Insight: A proactive ability to understand the client's business and identify potential opportunities where our solutions can bring additional value.Further career growth for Technical Business Analyst?You will get support in career counseling from our HR department as each career path is unique taking into account your personal strengths and ambitions.Further professional growth and development can lead you to become a senior, team lead for one and/or multiple teams, heading a particular practice, and ultimately working with top accounts like Puma, The New York Times, or Läderach.What is the compensation package of a Technical Business Analyst at scandiweb?Competitive starting salary relative to the market;Valuable eCommerce experience at the industry leader scandiweb;Substantial monetary bonuses based on successful lead conversion to client;Exciting travel opportunities;Support for hardware upgrades;Core health insurance coverage and sports bonuses;A diverse multinational team of experts to learn from;Company-covered training and certification;Legendary online and onsite events to celebrate our success together.Next stepsApply and fill in the application form;Receive the test task and complete it.Here is what people who joined the Key Account Management team want to share with you:\"My journey with scandiweb started unexpectedly and out of curiosity. I saw an ad for a Junior Project Manager position and since I was somehow in IT but with little experience, I decided to try it out. It was a huge surprise to receive an offer and make it all happen.My first projects were in different stages and on different levels of experience needed. However, I was not hesitant to jump on them! North Coast Pottery (US client), Stenders (LV client), and Hebes Code (Spanish client). Being able to work on projects within different stages of development allowed me to learn the full cycle fairly quickly and progress in a speedy mode!With the vast experience from the 3 projects, I continued my growth by joining Business Development (BD) - and that's when my career took a massive turn. After learning all the basics, I was made a Key Account Manager of 5 different accounts at scandiweb.The best things I have learned and gained thanks to scandiweb? Self-confidence and believing in my experience. They allowed me to grow at my own pace and gave me an enormous amount of trust. The freedom of being able to work within your own frames makes you feel like the processes are not there! All of the teams and managers I worked with, valued me for who I am, and leveraged my strengths to the best advantage.\"Dominika Plata, Key Account Manager from Poland. Joined the company on 4/3/2023.\"I was looking for a company working in a variety of technologies and frameworks related to eCommerce, and scandiweb was the best suitable for this. I remember my first project was Christmas Tree World in which we did a Magento 2 Fresh build with data migration from the old Magento 2 website.I had the opportunity to lead the project discovery calls with the client to finalize the requirements, analyze and document the proposed implementation, and provide a project work estimate. Getting a chance to be involved in all things discovery enhances your technical skills and develops interpersonal skills and client communication.I have learned that the best things on scandiweb are teamwork, handling responsibilities, and knowledge of eCommerce related technologies like iPaaS and PIM.\"Anup Wankhede, Key Account Manager from India. Joined the company 10/30/2023.",
            "score": 0.6841530799865723
        },
        {
            "job_position": "Systems Engineer - North Macedonia",
            "company_name": "Fortinet",
            "job_description": "Job DescriptionSystems Engineer – North MacedoniaLocation: Remote / North MacedoniaWhy Fortinet?Fortinet is one of the fastest-growing cybersecurity companies in the world. We have proven to be a truly innovative technology driven IT security Company. Fortinet’s mission is to deliver the most innovative, highest-performing network security fabric to secure and simplify IT infrastructures. Today we secure the largest enterprises, service providers and government organizations across the globe.Systems Engineering teamExperienced and passionate professionals, who lead all technical aspects of a sales cycle with the customer, from the initial RFIs, through to RFPs & RFQs when required. This includes the project management and active participation in POCs in partnership with the relevant teams both internally and within the customer and/or commercial partner.Your GoalsMaximize the Fortinet opportunity coverage and brand awareness in the market. Continuously improve knowledge around the Fortinet products and solutions, along with maintaining a deep understanding of the competitive landscape and Fortinet’s ability to provide long lasting protection against the ever-evolving threats. Position Fortinet solutions to the customer, whether this be remotely or in person.Develop relationships with key enterprise partnersAbout YouHave a high aptitude for security technology in network, endpoint and application areas. The CISSP accreditation would also be beneficial.Expert in the current technologies and trends in IT securitystrong understanding of RADIUS, PKI, IKE, Certificates, L2TP, IPSEC, FIREWALL, 802.1Q, MD5, SSH, SSL, SHA1, DES, 3DESAre currently or have previously worked in a pre-sales engineer role, managing end-to-end technical aspects of deals, through to technical closure.Can demonstrate your problem solving skills and how this impacted key wins within your current organization.Understand and can demonstrate your ability to build and maintain customer and partner relationships, including your ability to effectively communicate technically to a range of both external and internal stakeholdersWhat we offer?Competitive basic salary, uncapped commission with progressive multiplicators, employee stock and stock awards, health and welfare benefits.Flexible working approach, this is a field-based role, you can operate from anywhere in North MacedoniaEmpowering and supportive working environment, where you can be yourselfInnovative, collaborative and dynamic company with a double-digit growth over the last decade.Training on the job with many other formal trainings and industry recognized certifications.Our CommitmentFortinet is an equal opportunity employer. We value the diversity in our company, and all qualified applicants will receive consideration for employment without regard to race, colour, religion, gender, sexual orientation, gender identity, nationality in addition to any other applicable legally protected characteristics in the location in which the candidate is applying.",
            "score": 0.6823607683181763
        }
    ]
}