{
    "cv": {
        "full_name": "24889109",
        "skills": "Radio CPOF/VOIP Videoconferencing Technologies Network and Server Administration Government Security Disaster Recovery/Backups experience in high visibility support roles centered on Microsoft technologies and information security Strong understanding of workflow / business process, support roles in organizations Multiple awards for proven performance Management Squad Leader / Shift Leader Strong leadership skills / Excellent interpersonal skills Presentations / Training / Documentation Standard Operating Procedures development Skills",
        "experience": "experience in high visibility support roles centered on Microsoft technologies and information security Strong understanding of workflow / business process, support roles in organizations Multiple awards for proven performance Management Squad Leader / Shift Leader Strong leadership skills Experience",
        "education": "Education"
    },
    "top_cosine_jobs": [
        {
            "job_position": "Information Security Officer",
            "company_name": "Semos Cloud",
            "job_description": "Role SummaryWe are looking for a motivated Information Security Officer (ISO) to support our security efforts across the organization. In this role, you will contribute to securing our product, protecting company assets, and providing security assurance to our customers. This position is perfect for someone with a solid background in information security who is eager to take on practical responsibilities and grow in a SaaS environment.Key ResponsibilitiesAs an Information Security Officer, you will work in three main areas: Secure the Product and Infrastructure (Security Engineering), Protect the Company (Security Operations), and Assure the Customer (Security Assurance). Your specific tasks will include:Secure the Product and Infrastructure - Security EngineeringApplication and Infrastructure Security:Conduct security assessments and tests before and after deployment to spot vulnerabilities.Help find flaws in software configurations, detect malicious code, and manage patches or upgrades.Assist in putting a secure software development lifecycle (SDLC) into place and help train developers on current security best practices.Conduct security assessments for our PaaS and IaaS providers to ensure compliance with security standards.Enrich product security by implementing and improving the security measures by default and by design Security Research:Support research into vulnerabilities in company assets and SaaS applications we use.Assist in tracking fixes to ensure vulnerabilities are resolved on time.Protect The Company - Security OperationsSecurity Measures:Help put security measures in place and monitor them to protect the company and its assets.Security Improvements:Support efforts to improve security for the product and the company.Penetration Testing:Take part in realistic cyber attack simulations against company systems, property, and employees to find weaknesses.Incident Management:Help identify security anomalies and events, and support the Security Incident Response Team (SIRT) in handling incidents.Assure the Customer - Security AssuranceSecurity Compliance:Support the governance, risk, and compliance program tailored for SaaS as part of the second line of defense.Help keep a certification roadmap on track based on customer needs, including ISO 27001 and SOC 2.Assist in checking security controls, supporting fixes for audit findings, and participating in external certification audits.Risk and Field Security:Assist in supporting customer assurance activities as part of the company’s security team by providing materials, RFP updates, and customer assistance.Help to respond to customer inquiries and manage security questions accurately and on time, reporting any risks or trends you notice.Contribute to maintaining a Third Party Risk Management program to handle risks from external vendors.Develop and maintain security awareness training programs for employees to mitigate human-related security risks.To be successful in this role, you need Bachelor’s degree in Computer Science, Information Security, or a related field.3-5 years of experience in information security.Proficiency in English, both written and spoken.Good technical knowledge in areas like application security, vulnerability research, penetration testing, incident response, and security compliance.Familiarity with SaaS security and compliance frameworks such as ISO 27001 and SOC 2.Familiarity with security aspects of PaaS and IaaS providers (Azure, AWS)Hands-on experience with risk assessments, vulnerability management, security testing tools, and preparing and maintaining security documentation (white papers, policies, and guidelines).Strong communication and teamwork skills, with the ability to collaborate with technical teams, developers, and customers.Nice to HaveExperience in a B2B SaaS setting is a plus.Some understanding of data privacy regulations and compliance needs.Eagerness to learn and grow in a fast-moving security environment.Reasons to join our team Already proven, qualified, certified to play in the Champs League.  Truly global, enterprise customer base & brands to grow. In serving customers, together we grow for a better world. Read more about our customers here  You get to play with superb innovative cloud technology and agile working framework Learn more about our platform here  Our people at placed the center of the business. Dynamic SaaS, visionary leadership, and team spirit to win Learn more about us here  Our values derive from our people-centered culture. We are culture believers, driven by continuous growth, quick to move from planning to action, fearless in experimenting, and humbly working to change the world for the better. Read more about our culture here What We OfferCompetitive Salary Private Health Insurance Referral Bonus Program Hybrid Work Training and Coaching Opportunities Culture Fest (tickets for cultural events) Ergonomic workspace with kitchen offering healthy food options and beverages Sportmaster or FitKit Membership Psychological Health Support Program Off-site Team Building Events Office Skopje (hybrid)Team Legal & ComplianceReport toHead of LegalWorking Hours Monday – Friday 09:00 – 17:00 CET",
            "score": 0.1743196584996506
        },
        {
            "job_position": "Software Developer",
            "company_name": "RLDatix",
            "job_description": "RLDatix is on a mission to transform care delivery worldwide, ensuring every patient receives the safest, highest-quality care. Through our innovative Healthcare Operations Platform, we're connecting data to unlock trusted insights that enable improved decision-making and help deliver safer healthcare for all.At RLDatix we’re making healthcare safer, together. Our shared passion for meaningful work drives us, while a supportive, respectful culture makes it all possible. As a team, we collaborate globally to reach our ultimate goal—helping people.We’re searching for a [location-based] Software Developer to join our Global R&D team, so that we can continue to innovate and deliver high-quality solutions within our Human Capital Management stack. The Software Developer will play a key role in designing, developing, and maintaining software solutions that drive efficiency and enhance healthcare operations.How You’ll Spend Your TimeReviewing, refining, estimating, and prioritizing functional changes in collaboration with the Scrum Squad to ensure high-quality deliverables. Producing clean and efficient code while adhering to relevant patterns and standards to maintain software excellence. Engaging in design and code review processes to ensure engineering excellence and timely delivery. Troubleshooting and debugging software issues to maintain system performance and reliability. Collaborating with stakeholders and internal teams to understand requirements and deliver scalable, secure, and high-quality solutions. What Kind of Things We’re Most Interested in You Having2+ years of experience as a PHP Software Developer within an Agile environment. Proven success in delivering high-quality software solutions within a multidisciplinary Agile Squad. In-depth knowledge and experience working with Microsoft and AWS technologies. Strong problem-solving skills with the ability to make well-considered, clear, and timely decisions. Excellent communication skills, both written and verbal, to effectively collaborate with internal teams and stakeholders. A knack for working collaboratively in a fast-paced, team-oriented environment. By enabling flexibility in how we work and prioritizing employee wellness, we empower our team to do and be their best. Key benefits include private health and group accident insurance, an Employee Assistance Program (EAP) for confidential support, and Loyalty Awards for long-service employees.RLDatix is an equal opportunity employer, and our employment decisions are made without regard to race, color, religion, age, gender, national origin, disability, handicap, marital status or any other status or condition protected by law.As part of RLDatix’s commitment to the inclusion of all qualified individuals, we ensure that persons with disabilities are provided reasonable accommodation in the job application and interview process. If reasonable accommodation is needed to participate in either step, please don’t hesitate to send a note to accessibility@rldatix.com.Salary offers are based on a wide range of factors including location, relevant skills, training, experience, education, and, where applicable, licensure or certifications obtained. Market and organizational factors are also taken into consideration.",
            "score": 0.10318414563079387
        },
        {
            "job_position": "Backend App Engineer/Developer",
            "company_name": "Move Your Business, Virtual Employment Agency",
            "job_description": "We are MOVE, a virtual employment agency, that aims to be #1 in the world by 2030.  We place the top 1% of talent globally with companies who want to achieve more at a fraction of the cost.  Our proprietary training and onboarding system guarantees results, or our client’s money back.   Check us out at www.moveyourbiz.com. One of our clients is looking for a highly skilled Backend App Engineer/Developer to maintain and enhance the backend infrastructure of a recently launched application. This role involves optimizing server-side functionality, managing databases, ensuring seamless API integrations, and improving application performance. The ideal candidate has a strong background in backend development, problem-solving abilities, and a passion for maintaining robust and scalable applications.Key ResponsibilitiesMaintain, optimize, and scale the backend infrastructure to ensure smooth application performance.Develop and manage server-side logic, database structures, and API integrations.Monitor application performance, troubleshoot issues, and implement fixes to enhance stability and security.Work closely with frontend developers to ensure seamless data flow and user experience.Implement data storage solutions and optimize database queries for efficiency.Ensure the application backend is secure, scalable, and aligned with industry best practices.Conduct regular system updates, security patches, and performance tuning.Maintain technical documentation and provide support for backend-related inquiries.Collaborate with cross-functional teams to improve app functionality and user experience.Perform ad hoc tasks related to backend development as required.Requirements & QualificationsExperience: Minimum of 3-5 years in backend development, preferably for mobile or web applications.Technical Skills: Proficiency in backend programming languages such as Node.js, Python, Java, Ruby, or PHP.Database Management: Strong experience with SQL and NoSQL databases (e.g., PostgreSQL, MySQL, MongoDB, Firebase).API Development: Expertise in RESTful and GraphQL APIs integration and management.Cloud & DevOps: Familiarity with AWS, Azure, or Google Cloud services and deployment pipelines.Security: Understanding of backend security best practices, authentication, and data protection.Version Control: Proficient in Git and GitHub/GitLab for code management and collaboration.Problem-Solving: Strong analytical and troubleshooting skills to resolve backend issues effectively.Collaboration: Ability to work independently and collaboratively with frontend developers, designers, and stakeholders.Amenable to work PART TIME Monday to Friday between 8 AM to 12 PM or 1 PM to 5 PM Pacific Standard Time (PST)Preferred QualificationsEducation: Bachelor’s degree in Computer Science, Software Engineering, or a related field.Experience with containerization (Docker, Kubernetes) for application deployment.Knowledge of serverless computing and microservices architecture.Prior experience maintaining and scaling applications post-launch.Familiarity with CI/CD pipelines for efficient development workflows.Pay: $700 + $50 Allowance per month$700 + $30 Allowance per month for candidates outside the PH Employment type: Part TimeWorking hours: Monday to Friday between 8 AM to 12 PM OR 1 PM to 5 PM Pacific Standard Time (PST)",
            "score": 0.09105596858565192
        }
    ],
    "top_bert_jobs": [
        {
            "job_position": "Data Scientist - LLM",
            "company_name": "YO IT CONSULTING",
            "job_description": "Python Data Scientist/AnalystExperience: 4 - 20 YearsLocation: - Anywhere in the World - Permanent RemoteContract Duration:  6-12 monthsWork Hours: 5 hours overlap with PST time zoneStandard work hours are 8 AM PST - 4 PM PST.Must-HaveBachelor’s/Master’s degree in Engineering, Computer Science (or equivalent experience) At least 4 years of relevant experience as a data scientist 3+ years of data analysis experience and a desire to have a significant impact on the field of artificial intelligence 4+ years of experience working with Python programming.Fluent in conversational and written English communication skills.Job DescriptionWe are actively seeking talented Data Scientists & Analysts proficient in Python to join our ambitious team dedicated to pushing the frontiers of AI technology. This opportunity is tailored for professionals who thrive on developing innovative solutions and aspire to be at the forefront of AI advancements. You will work with companies in the US looking to develop cutting-edge commercial and research AI solutions.Job ResponsibilitiesWrite effective Python code to tackle complex issues, but also use your business sense and analytical abilities to glean valuable insights from public databases Communicate clearly with researchers and help the organization in realizing its objectives Clearly express the reasoning and logic when writing code in Jupyter notebooks, or other suitable mediums Fix bugs in the code and create thorough documentation Utilize extensive data analysis skills to develop and respond to important business queries using available datasets (such as those from Kaggle, the UN, the US government, etc.) Effectively communicate with the researchers to comprehend the needs and provide the resultsJob RequirementsBachelor’s/Master’s degree in Engineering, Computer Science (or equivalent experience) At least 4 years of relevant experience as a data scientist 3+ years of data analysis experience and a desire to have a significant impact on the field of artificial intelligence 4+ years of experience working with Python programming Strong data analytic abilities and business sense are required to draw the appropriate conclusions from the dataset, respond to those conclusions, and clearly convey the key findings Excellent problem-solving and analytical skills Excellent communication abilities to work with stakeholders and researchers successfully Fluent in conversational and written English communication skills Skills: computer science,problem-solving skills,bug fixing,spoken communication,conversational english communication skills,written english communication skills,data scientist,communication skills,problem-solving,us government datasets,python code,english communication,written english communication,stakeholder management,business sense,python code writing,data analysis,extensive data analysis,conversational english,analytical abilities,excellent communication abilities,engineering,data analysis skills,data,documentation,business queries,data analyst,communication abilities,artificial intelligence,data analytic abilities,coding,data science,un datasets,python,english communication skills,communication,written and conversational english communication,conversational english communication,kaggle datasets,bachelor’s/master’s degree in engineering,jupyter notebooks,stakeholder communication,analytical skills,data analytics,problem solving,ai technology,python programming,programming,data analytic,written communication",
            "score": 0.916756272315979
        },
        {
            "job_position": "Data Scientist - LLM",
            "company_name": "YO IT Group",
            "job_description": "Python Data Scientist/AnalystExperience: 4 - 20 YearsLocation: - Anywhere in the World - Permanent RemoteContract Duration:  6-12 monthsWork Hours: 5 hours overlap with PST time zoneStandard work hours are 8 AM PST - 4 PM PST.Must-HaveBachelor’s/Master’s degree in Engineering, Computer Science (or equivalent experience) At least 4 years of relevant experience as a data scientist 3+ years of data analysis experience and a desire to have a significant impact on the field of artificial intelligence 4+ years of experience working with Python programming.Fluent in conversational and written English communication skills.Job DescriptionWe are actively seeking talented Data Scientists & Analysts proficient in Python to join our ambitious team dedicated to pushing the frontiers of AI technology. This opportunity is tailored for professionals who thrive on developing innovative solutions and aspire to be at the forefront of AI advancements. You will work with companies in the US looking to develop cutting-edge commercial and research AI solutions.Job ResponsibilitiesWrite effective Python code to tackle complex issues, but also use your business sense and analytical abilities to glean valuable insights from public databases Communicate clearly with researchers and help the organization in realizing its objectives Clearly express the reasoning and logic when writing code in Jupyter notebooks, or other suitable mediums Fix bugs in the code and create thorough documentation Utilize extensive data analysis skills to develop and respond to important business queries using available datasets (such as those from Kaggle, the UN, the US government, etc.) Effectively communicate with the researchers to comprehend the needs and provide the resultsJob RequirementsBachelor’s/Master’s degree in Engineering, Computer Science (or equivalent experience) At least 4 years of relevant experience as a data scientist 3+ years of data analysis experience and a desire to have a significant impact on the field of artificial intelligence 4+ years of experience working with Python programming Strong data analytic abilities and business sense are required to draw the appropriate conclusions from the dataset, respond to those conclusions, and clearly convey the key findings Excellent problem-solving and analytical skills Excellent communication abilities to work with stakeholders and researchers successfully Fluent in conversational and written English communication skills Skills: computer science,problem-solving skills,bug fixing,spoken communication,conversational english communication skills,written english communication skills,data scientist,communication skills,problem-solving,us government datasets,python code,english communication,written english communication,stakeholder management,business sense,python code writing,data analysis,extensive data analysis,conversational english,analytical abilities,excellent communication abilities,engineering,data analysis skills,data,documentation,business queries,data analyst,communication abilities,artificial intelligence,data analytic abilities,coding,data science,un datasets,python,english communication skills,communication,written and conversational english communication,conversational english communication,kaggle datasets,bachelor’s/master’s degree in engineering,jupyter notebooks,stakeholder communication,analytical skills,data analytics,problem solving,ai technology,python programming,programming,data analytic,written communication",
            "score": 0.916756272315979
        },
        {
            "job_position": "Verilog Design Verification Engineer",
            "company_name": "YO IT CONSULTING",
            "job_description": "Hardware Design DeveloperExperience: 3 - 25 YearsLocation: - Permanent Remote anywhere in the WorldContract Length: 6 MonthsType: Full time contract(8 hrs/day) Overlap Hours: 4 hrs/day with PSTMandatory SkillsOverall - 5 years of exp.Min of 2 years of relevant experience in Hardware Design and/or Hardware VerificationExperience With One Or More On The List Below>ASIC>VLSI>FPGA>SOCExperience with one or more on the list below>SystemVerilog development>Verilog development>Testbench development and/or verification.Good communication skills in English.LLM experience is not mandatory, however, the candidate should be fine to work as a LLM Engineer for Verilog.Must-HaveBS or MS degree in Electrical, Engineering, or related field.3-5 years of proven experience in hardware design development.Expertise in HDLs such as Verilog, SystemVerilog, VHDL, and SystemC.Expertise in scripting, front-end and verification workflows, and integrations within the hardware design environment.Expertise in UVM environmentsExpertise in Formal VerificationExpertise in Lint process and refinementGood communication skills in EnglishJob DescriptionWe're searching for an exceptional hardware design Developer to play a pivotal role in using the hardware design platform to generate the training data to enhance enterprise LLMs' capabilities. This unique position offers the chance to directly contribute to the sophistication of enterprise LLMs, ensuring they operate with unparalleled efficiency and intelligence.Your MissionDevelop, configure, and customize the hardware design platform, utilizing it to generate vital training data for enterprise LLMs.Liaise with research teams to translate requirements into actionable data insights, directly impacting our LLMs' performance.Uphold the highest standards in coding, debugging, and documentation, ensuring the hardware design solutions are optimized for LLM training and benchmarking.Collaborate across teams to identify and prioritize needs, contributing to the LLMs' ability to understand and automate complex processes.We NeedBS or MS degree in Electrical, Engineering, or related field.3-5 years of proven experience in hardware design development.Expertise in HDLs such as Verilog, SystemVerilog, VHDL, and SystemC.Expertise in scripting, front-end and verification workflows, and integrations within the hardware design environment.Exceptional problem-solving, communication, and collaborative skills.Familiarity with ML and AI systemsSkills: ai systems,verilog-a,soc,communication skills,hdl expertise,formal verification,hdl,integrations within hardware design environment,vhdl,collaboration,lint process refinement,systemverilog development,verification,hdls,knowledge of ml and ai systems,integration,verification workflows,integrations in hardware design,communication,systemverilog,integrations,vlsi,fpga,lint process and refinement,hdls (verilog, systemverilog, vhdl, systemc),uvm environments,electronics hardware design,hardware design development,good communication skills,front-end,ai,hardware design,verilog development,systemc,hdls (vhdl, systemc),machine learning,lint process,front-end and verification workflows,scripting,coding,ml,front-end verification workflows,uvm,asic,front-end development,design,integration within hardware design environment,debugging,hardware verification,ml and ai systems,integrations within the hardware design environment,electrical engineering,verilog,problem-solving,familiarity with ml and ai systems,testbench development,documentation,collaborative skills,front-end workflows",
            "score": 0.9065003395080566
        }
    ]
}