{
    "cv": {
        "full_name": "28126340",
        "skills": "strong team player, self motivated, demonstrated exceptional analytical skills, proven ability to work effectively and cross functionally with all levels SkillsMarketing, Operations, Database, Asp, Ms Sql Server, Sql, Sql Server, Technical Support, Testing, Asp.net, Budget, Clients, Database Systems,",
        "experience": "of management with responsibilities increasing in scope. 9+ years of experience as Client/Server developer using Transact SQL, PL\\SQL, Classic employees. Several projects included the management of offsite vendor resources. Experience using the following database management tools MS Experience environment. The scope of my role is to streamline IT operations, implement an effective online marketing and media strategy, automate the work that arose. During this period I was able to successfully multi-task and manage several projects concurrently making my role key in the successful team was a seamless transition that did not interrupt any existing production processes. Initiated the role of a technical support contact providing",
        "education": "Education Bachelor's , Computer Information Systems DeVry University ï¼​ City , State , US 9/2000 - 6/2004 DeVry University, Alpharetta, Georgia Bachelor's Degree, Computer Information Systems Academic Honors: Dean's List, Hope Scholarship GPA 3.46 while working and attending"
    },
    "top_cosine_jobs": [
        {
            "job_position": "Backend App Engineer/Developer",
            "company_name": "Move Your Business, Virtual Employment Agency",
            "job_description": "We are MOVE, a virtual employment agency, that aims to be #1 in the world by 2030.  We place the top 1% of talent globally with companies who want to achieve more at a fraction of the cost.  Our proprietary training and onboarding system guarantees results, or our client’s money back.   Check us out at www.moveyourbiz.com. One of our clients is looking for a highly skilled Backend App Engineer/Developer to maintain and enhance the backend infrastructure of a recently launched application. This role involves optimizing server-side functionality, managing databases, ensuring seamless API integrations, and improving application performance. The ideal candidate has a strong background in backend development, problem-solving abilities, and a passion for maintaining robust and scalable applications.Key ResponsibilitiesMaintain, optimize, and scale the backend infrastructure to ensure smooth application performance.Develop and manage server-side logic, database structures, and API integrations.Monitor application performance, troubleshoot issues, and implement fixes to enhance stability and security.Work closely with frontend developers to ensure seamless data flow and user experience.Implement data storage solutions and optimize database queries for efficiency.Ensure the application backend is secure, scalable, and aligned with industry best practices.Conduct regular system updates, security patches, and performance tuning.Maintain technical documentation and provide support for backend-related inquiries.Collaborate with cross-functional teams to improve app functionality and user experience.Perform ad hoc tasks related to backend development as required.Requirements & QualificationsExperience: Minimum of 3-5 years in backend development, preferably for mobile or web applications.Technical Skills: Proficiency in backend programming languages such as Node.js, Python, Java, Ruby, or PHP.Database Management: Strong experience with SQL and NoSQL databases (e.g., PostgreSQL, MySQL, MongoDB, Firebase).API Development: Expertise in RESTful and GraphQL APIs integration and management.Cloud & DevOps: Familiarity with AWS, Azure, or Google Cloud services and deployment pipelines.Security: Understanding of backend security best practices, authentication, and data protection.Version Control: Proficient in Git and GitHub/GitLab for code management and collaboration.Problem-Solving: Strong analytical and troubleshooting skills to resolve backend issues effectively.Collaboration: Ability to work independently and collaboratively with frontend developers, designers, and stakeholders.Amenable to work PART TIME Monday to Friday between 8 AM to 12 PM or 1 PM to 5 PM Pacific Standard Time (PST)Preferred QualificationsEducation: Bachelor’s degree in Computer Science, Software Engineering, or a related field.Experience with containerization (Docker, Kubernetes) for application deployment.Knowledge of serverless computing and microservices architecture.Prior experience maintaining and scaling applications post-launch.Familiarity with CI/CD pipelines for efficient development workflows.Pay: $700 + $50 Allowance per month$700 + $30 Allowance per month for candidates outside the PH Employment type: Part TimeWorking hours: Monday to Friday between 8 AM to 12 PM OR 1 PM to 5 PM Pacific Standard Time (PST)",
            "score": 0.12140696162849776
        },
        {
            "job_position": "Senior Test Automation Engineer",
            "company_name": "Netcetera",
            "job_description": "We are a team of experts who work together to design and develop software that matters. Netcetera strongly believes in and supports continuous professional development. We care about our well-being. At Netcetera, we share our expertise, foster exchange, and appreciate different approaches. Respect, reliability, commitment, and professionalism define us. Our teams work with agile development methodologies and use the latest technology. Netcetera specialists are part of an extensive network within the IT industry.As a Senior Test Automation Engineer you'll work in a very dynamic team of professionals assuring that our software products gets maximum support and reliability. We're looking for a bright, talented, experienced and responsible individual with great technical background, but in the same time a team player and someone who can stood up for the new demanding challenges on a daily basis. The ideal candidate must be self-organizing, proactive, self-starter and able to seek out information.Looking for a new challenge? Take the next big step in your career!The job ad is valid until 31.12.2024Your role: Designing, developing, and refining of automated testsPlanning, implementation, and execution of tests in the Mobile Payment/Authentication areaExtending the existing automated test framework covering aspects like functional tests, error provocation, performance tests and high-availability testsEnsuring high test coverage using automated continues integration testsTesting, qualification and ensuring quality of the delivered team artifacts for all customer projectsPresenting status and issues in clear concise manner to appropriate levels in managementWorking in conjunction with Product Management, Operations team and other stakeholdersBe able to function in a matrix environment with multiple stake holder often with competing priorities and requirements and with strict timelinesEvaluating new testing tools and provide POCsRequirementsYour profile:Bachelor's or Master's degree in Computer science, Information Science or related educational area from an education institution with strong reputation8+ years overall IT experience involving:Agile Methodologies, ScrumTest Management ToolsContinuous Integration through Jenkins, CI/CDManual Testing, API Testing experienceTest Automation experience:Good programming skills with one or more programming languages (e.g. Java, Perl, Shell and Bash Scripting)Good knowledge of Java, Spring Boot, Hibernate, Apache MavenPerformance Testing experience is nice to haveGood knowledge of HTTP(S), JMS and other modern protocolsGit, Stash and BitbucketExperience with DevOps tools and workflows such as Jira, Bamboo or equivalentsKnowledge of cryptography, authentication and authorization schemes and protocolsGood knowledge of databases and SQLKnowledge of any Linux OS (e.g. CentOS) i.e. should be familiar with Linux OS server deployment, starting/stopping processes, checking logs, sound knowledge of Linux/Unix CommandLineHands on experience of using Tools like - SOAPUI, Postman, SQL Developer etcKnowledge of different testing types like Unit, Integration, Regression, Functional etcExcellent written communication skills, as well as verbal; must be able to articulate technical aspects of solution/services to business executives and customersProven experience working in a distributed team setup and/or international teamAbility to:Translate business requirements into use case or test case and plan test activitiesDrive strategy through influence with leadership qualities which engineers recognize and respectInnovate and lead explorations into new technologies and strategiesEvaluate new technologies or tools, stay abreast with industry trendsNice to have knowledge in some of the listed technologies:DockerCucumberMicroservicesBenefits Flexibility: Adjust your time to work efficiently, be it working hours, part-time options, home office, or unpaid leave Extra vacation days: Need to take some extra time off? With us, you have the possibility to activate 5 additional paid days per year on top of your vacation plan Private health & Family Insurance: The company policy covers a private health insurance plan for you and your family Yearly Education Fund: We strongly believe in continuous development and would love to see you enrich your knowledge. Ever Netceterian has a dedicated yearly fund to invest in their professional and personal development through conferences, courses, lectures or long-term education Meals & Snacks: Enjoy a lunch allowance each working day, free fruit and drinks in the officeDiscover more benefits",
            "score": 0.1169091138497149
        },
        {
            "job_position": "Technical Business Analyst",
            "company_name": "scandiweb",
            "job_description": "Department: Business DevelopmentLocation: North MacedoniaCompensation: €1,765 - €2,245 / monthDescriptionFor every person joining us for any position, there is a path and an opportunity to reach an executive role and become a company partnerAntons Sapriko, Company FounderHere is a video story of a colleague who joined the Key Account Manager team:Laura Balode, Gaining experience and becoming an eCommerce expert Key Account Manager. Latvia.﻿﻿*Please note that the salary is stated as a NET amount due to international hiring considerations. In the event of employment, the specified ranges will be adjusted to include applicable taxes.How to Become a Technical Business Analyst at scandiweb eCommerce Expert Team?We are a very inclusive company with colleagues from over 30 countries across all continents. Our ratio of females is among the highest in the industry. We welcome people from all walks of life who can complete a test by showing their skill and knowledge.While a solid understanding of web technologies and development processes, experience in managing projects, and ability to analyze complex business requirements are expected in this role, we value your ability to deliver results starting from the test task, and your enthusiasm and openness to embrace new knowledge and processes. Continuous learning and acting on feedback are among our core organizational values.What are the responsibilities of a Technical Business Analyst?As a Technical Business Analyst at scandiweb, you will play a pivotal role in bridging the gap between our client's business objectives and our technical solutions.Your primary responsibility will be to conduct comprehensive discovery sessions, both onsite and online, to analyze and plan potential web projects. This involves leading workshops with clients to delve into various aspects of their projects, meticulously scoping out requirements, and producing detailed documentation.The culmination of your efforts will be a thorough estimate of the project's development costs, which you will present to the client before transitioning the project to our delivery department.Our projects range from large-scale eCommerce solutions to mobile applications and custom-built systems, ensuring a diverse and challenging work environment.What do we expect from you?Detail Orientation: A keen eye for detail is essential to ensure all project aspects are accurately captured and documented;Technical Proficiency: A solid understanding of web technologies and development processes to effectively communicate with both clients and technical teams; Analytical and Logical Thinking: Ability to analyze complex business requirements and translate them into actionable project plans; Communication Skills: Excellent verbal and written communication skills to facilitate clear and effective client interactions and documentation; Confident written and spoken English skills. You will be working internationally;Project Management: Experience in managing projects from inception through planning, ensuring timelines and deliverables are met; Client Engagement: Proven ability to build and maintain strong client relationships, understanding their needs and delivering solutions that meet their objectives; Business Insight: A proactive ability to understand the client's business and identify potential opportunities where our solutions can bring additional value.Further career growth for Technical Business Analyst?You will get support in career counseling from our HR department as each career path is unique taking into account your personal strengths and ambitions.Further professional growth and development can lead you to become a senior, team lead for one and/or multiple teams, heading a particular practice, and ultimately working with top accounts like Puma, The New York Times, or Läderach.What is the compensation package of a Technical Business Analyst at scandiweb?Competitive starting salary relative to the market;Valuable eCommerce experience at the industry leader scandiweb;Substantial monetary bonuses based on successful lead conversion to client;Exciting travel opportunities;Support for hardware upgrades;Core health insurance coverage and sports bonuses;A diverse multinational team of experts to learn from;Company-covered training and certification;Legendary online and onsite events to celebrate our success together.Next stepsApply and fill in the application form;Receive the test task and complete it.Here is what people who joined the Key Account Management team want to share with you:\"My journey with scandiweb started unexpectedly and out of curiosity. I saw an ad for a Junior Project Manager position and since I was somehow in IT but with little experience, I decided to try it out. It was a huge surprise to receive an offer and make it all happen.My first projects were in different stages and on different levels of experience needed. However, I was not hesitant to jump on them! North Coast Pottery (US client), Stenders (LV client), and Hebes Code (Spanish client). Being able to work on projects within different stages of development allowed me to learn the full cycle fairly quickly and progress in a speedy mode!With the vast experience from the 3 projects, I continued my growth by joining Business Development (BD) - and that's when my career took a massive turn. After learning all the basics, I was made a Key Account Manager of 5 different accounts at scandiweb.The best things I have learned and gained thanks to scandiweb? Self-confidence and believing in my experience. They allowed me to grow at my own pace and gave me an enormous amount of trust. The freedom of being able to work within your own frames makes you feel like the processes are not there! All of the teams and managers I worked with, valued me for who I am, and leveraged my strengths to the best advantage.\"Dominika Plata, Key Account Manager from Poland. Joined the company on 4/3/2023.\"I was looking for a company working in a variety of technologies and frameworks related to eCommerce, and scandiweb was the best suitable for this. I remember my first project was Christmas Tree World in which we did a Magento 2 Fresh build with data migration from the old Magento 2 website.I had the opportunity to lead the project discovery calls with the client to finalize the requirements, analyze and document the proposed implementation, and provide a project work estimate. Getting a chance to be involved in all things discovery enhances your technical skills and develops interpersonal skills and client communication.I have learned that the best things on scandiweb are teamwork, handling responsibilities, and knowledge of eCommerce related technologies like iPaaS and PIM.\"Anup Wankhede, Key Account Manager from India. Joined the company 10/30/2023.",
            "score": 0.10712278640036137
        }
    ],
    "top_bert_jobs": [
        {
            "job_position": "Senior Test Automation Engineer",
            "company_name": "Netcetera",
            "job_description": "We are a team of experts who work together to design and develop software that matters. Netcetera strongly believes in and supports continuous professional development. We care about our well-being. At Netcetera, we share our expertise, foster exchange, and appreciate different approaches. Respect, reliability, commitment, and professionalism define us. Our teams work with agile development methodologies and use the latest technology. Netcetera specialists are part of an extensive network within the IT industry.As a Senior Test Automation Engineer you'll work in a very dynamic team of professionals assuring that our software products gets maximum support and reliability. We're looking for a bright, talented, experienced and responsible individual with great technical background, but in the same time a team player and someone who can stood up for the new demanding challenges on a daily basis. The ideal candidate must be self-organizing, proactive, self-starter and able to seek out information.Looking for a new challenge? Take the next big step in your career!The job ad is valid until 31.12.2024Your role: Designing, developing, and refining of automated testsPlanning, implementation, and execution of tests in the Mobile Payment/Authentication areaExtending the existing automated test framework covering aspects like functional tests, error provocation, performance tests and high-availability testsEnsuring high test coverage using automated continues integration testsTesting, qualification and ensuring quality of the delivered team artifacts for all customer projectsPresenting status and issues in clear concise manner to appropriate levels in managementWorking in conjunction with Product Management, Operations team and other stakeholdersBe able to function in a matrix environment with multiple stake holder often with competing priorities and requirements and with strict timelinesEvaluating new testing tools and provide POCsRequirementsYour profile:Bachelor's or Master's degree in Computer science, Information Science or related educational area from an education institution with strong reputation8+ years overall IT experience involving:Agile Methodologies, ScrumTest Management ToolsContinuous Integration through Jenkins, CI/CDManual Testing, API Testing experienceTest Automation experience:Good programming skills with one or more programming languages (e.g. Java, Perl, Shell and Bash Scripting)Good knowledge of Java, Spring Boot, Hibernate, Apache MavenPerformance Testing experience is nice to haveGood knowledge of HTTP(S), JMS and other modern protocolsGit, Stash and BitbucketExperience with DevOps tools and workflows such as Jira, Bamboo or equivalentsKnowledge of cryptography, authentication and authorization schemes and protocolsGood knowledge of databases and SQLKnowledge of any Linux OS (e.g. CentOS) i.e. should be familiar with Linux OS server deployment, starting/stopping processes, checking logs, sound knowledge of Linux/Unix CommandLineHands on experience of using Tools like - SOAPUI, Postman, SQL Developer etcKnowledge of different testing types like Unit, Integration, Regression, Functional etcExcellent written communication skills, as well as verbal; must be able to articulate technical aspects of solution/services to business executives and customersProven experience working in a distributed team setup and/or international teamAbility to:Translate business requirements into use case or test case and plan test activitiesDrive strategy through influence with leadership qualities which engineers recognize and respectInnovate and lead explorations into new technologies and strategiesEvaluate new technologies or tools, stay abreast with industry trendsNice to have knowledge in some of the listed technologies:DockerCucumberMicroservicesBenefits Flexibility: Adjust your time to work efficiently, be it working hours, part-time options, home office, or unpaid leave Extra vacation days: Need to take some extra time off? With us, you have the possibility to activate 5 additional paid days per year on top of your vacation plan Private health & Family Insurance: The company policy covers a private health insurance plan for you and your family Yearly Education Fund: We strongly believe in continuous development and would love to see you enrich your knowledge. Ever Netceterian has a dedicated yearly fund to invest in their professional and personal development through conferences, courses, lectures or long-term education Meals & Snacks: Enjoy a lunch allowance each working day, free fruit and drinks in the officeDiscover more benefits",
            "score": 0.9350337386131287
        },
        {
            "job_position": "Systems Engineer - North Macedonia",
            "company_name": "Fortinet",
            "job_description": "Job DescriptionSystems Engineer – North MacedoniaLocation: Remote / North MacedoniaWhy Fortinet?Fortinet is one of the fastest-growing cybersecurity companies in the world. We have proven to be a truly innovative technology driven IT security Company. Fortinet’s mission is to deliver the most innovative, highest-performing network security fabric to secure and simplify IT infrastructures. Today we secure the largest enterprises, service providers and government organizations across the globe.Systems Engineering teamExperienced and passionate professionals, who lead all technical aspects of a sales cycle with the customer, from the initial RFIs, through to RFPs & RFQs when required. This includes the project management and active participation in POCs in partnership with the relevant teams both internally and within the customer and/or commercial partner.Your GoalsMaximize the Fortinet opportunity coverage and brand awareness in the market. Continuously improve knowledge around the Fortinet products and solutions, along with maintaining a deep understanding of the competitive landscape and Fortinet’s ability to provide long lasting protection against the ever-evolving threats. Position Fortinet solutions to the customer, whether this be remotely or in person.Develop relationships with key enterprise partnersAbout YouHave a high aptitude for security technology in network, endpoint and application areas. The CISSP accreditation would also be beneficial.Expert in the current technologies and trends in IT securitystrong understanding of RADIUS, PKI, IKE, Certificates, L2TP, IPSEC, FIREWALL, 802.1Q, MD5, SSH, SSL, SHA1, DES, 3DESAre currently or have previously worked in a pre-sales engineer role, managing end-to-end technical aspects of deals, through to technical closure.Can demonstrate your problem solving skills and how this impacted key wins within your current organization.Understand and can demonstrate your ability to build and maintain customer and partner relationships, including your ability to effectively communicate technically to a range of both external and internal stakeholdersWhat we offer?Competitive basic salary, uncapped commission with progressive multiplicators, employee stock and stock awards, health and welfare benefits.Flexible working approach, this is a field-based role, you can operate from anywhere in North MacedoniaEmpowering and supportive working environment, where you can be yourselfInnovative, collaborative and dynamic company with a double-digit growth over the last decade.Training on the job with many other formal trainings and industry recognized certifications.Our CommitmentFortinet is an equal opportunity employer. We value the diversity in our company, and all qualified applicants will receive consideration for employment without regard to race, colour, religion, gender, sexual orientation, gender identity, nationality in addition to any other applicable legally protected characteristics in the location in which the candidate is applying.",
            "score": 0.9318020343780518
        },
        {
            "job_position": "Verilog Design Verification Engineer",
            "company_name": "YO IT CONSULTING",
            "job_description": "Hardware Design DeveloperExperience: 3 - 25 YearsLocation: - Permanent Remote anywhere in the WorldContract Length: 6 MonthsType: Full time contract(8 hrs/day) Overlap Hours: 4 hrs/day with PSTMandatory SkillsOverall - 5 years of exp.Min of 2 years of relevant experience in Hardware Design and/or Hardware VerificationExperience With One Or More On The List Below>ASIC>VLSI>FPGA>SOCExperience with one or more on the list below>SystemVerilog development>Verilog development>Testbench development and/or verification.Good communication skills in English.LLM experience is not mandatory, however, the candidate should be fine to work as a LLM Engineer for Verilog.Must-HaveBS or MS degree in Electrical, Engineering, or related field.3-5 years of proven experience in hardware design development.Expertise in HDLs such as Verilog, SystemVerilog, VHDL, and SystemC.Expertise in scripting, front-end and verification workflows, and integrations within the hardware design environment.Expertise in UVM environmentsExpertise in Formal VerificationExpertise in Lint process and refinementGood communication skills in EnglishJob DescriptionWe're searching for an exceptional hardware design Developer to play a pivotal role in using the hardware design platform to generate the training data to enhance enterprise LLMs' capabilities. This unique position offers the chance to directly contribute to the sophistication of enterprise LLMs, ensuring they operate with unparalleled efficiency and intelligence.Your MissionDevelop, configure, and customize the hardware design platform, utilizing it to generate vital training data for enterprise LLMs.Liaise with research teams to translate requirements into actionable data insights, directly impacting our LLMs' performance.Uphold the highest standards in coding, debugging, and documentation, ensuring the hardware design solutions are optimized for LLM training and benchmarking.Collaborate across teams to identify and prioritize needs, contributing to the LLMs' ability to understand and automate complex processes.We NeedBS or MS degree in Electrical, Engineering, or related field.3-5 years of proven experience in hardware design development.Expertise in HDLs such as Verilog, SystemVerilog, VHDL, and SystemC.Expertise in scripting, front-end and verification workflows, and integrations within the hardware design environment.Exceptional problem-solving, communication, and collaborative skills.Familiarity with ML and AI systemsSkills: ai systems,verilog-a,soc,communication skills,hdl expertise,formal verification,hdl,integrations within hardware design environment,vhdl,collaboration,lint process refinement,systemverilog development,verification,hdls,knowledge of ml and ai systems,integration,verification workflows,integrations in hardware design,communication,systemverilog,integrations,vlsi,fpga,lint process and refinement,hdls (verilog, systemverilog, vhdl, systemc),uvm environments,electronics hardware design,hardware design development,good communication skills,front-end,ai,hardware design,verilog development,systemc,hdls (vhdl, systemc),machine learning,lint process,front-end and verification workflows,scripting,coding,ml,front-end verification workflows,uvm,asic,front-end development,design,integration within hardware design environment,debugging,hardware verification,ml and ai systems,integrations within the hardware design environment,electrical engineering,verilog,problem-solving,familiarity with ml and ai systems,testbench development,documentation,collaborative skills,front-end workflows",
            "score": 0.9300931692123413
        }
    ]
}