{
    "cv": {
        "full_name": "18187364",
        "skills": "Oracle Certified Professional (OCP), versions 8.0, 8i, 9i, 10g, 11g Strong collaborative skills Skills",
        "experience": "Professional Experience Train other Database Administrators in security best practices, change control, monitoring, account management and role-based user Developed and implemented procedures that reduced in-house database problem tickets by 60%, job failures by 80% and on-call support",
        "education": "Building automated database risk/security models for quantifying degrees of database risk and enabling the standardization and prioritization Education"
    },
    "top_cosine_jobs": [
        {
            "job_position": "Information Security Officer",
            "company_name": "Semos Cloud",
            "job_description": "Role SummaryWe are looking for a motivated Information Security Officer (ISO) to support our security efforts across the organization. In this role, you will contribute to securing our product, protecting company assets, and providing security assurance to our customers. This position is perfect for someone with a solid background in information security who is eager to take on practical responsibilities and grow in a SaaS environment.Key ResponsibilitiesAs an Information Security Officer, you will work in three main areas: Secure the Product and Infrastructure (Security Engineering), Protect the Company (Security Operations), and Assure the Customer (Security Assurance). Your specific tasks will include:Secure the Product and Infrastructure - Security EngineeringApplication and Infrastructure Security:Conduct security assessments and tests before and after deployment to spot vulnerabilities.Help find flaws in software configurations, detect malicious code, and manage patches or upgrades.Assist in putting a secure software development lifecycle (SDLC) into place and help train developers on current security best practices.Conduct security assessments for our PaaS and IaaS providers to ensure compliance with security standards.Enrich product security by implementing and improving the security measures by default and by design Security Research:Support research into vulnerabilities in company assets and SaaS applications we use.Assist in tracking fixes to ensure vulnerabilities are resolved on time.Protect The Company - Security OperationsSecurity Measures:Help put security measures in place and monitor them to protect the company and its assets.Security Improvements:Support efforts to improve security for the product and the company.Penetration Testing:Take part in realistic cyber attack simulations against company systems, property, and employees to find weaknesses.Incident Management:Help identify security anomalies and events, and support the Security Incident Response Team (SIRT) in handling incidents.Assure the Customer - Security AssuranceSecurity Compliance:Support the governance, risk, and compliance program tailored for SaaS as part of the second line of defense.Help keep a certification roadmap on track based on customer needs, including ISO 27001 and SOC 2.Assist in checking security controls, supporting fixes for audit findings, and participating in external certification audits.Risk and Field Security:Assist in supporting customer assurance activities as part of the company’s security team by providing materials, RFP updates, and customer assistance.Help to respond to customer inquiries and manage security questions accurately and on time, reporting any risks or trends you notice.Contribute to maintaining a Third Party Risk Management program to handle risks from external vendors.Develop and maintain security awareness training programs for employees to mitigate human-related security risks.To be successful in this role, you need Bachelor’s degree in Computer Science, Information Security, or a related field.3-5 years of experience in information security.Proficiency in English, both written and spoken.Good technical knowledge in areas like application security, vulnerability research, penetration testing, incident response, and security compliance.Familiarity with SaaS security and compliance frameworks such as ISO 27001 and SOC 2.Familiarity with security aspects of PaaS and IaaS providers (Azure, AWS)Hands-on experience with risk assessments, vulnerability management, security testing tools, and preparing and maintaining security documentation (white papers, policies, and guidelines).Strong communication and teamwork skills, with the ability to collaborate with technical teams, developers, and customers.Nice to HaveExperience in a B2B SaaS setting is a plus.Some understanding of data privacy regulations and compliance needs.Eagerness to learn and grow in a fast-moving security environment.Reasons to join our team Already proven, qualified, certified to play in the Champs League.  Truly global, enterprise customer base & brands to grow. In serving customers, together we grow for a better world. Read more about our customers here  You get to play with superb innovative cloud technology and agile working framework Learn more about our platform here  Our people at placed the center of the business. Dynamic SaaS, visionary leadership, and team spirit to win Learn more about us here  Our values derive from our people-centered culture. We are culture believers, driven by continuous growth, quick to move from planning to action, fearless in experimenting, and humbly working to change the world for the better. Read more about our culture here What We OfferCompetitive Salary Private Health Insurance Referral Bonus Program Hybrid Work Training and Coaching Opportunities Culture Fest (tickets for cultural events) Ergonomic workspace with kitchen offering healthy food options and beverages Sportmaster or FitKit Membership Psychological Health Support Program Off-site Team Building Events Office Skopje (hybrid)Team Legal & ComplianceReport toHead of LegalWorking Hours Monday – Friday 09:00 – 17:00 CET",
            "score": 0.17769542733859925
        },
        {
            "job_position": "Backend App Engineer/Developer",
            "company_name": "Move Your Business, Virtual Employment Agency",
            "job_description": "We are MOVE, a virtual employment agency, that aims to be #1 in the world by 2030.  We place the top 1% of talent globally with companies who want to achieve more at a fraction of the cost.  Our proprietary training and onboarding system guarantees results, or our client’s money back.   Check us out at www.moveyourbiz.com. One of our clients is looking for a highly skilled Backend App Engineer/Developer to maintain and enhance the backend infrastructure of a recently launched application. This role involves optimizing server-side functionality, managing databases, ensuring seamless API integrations, and improving application performance. The ideal candidate has a strong background in backend development, problem-solving abilities, and a passion for maintaining robust and scalable applications.Key ResponsibilitiesMaintain, optimize, and scale the backend infrastructure to ensure smooth application performance.Develop and manage server-side logic, database structures, and API integrations.Monitor application performance, troubleshoot issues, and implement fixes to enhance stability and security.Work closely with frontend developers to ensure seamless data flow and user experience.Implement data storage solutions and optimize database queries for efficiency.Ensure the application backend is secure, scalable, and aligned with industry best practices.Conduct regular system updates, security patches, and performance tuning.Maintain technical documentation and provide support for backend-related inquiries.Collaborate with cross-functional teams to improve app functionality and user experience.Perform ad hoc tasks related to backend development as required.Requirements & QualificationsExperience: Minimum of 3-5 years in backend development, preferably for mobile or web applications.Technical Skills: Proficiency in backend programming languages such as Node.js, Python, Java, Ruby, or PHP.Database Management: Strong experience with SQL and NoSQL databases (e.g., PostgreSQL, MySQL, MongoDB, Firebase).API Development: Expertise in RESTful and GraphQL APIs integration and management.Cloud & DevOps: Familiarity with AWS, Azure, or Google Cloud services and deployment pipelines.Security: Understanding of backend security best practices, authentication, and data protection.Version Control: Proficient in Git and GitHub/GitLab for code management and collaboration.Problem-Solving: Strong analytical and troubleshooting skills to resolve backend issues effectively.Collaboration: Ability to work independently and collaboratively with frontend developers, designers, and stakeholders.Amenable to work PART TIME Monday to Friday between 8 AM to 12 PM or 1 PM to 5 PM Pacific Standard Time (PST)Preferred QualificationsEducation: Bachelor’s degree in Computer Science, Software Engineering, or a related field.Experience with containerization (Docker, Kubernetes) for application deployment.Knowledge of serverless computing and microservices architecture.Prior experience maintaining and scaling applications post-launch.Familiarity with CI/CD pipelines for efficient development workflows.Pay: $700 + $50 Allowance per month$700 + $30 Allowance per month for candidates outside the PH Employment type: Part TimeWorking hours: Monday to Friday between 8 AM to 12 PM OR 1 PM to 5 PM Pacific Standard Time (PST)",
            "score": 0.11924173491380301
        },
        {
            "job_position": "DevOps Engineer",
            "company_name": "G+D Netcetera",
            "job_description": "G+D Netcetera specialists are part of an extensive network within the IT industry. Our teams work with agile development methodologies and use the latest technology.G+D Netcetera strongly believes in and supports continuous professional development. Mutual respect, reliability, personal commitment and a high degree of professionalism define our G+D Netcetera community. In international teams, we passionately develop customized solutions and products for the challenges of the future.We are looking for an experienced DevOps Engineer with software and system engineering skills and interests in highly critical risk-systems! The ideal candidate will be responsible for the reliability of our environments and software while working in a dynamic environment, driven by customers' requirements.We are a team of experts who work together in a DevOps team to design and develop software and operate it in our own datacenters or in well known cloud environments. Our team also supports our developers in architecture, deployment and operation of software to ensure our standards for a smooth operation and support.We are operating a critical, highly available, service-oriented architecture with 50+ applications over multiple datacenters and cloud providers.One area of our expertise is risk-analysis for credit-card transactions, and we are looking to extend our team in this part to ensure effective deployment and testing and making sure to have a reliable operation in the cloud.Join us and be part of a client-oriented culture and a fast-growing community with ambitious plans.The job ad is valid until 31.03.2025Your tasksContinuous Improvement of the architecture, build, deployment-and monitoring processes. local and cloud environmentWorking on numerous environments, applications (mainly Java), Tools (deployment, monitoring, ..), Containers running on many hosts on multiple environmentsProviding knowledge transfer to the 1st level support team for operational topics and providing 2nd and 3rd level supportRequirementsYour profileBachelor's or Master's degree in computer science or software engineering or relevant field and a lot of curiosity in DevOps topicsSystem engineering skills required (Linux, networking, security, deployment automation)Experience in Cloud Based container technologies is required; AWS is a plusExperience in integration & installation of 3rd party software in complex environments is very welcomeSoftware development and deployment (Java, Spring, Linux) experienceExperience in System & Software Architecture (incl. Container)Interests in high security Systems and compliance topicsFluent in English (written and spoken), knowledge of German is a plusBenefits Flexibility: Adjust your time to work efficiently, be it working hours, part-time options, home office, or unpaid leave Extra vacation days: Need to take some extra time off? With us, you have the possibility to activate 5 additional paid days per year on top of your vacation plan Private health & Family Insurance: The company policy covers a private health insurance plan for you and your family Yearly Education Fund: We strongly believe in continuous development and would love to see you enrich your knowledge. Every Netceterian has a dedicated yearly fund to invest in their professional and personal development through conferences, courses, lectures or long-term education Meals & Snacks: Enjoy a lunch allowance each working day, free fruit and drinks in the officeDiscover more benefits",
            "score": 0.07577318921084475
        }
    ],
    "top_bert_jobs": [
        {
            "job_position": "Backend App Engineer/Developer",
            "company_name": "Move Your Business, Virtual Employment Agency",
            "job_description": "We are MOVE, a virtual employment agency, that aims to be #1 in the world by 2030.  We place the top 1% of talent globally with companies who want to achieve more at a fraction of the cost.  Our proprietary training and onboarding system guarantees results, or our client’s money back.   Check us out at www.moveyourbiz.com. One of our clients is looking for a highly skilled Backend App Engineer/Developer to maintain and enhance the backend infrastructure of a recently launched application. This role involves optimizing server-side functionality, managing databases, ensuring seamless API integrations, and improving application performance. The ideal candidate has a strong background in backend development, problem-solving abilities, and a passion for maintaining robust and scalable applications.Key ResponsibilitiesMaintain, optimize, and scale the backend infrastructure to ensure smooth application performance.Develop and manage server-side logic, database structures, and API integrations.Monitor application performance, troubleshoot issues, and implement fixes to enhance stability and security.Work closely with frontend developers to ensure seamless data flow and user experience.Implement data storage solutions and optimize database queries for efficiency.Ensure the application backend is secure, scalable, and aligned with industry best practices.Conduct regular system updates, security patches, and performance tuning.Maintain technical documentation and provide support for backend-related inquiries.Collaborate with cross-functional teams to improve app functionality and user experience.Perform ad hoc tasks related to backend development as required.Requirements & QualificationsExperience: Minimum of 3-5 years in backend development, preferably for mobile or web applications.Technical Skills: Proficiency in backend programming languages such as Node.js, Python, Java, Ruby, or PHP.Database Management: Strong experience with SQL and NoSQL databases (e.g., PostgreSQL, MySQL, MongoDB, Firebase).API Development: Expertise in RESTful and GraphQL APIs integration and management.Cloud & DevOps: Familiarity with AWS, Azure, or Google Cloud services and deployment pipelines.Security: Understanding of backend security best practices, authentication, and data protection.Version Control: Proficient in Git and GitHub/GitLab for code management and collaboration.Problem-Solving: Strong analytical and troubleshooting skills to resolve backend issues effectively.Collaboration: Ability to work independently and collaboratively with frontend developers, designers, and stakeholders.Amenable to work PART TIME Monday to Friday between 8 AM to 12 PM or 1 PM to 5 PM Pacific Standard Time (PST)Preferred QualificationsEducation: Bachelor’s degree in Computer Science, Software Engineering, or a related field.Experience with containerization (Docker, Kubernetes) for application deployment.Knowledge of serverless computing and microservices architecture.Prior experience maintaining and scaling applications post-launch.Familiarity with CI/CD pipelines for efficient development workflows.Pay: $700 + $50 Allowance per month$700 + $30 Allowance per month for candidates outside the PH Employment type: Part TimeWorking hours: Monday to Friday between 8 AM to 12 PM OR 1 PM to 5 PM Pacific Standard Time (PST)",
            "score": 0.9179147481918335
        },
        {
            "job_position": "Senior Test Automation Engineer",
            "company_name": "Netcetera",
            "job_description": "We are a team of experts who work together to design and develop software that matters. Netcetera strongly believes in and supports continuous professional development. We care about our well-being. At Netcetera, we share our expertise, foster exchange, and appreciate different approaches. Respect, reliability, commitment, and professionalism define us. Our teams work with agile development methodologies and use the latest technology. Netcetera specialists are part of an extensive network within the IT industry.As a Senior Test Automation Engineer you'll work in a very dynamic team of professionals assuring that our software products gets maximum support and reliability. We're looking for a bright, talented, experienced and responsible individual with great technical background, but in the same time a team player and someone who can stood up for the new demanding challenges on a daily basis. The ideal candidate must be self-organizing, proactive, self-starter and able to seek out information.Looking for a new challenge? Take the next big step in your career!The job ad is valid until 31.12.2024Your role: Designing, developing, and refining of automated testsPlanning, implementation, and execution of tests in the Mobile Payment/Authentication areaExtending the existing automated test framework covering aspects like functional tests, error provocation, performance tests and high-availability testsEnsuring high test coverage using automated continues integration testsTesting, qualification and ensuring quality of the delivered team artifacts for all customer projectsPresenting status and issues in clear concise manner to appropriate levels in managementWorking in conjunction with Product Management, Operations team and other stakeholdersBe able to function in a matrix environment with multiple stake holder often with competing priorities and requirements and with strict timelinesEvaluating new testing tools and provide POCsRequirementsYour profile:Bachelor's or Master's degree in Computer science, Information Science or related educational area from an education institution with strong reputation8+ years overall IT experience involving:Agile Methodologies, ScrumTest Management ToolsContinuous Integration through Jenkins, CI/CDManual Testing, API Testing experienceTest Automation experience:Good programming skills with one or more programming languages (e.g. Java, Perl, Shell and Bash Scripting)Good knowledge of Java, Spring Boot, Hibernate, Apache MavenPerformance Testing experience is nice to haveGood knowledge of HTTP(S), JMS and other modern protocolsGit, Stash and BitbucketExperience with DevOps tools and workflows such as Jira, Bamboo or equivalentsKnowledge of cryptography, authentication and authorization schemes and protocolsGood knowledge of databases and SQLKnowledge of any Linux OS (e.g. CentOS) i.e. should be familiar with Linux OS server deployment, starting/stopping processes, checking logs, sound knowledge of Linux/Unix CommandLineHands on experience of using Tools like - SOAPUI, Postman, SQL Developer etcKnowledge of different testing types like Unit, Integration, Regression, Functional etcExcellent written communication skills, as well as verbal; must be able to articulate technical aspects of solution/services to business executives and customersProven experience working in a distributed team setup and/or international teamAbility to:Translate business requirements into use case or test case and plan test activitiesDrive strategy through influence with leadership qualities which engineers recognize and respectInnovate and lead explorations into new technologies and strategiesEvaluate new technologies or tools, stay abreast with industry trendsNice to have knowledge in some of the listed technologies:DockerCucumberMicroservicesBenefits Flexibility: Adjust your time to work efficiently, be it working hours, part-time options, home office, or unpaid leave Extra vacation days: Need to take some extra time off? With us, you have the possibility to activate 5 additional paid days per year on top of your vacation plan Private health & Family Insurance: The company policy covers a private health insurance plan for you and your family Yearly Education Fund: We strongly believe in continuous development and would love to see you enrich your knowledge. Ever Netceterian has a dedicated yearly fund to invest in their professional and personal development through conferences, courses, lectures or long-term education Meals & Snacks: Enjoy a lunch allowance each working day, free fruit and drinks in the officeDiscover more benefits",
            "score": 0.9114854335784912
        },
        {
            "job_position": "Junior Data Extraction Developer (Python)",
            "company_name": "ProjectFitter.ai",
            "job_description": "Our team keeps expanding! We are looking for a fast-learning Junior Data Extraction Developer who loves Python, code quality and ensures data security to unlock the raw potential of Big Web Data.Together We Will:Develop efficient web scraping scripts for E-Commerce data extraction using Python;Ensure high-quality data output through the identification and resolution of issues;Troubleshoot and provide support for client-reported bugs and system problems;Collaborate with team members, maintaining regular communication and escalating unresolved issues to the appropriate personnel;Implement testing procedures for Python-based web scraping scriptsRequirementsWhat We Will Need: Fluent written and spoken English;1-2 years of commercial experience with Python coding and scripting;  Strong web scraping experience using Python or Java;Experience in code development with JavaScript, HTML & CSS;HTML structure knowledge (how to extract entities);Hands-on experience with Linux;Strong familiarity with GitHub;Experience working with Relational Databases;Experience with web protocols, HTTP, networking problem-solving;Ability to prioritize tasks; Good documentation skills. Would Be a Plus:Experience working with Non-relational Databases;Understanding or experience with data collection, big data;Experience in the field of E-commerce / News, blogs; Ability to work for a common result;Great sense of humor 🙂BenefitsWe Offer:Lots of interesting work with a Big Web Data solutions;Compensation in USD;International team;Schedule: Sunday to Thursday; Fully remote",
            "score": 0.9041047096252441
        }
    ]
}