{
    "cv": {
        "full_name": "38753827",
        "skills": "management, standardizing PC and server O/S images, utilizing refurbished equipment, and implementing virtualization technologies. Technical SkillsSoftware: Active Directory, Microsoft Exchange, HP Insight Manager, EMC Avamar, Symantec Ghost, LanGuard Network Security",
        "experience": "Performance-driven IT executive experienced in building technology organizations that make IT a strategic partner of the company. Creates IT competitive advantages in capability and scale by leveraging best-in-class infrastructures. Highly experienced in building, improving, and turning Professional Experience Hands-on experience in all aspects of Disaster Recovery/Business Continuity Planning including design, documentation, and testing. Experience also included RAS, Seagate Backup Exec, and disaster recovery.",
        "education": "Education M.B.A : Dec. 2007 University of Massachusetts ï¼​ City , State B.S : Real Estate , May 1994 Arizona State University ï¼​ City , State"
    },
    "top_cosine_jobs": [
        {
            "job_position": "Data Scientist",
            "company_name": "Scalefocus",
            "job_description": "Are you a motivated Data Scientist, willing to grow as a professional and work on large-scale projects, using different working approaches that are both diverse and cutting-edge? Are you passionate about innovative and top-notch software solutions and want to be part of like-minded professionals? Do you enjoy working in a fast-paced, yet collaborative environment?If your answer is “Yes”, we would love to talk to you.What your responsibilities are going to be?Apply large language models (LLMs) to specific business problems to extract, process, classify and derive insights from the information hidden in unstructured datasets.Develop domain- or task-specific language models for business problems when proprietary or off-the-shelf models cannot be used.Evaluate the performance of machine learning models and make recommendations for improvement.Research and experiment with key technologies to remain up to date with the state of the art in NLP and generative AI research.Generate clean, efficient, and documented Python code.Offer direction and expertise to junior team members, promoting a culture of learning and knowledge sharing.Actively participate in code reviews and contribute to the establishment of software development best practices.Assist in data projects assessment, discovery, and design phasesWhat qualifications are needed?3+ years of experience as Data Scientist and hands-on experience with large language models (GPT, XLNet, T5, etc.).Advanced skills in Python development including libraries like NumPy, SciPy and experience with SQL.Strong communication and presentation skills, with the ability to explain technical concepts to non-technical stakeholders.Practical experience in working with cloud platforms, MS Azure, AWS or Google Cloud.AdvantagePhD or Master’s degree in Computer Science, Data Science, Machine Learning, Theoretical Linguistics or a related field. Relevant working experience may compensate for lack of education.Experience with containerization, Kubernetes (K8S) and application deployment.Knowledge or experience with vector databases such as Pinecone, Milvus, or Weaviate would be beneficialBy joining us:• You will have the chance to bring your technical expertise, enthusiasm, and entrepreneurial mindset, and shape the way we transform the business (and lives) of our clients, partners and society.• You will be surrounded by other highly performing team members and will have the chance to grow and scale with us.• You will become part of a thrilling and collaborative environment where you will be able to share your ideas and gain insightful feedback.• You will enjoy flexibility and be able to keep the balance between your personal and professional life and focus on what’s important.All applications will be treated in strict confidentiality.",
            "score": 0.0760400428831674
        },
        {
            "job_position": "Tech Lead",
            "company_name": "Globaldev Group",
            "job_description": "Bazarr.ai is revolutionizing the fragmented $700B U.S. wholesale market by introducing the AI Broker, an innovative platform that automates procurement between wholesalers and retailers. By enabling real-time bulk trade opportunities, Bazarr.ai reduces delays, inefficiencies, and overstocking. Backed by experienced industry leaders, the company has already achieved $2M GMV within the first month of launching its MVP and onboarded Alibaba's former CTO as an advisor.We're seeking a hands-on Tech Leader to spearhead the development of our core technology and scale our platform to meet growing demand. You will play a critical role in shaping the technical vision, mentoring a team of engineers, and delivering cutting-edge solutions to transform the wholesale market.What You'll Be DoingLeading the development of our core technology infrastructure, focusing on web applications, backend services, and scalable cloud solutionsDesigning, developing, and maintaining our platforms using a variety of programming languages, with a focus on Python and JavaScriptCollaborating closely with the product, design, and operations teams to turn business needs into high-performing technical solutionsEnsuring best practices in code quality, security, and performance across the tech stackExploring and integrating new technologies to solve business problems and enhance product offeringsManaging and mentoring a growing team of engineers, ensuring continuous learning and skill developmentProfessional RequirementsSolid experience in JavaScript (Node.js, and React/Vue/Angular)Experience building and deploying scalable systems, with a focus on microservices and serverless architectureHands-on experience with DevOps tools like Docker, Kubernetes, CI/CD pipelines, and cloud platforms (AWS, GCP, or Azure)Strong understanding of databases (SQL and NoSQL) and experience with data modellingFamiliarity with front-end frameworks and responsive web design principlesAbility to work with APIs (REST, GraphQL) and third-party integrationsExperience in working within an Agile/Scrum environment and using tools like JIRA or TrelloBonus SkillsExperience with AI/ML frameworks or data science toolsKnowledge of mobile development (iOS/Android)Familiarity with security best practices (OAuth, encryption, etc.)Proficiency in Python and frameworks like Django, Flask, or FastAPIPersonal RequirementsProblem solver: You approach challenges with creativity and determination, constantly finding new ways to solve tough technical problemsAdaptable: You thrive in a fast-paced environment and are comfortable learning and implementing new technologies as neededLeader and mentor: You are excited to lead a team, share your knowledge, and help others grow in their rolesPassionate: You are driven by building impactful solutions and take pride in delivering high-quality workCommunication skills: You can clearly articulate complex technical ideas to both tech and non-tech audiences, collaborating effectively across teamsOwnership mindset: You take initiative and full responsibility for the success of the tech platform, from concept to executionWhat We OfferCompetitive salary and benefits package;Flexible remote work arrangements;Opportunities for professional development and growth;Periodic review of the salary;Paid events attendance;Let's build something amazing together!",
            "score": 0.073228159829389
        },
        {
            "job_position": "Information Security Officer",
            "company_name": "Semos Cloud",
            "job_description": "Role SummaryWe are looking for a motivated Information Security Officer (ISO) to support our security efforts across the organization. In this role, you will contribute to securing our product, protecting company assets, and providing security assurance to our customers. This position is perfect for someone with a solid background in information security who is eager to take on practical responsibilities and grow in a SaaS environment.Key ResponsibilitiesAs an Information Security Officer, you will work in three main areas: Secure the Product and Infrastructure (Security Engineering), Protect the Company (Security Operations), and Assure the Customer (Security Assurance). Your specific tasks will include:Secure the Product and Infrastructure - Security EngineeringApplication and Infrastructure Security:Conduct security assessments and tests before and after deployment to spot vulnerabilities.Help find flaws in software configurations, detect malicious code, and manage patches or upgrades.Assist in putting a secure software development lifecycle (SDLC) into place and help train developers on current security best practices.Conduct security assessments for our PaaS and IaaS providers to ensure compliance with security standards.Enrich product security by implementing and improving the security measures by default and by design Security Research:Support research into vulnerabilities in company assets and SaaS applications we use.Assist in tracking fixes to ensure vulnerabilities are resolved on time.Protect The Company - Security OperationsSecurity Measures:Help put security measures in place and monitor them to protect the company and its assets.Security Improvements:Support efforts to improve security for the product and the company.Penetration Testing:Take part in realistic cyber attack simulations against company systems, property, and employees to find weaknesses.Incident Management:Help identify security anomalies and events, and support the Security Incident Response Team (SIRT) in handling incidents.Assure the Customer - Security AssuranceSecurity Compliance:Support the governance, risk, and compliance program tailored for SaaS as part of the second line of defense.Help keep a certification roadmap on track based on customer needs, including ISO 27001 and SOC 2.Assist in checking security controls, supporting fixes for audit findings, and participating in external certification audits.Risk and Field Security:Assist in supporting customer assurance activities as part of the company’s security team by providing materials, RFP updates, and customer assistance.Help to respond to customer inquiries and manage security questions accurately and on time, reporting any risks or trends you notice.Contribute to maintaining a Third Party Risk Management program to handle risks from external vendors.Develop and maintain security awareness training programs for employees to mitigate human-related security risks.To be successful in this role, you need Bachelor’s degree in Computer Science, Information Security, or a related field.3-5 years of experience in information security.Proficiency in English, both written and spoken.Good technical knowledge in areas like application security, vulnerability research, penetration testing, incident response, and security compliance.Familiarity with SaaS security and compliance frameworks such as ISO 27001 and SOC 2.Familiarity with security aspects of PaaS and IaaS providers (Azure, AWS)Hands-on experience with risk assessments, vulnerability management, security testing tools, and preparing and maintaining security documentation (white papers, policies, and guidelines).Strong communication and teamwork skills, with the ability to collaborate with technical teams, developers, and customers.Nice to HaveExperience in a B2B SaaS setting is a plus.Some understanding of data privacy regulations and compliance needs.Eagerness to learn and grow in a fast-moving security environment.Reasons to join our team Already proven, qualified, certified to play in the Champs League.  Truly global, enterprise customer base & brands to grow. In serving customers, together we grow for a better world. Read more about our customers here  You get to play with superb innovative cloud technology and agile working framework Learn more about our platform here  Our people at placed the center of the business. Dynamic SaaS, visionary leadership, and team spirit to win Learn more about us here  Our values derive from our people-centered culture. We are culture believers, driven by continuous growth, quick to move from planning to action, fearless in experimenting, and humbly working to change the world for the better. Read more about our culture here What We OfferCompetitive Salary Private Health Insurance Referral Bonus Program Hybrid Work Training and Coaching Opportunities Culture Fest (tickets for cultural events) Ergonomic workspace with kitchen offering healthy food options and beverages Sportmaster or FitKit Membership Psychological Health Support Program Off-site Team Building Events Office Skopje (hybrid)Team Legal & ComplianceReport toHead of LegalWorking Hours Monday – Friday 09:00 – 17:00 CET",
            "score": 0.07219759555770286
        }
    ],
    "top_bert_jobs": [
        {
            "job_position": "Tech Lead",
            "company_name": "Globaldev Group",
            "job_description": "Bazarr.ai is revolutionizing the fragmented $700B U.S. wholesale market by introducing the AI Broker, an innovative platform that automates procurement between wholesalers and retailers. By enabling real-time bulk trade opportunities, Bazarr.ai reduces delays, inefficiencies, and overstocking. Backed by experienced industry leaders, the company has already achieved $2M GMV within the first month of launching its MVP and onboarded Alibaba's former CTO as an advisor.We're seeking a hands-on Tech Leader to spearhead the development of our core technology and scale our platform to meet growing demand. You will play a critical role in shaping the technical vision, mentoring a team of engineers, and delivering cutting-edge solutions to transform the wholesale market.What You'll Be DoingLeading the development of our core technology infrastructure, focusing on web applications, backend services, and scalable cloud solutionsDesigning, developing, and maintaining our platforms using a variety of programming languages, with a focus on Python and JavaScriptCollaborating closely with the product, design, and operations teams to turn business needs into high-performing technical solutionsEnsuring best practices in code quality, security, and performance across the tech stackExploring and integrating new technologies to solve business problems and enhance product offeringsManaging and mentoring a growing team of engineers, ensuring continuous learning and skill developmentProfessional RequirementsSolid experience in JavaScript (Node.js, and React/Vue/Angular)Experience building and deploying scalable systems, with a focus on microservices and serverless architectureHands-on experience with DevOps tools like Docker, Kubernetes, CI/CD pipelines, and cloud platforms (AWS, GCP, or Azure)Strong understanding of databases (SQL and NoSQL) and experience with data modellingFamiliarity with front-end frameworks and responsive web design principlesAbility to work with APIs (REST, GraphQL) and third-party integrationsExperience in working within an Agile/Scrum environment and using tools like JIRA or TrelloBonus SkillsExperience with AI/ML frameworks or data science toolsKnowledge of mobile development (iOS/Android)Familiarity with security best practices (OAuth, encryption, etc.)Proficiency in Python and frameworks like Django, Flask, or FastAPIPersonal RequirementsProblem solver: You approach challenges with creativity and determination, constantly finding new ways to solve tough technical problemsAdaptable: You thrive in a fast-paced environment and are comfortable learning and implementing new technologies as neededLeader and mentor: You are excited to lead a team, share your knowledge, and help others grow in their rolesPassionate: You are driven by building impactful solutions and take pride in delivering high-quality workCommunication skills: You can clearly articulate complex technical ideas to both tech and non-tech audiences, collaborating effectively across teamsOwnership mindset: You take initiative and full responsibility for the success of the tech platform, from concept to executionWhat We OfferCompetitive salary and benefits package;Flexible remote work arrangements;Opportunities for professional development and growth;Periodic review of the salary;Paid events attendance;Let's build something amazing together!",
            "score": 0.9305190443992615
        },
        {
            "job_position": "Verilog Design Verification Engineer",
            "company_name": "YO IT CONSULTING",
            "job_description": "Hardware Design DeveloperExperience: 3 - 25 YearsLocation: - Permanent Remote anywhere in the WorldContract Length: 6 MonthsType: Full time contract(8 hrs/day) Overlap Hours: 4 hrs/day with PSTMandatory SkillsOverall - 5 years of exp.Min of 2 years of relevant experience in Hardware Design and/or Hardware VerificationExperience With One Or More On The List Below>ASIC>VLSI>FPGA>SOCExperience with one or more on the list below>SystemVerilog development>Verilog development>Testbench development and/or verification.Good communication skills in English.LLM experience is not mandatory, however, the candidate should be fine to work as a LLM Engineer for Verilog.Must-HaveBS or MS degree in Electrical, Engineering, or related field.3-5 years of proven experience in hardware design development.Expertise in HDLs such as Verilog, SystemVerilog, VHDL, and SystemC.Expertise in scripting, front-end and verification workflows, and integrations within the hardware design environment.Expertise in UVM environmentsExpertise in Formal VerificationExpertise in Lint process and refinementGood communication skills in EnglishJob DescriptionWe're searching for an exceptional hardware design Developer to play a pivotal role in using the hardware design platform to generate the training data to enhance enterprise LLMs' capabilities. This unique position offers the chance to directly contribute to the sophistication of enterprise LLMs, ensuring they operate with unparalleled efficiency and intelligence.Your MissionDevelop, configure, and customize the hardware design platform, utilizing it to generate vital training data for enterprise LLMs.Liaise with research teams to translate requirements into actionable data insights, directly impacting our LLMs' performance.Uphold the highest standards in coding, debugging, and documentation, ensuring the hardware design solutions are optimized for LLM training and benchmarking.Collaborate across teams to identify and prioritize needs, contributing to the LLMs' ability to understand and automate complex processes.We NeedBS or MS degree in Electrical, Engineering, or related field.3-5 years of proven experience in hardware design development.Expertise in HDLs such as Verilog, SystemVerilog, VHDL, and SystemC.Expertise in scripting, front-end and verification workflows, and integrations within the hardware design environment.Exceptional problem-solving, communication, and collaborative skills.Familiarity with ML and AI systemsSkills: ai systems,verilog-a,soc,communication skills,hdl expertise,formal verification,hdl,integrations within hardware design environment,vhdl,collaboration,lint process refinement,systemverilog development,verification,hdls,knowledge of ml and ai systems,integration,verification workflows,integrations in hardware design,communication,systemverilog,integrations,vlsi,fpga,lint process and refinement,hdls (verilog, systemverilog, vhdl, systemc),uvm environments,electronics hardware design,hardware design development,good communication skills,front-end,ai,hardware design,verilog development,systemc,hdls (vhdl, systemc),machine learning,lint process,front-end and verification workflows,scripting,coding,ml,front-end verification workflows,uvm,asic,front-end development,design,integration within hardware design environment,debugging,hardware verification,ml and ai systems,integrations within the hardware design environment,electrical engineering,verilog,problem-solving,familiarity with ml and ai systems,testbench development,documentation,collaborative skills,front-end workflows",
            "score": 0.926848292350769
        },
        {
            "job_position": "Systems Engineer - North Macedonia",
            "company_name": "Fortinet",
            "job_description": "Job DescriptionSystems Engineer – North MacedoniaLocation: Remote / North MacedoniaWhy Fortinet?Fortinet is one of the fastest-growing cybersecurity companies in the world. We have proven to be a truly innovative technology driven IT security Company. Fortinet’s mission is to deliver the most innovative, highest-performing network security fabric to secure and simplify IT infrastructures. Today we secure the largest enterprises, service providers and government organizations across the globe.Systems Engineering teamExperienced and passionate professionals, who lead all technical aspects of a sales cycle with the customer, from the initial RFIs, through to RFPs & RFQs when required. This includes the project management and active participation in POCs in partnership with the relevant teams both internally and within the customer and/or commercial partner.Your GoalsMaximize the Fortinet opportunity coverage and brand awareness in the market. Continuously improve knowledge around the Fortinet products and solutions, along with maintaining a deep understanding of the competitive landscape and Fortinet’s ability to provide long lasting protection against the ever-evolving threats. Position Fortinet solutions to the customer, whether this be remotely or in person.Develop relationships with key enterprise partnersAbout YouHave a high aptitude for security technology in network, endpoint and application areas. The CISSP accreditation would also be beneficial.Expert in the current technologies and trends in IT securitystrong understanding of RADIUS, PKI, IKE, Certificates, L2TP, IPSEC, FIREWALL, 802.1Q, MD5, SSH, SSL, SHA1, DES, 3DESAre currently or have previously worked in a pre-sales engineer role, managing end-to-end technical aspects of deals, through to technical closure.Can demonstrate your problem solving skills and how this impacted key wins within your current organization.Understand and can demonstrate your ability to build and maintain customer and partner relationships, including your ability to effectively communicate technically to a range of both external and internal stakeholdersWhat we offer?Competitive basic salary, uncapped commission with progressive multiplicators, employee stock and stock awards, health and welfare benefits.Flexible working approach, this is a field-based role, you can operate from anywhere in North MacedoniaEmpowering and supportive working environment, where you can be yourselfInnovative, collaborative and dynamic company with a double-digit growth over the last decade.Training on the job with many other formal trainings and industry recognized certifications.Our CommitmentFortinet is an equal opportunity employer. We value the diversity in our company, and all qualified applicants will receive consideration for employment without regard to race, colour, religion, gender, sexual orientation, gender identity, nationality in addition to any other applicable legally protected characteristics in the location in which the candidate is applying.",
            "score": 0.9254721999168396
        }
    ]
}