{
    "cv": {
        "full_name": "12045067",
        "skills": "Skills",
        "experience": "Experience",
        "education": "Education Bachelor of Science (BS) : Information Technology , 2005 University of Phoenix GPA: GPA: 3.67 Information Technology GPA: 3.67"
    },
    "top_cosine_jobs": [
        {
            "job_position": "Data Scientist - LLM",
            "company_name": "YO IT CONSULTING",
            "job_description": "Python Data Scientist/AnalystExperience: 4 - 20 YearsLocation: - Anywhere in the World - Permanent RemoteContract Duration:  6-12 monthsWork Hours: 5 hours overlap with PST time zoneStandard work hours are 8 AM PST - 4 PM PST.Must-HaveBachelor’s/Master’s degree in Engineering, Computer Science (or equivalent experience) At least 4 years of relevant experience as a data scientist 3+ years of data analysis experience and a desire to have a significant impact on the field of artificial intelligence 4+ years of experience working with Python programming.Fluent in conversational and written English communication skills.Job DescriptionWe are actively seeking talented Data Scientists & Analysts proficient in Python to join our ambitious team dedicated to pushing the frontiers of AI technology. This opportunity is tailored for professionals who thrive on developing innovative solutions and aspire to be at the forefront of AI advancements. You will work with companies in the US looking to develop cutting-edge commercial and research AI solutions.Job ResponsibilitiesWrite effective Python code to tackle complex issues, but also use your business sense and analytical abilities to glean valuable insights from public databases Communicate clearly with researchers and help the organization in realizing its objectives Clearly express the reasoning and logic when writing code in Jupyter notebooks, or other suitable mediums Fix bugs in the code and create thorough documentation Utilize extensive data analysis skills to develop and respond to important business queries using available datasets (such as those from Kaggle, the UN, the US government, etc.) Effectively communicate with the researchers to comprehend the needs and provide the resultsJob RequirementsBachelor’s/Master’s degree in Engineering, Computer Science (or equivalent experience) At least 4 years of relevant experience as a data scientist 3+ years of data analysis experience and a desire to have a significant impact on the field of artificial intelligence 4+ years of experience working with Python programming Strong data analytic abilities and business sense are required to draw the appropriate conclusions from the dataset, respond to those conclusions, and clearly convey the key findings Excellent problem-solving and analytical skills Excellent communication abilities to work with stakeholders and researchers successfully Fluent in conversational and written English communication skills Skills: computer science,problem-solving skills,bug fixing,spoken communication,conversational english communication skills,written english communication skills,data scientist,communication skills,problem-solving,us government datasets,python code,english communication,written english communication,stakeholder management,business sense,python code writing,data analysis,extensive data analysis,conversational english,analytical abilities,excellent communication abilities,engineering,data analysis skills,data,documentation,business queries,data analyst,communication abilities,artificial intelligence,data analytic abilities,coding,data science,un datasets,python,english communication skills,communication,written and conversational english communication,conversational english communication,kaggle datasets,bachelor’s/master’s degree in engineering,jupyter notebooks,stakeholder communication,analytical skills,data analytics,problem solving,ai technology,python programming,programming,data analytic,written communication",
            "score": 0.04848433784289587
        },
        {
            "job_position": "Senior Test Automation Engineer",
            "company_name": "Netcetera",
            "job_description": "We are a team of experts who work together to design and develop software that matters. Netcetera strongly believes in and supports continuous professional development. We care about our well-being. At Netcetera, we share our expertise, foster exchange, and appreciate different approaches. Respect, reliability, commitment, and professionalism define us. Our teams work with agile development methodologies and use the latest technology. Netcetera specialists are part of an extensive network within the IT industry.As a Senior Test Automation Engineer you'll work in a very dynamic team of professionals assuring that our software products gets maximum support and reliability. We're looking for a bright, talented, experienced and responsible individual with great technical background, but in the same time a team player and someone who can stood up for the new demanding challenges on a daily basis. The ideal candidate must be self-organizing, proactive, self-starter and able to seek out information.Looking for a new challenge? Take the next big step in your career!The job ad is valid until 31.12.2024Your role: Designing, developing, and refining of automated testsPlanning, implementation, and execution of tests in the Mobile Payment/Authentication areaExtending the existing automated test framework covering aspects like functional tests, error provocation, performance tests and high-availability testsEnsuring high test coverage using automated continues integration testsTesting, qualification and ensuring quality of the delivered team artifacts for all customer projectsPresenting status and issues in clear concise manner to appropriate levels in managementWorking in conjunction with Product Management, Operations team and other stakeholdersBe able to function in a matrix environment with multiple stake holder often with competing priorities and requirements and with strict timelinesEvaluating new testing tools and provide POCsRequirementsYour profile:Bachelor's or Master's degree in Computer science, Information Science or related educational area from an education institution with strong reputation8+ years overall IT experience involving:Agile Methodologies, ScrumTest Management ToolsContinuous Integration through Jenkins, CI/CDManual Testing, API Testing experienceTest Automation experience:Good programming skills with one or more programming languages (e.g. Java, Perl, Shell and Bash Scripting)Good knowledge of Java, Spring Boot, Hibernate, Apache MavenPerformance Testing experience is nice to haveGood knowledge of HTTP(S), JMS and other modern protocolsGit, Stash and BitbucketExperience with DevOps tools and workflows such as Jira, Bamboo or equivalentsKnowledge of cryptography, authentication and authorization schemes and protocolsGood knowledge of databases and SQLKnowledge of any Linux OS (e.g. CentOS) i.e. should be familiar with Linux OS server deployment, starting/stopping processes, checking logs, sound knowledge of Linux/Unix CommandLineHands on experience of using Tools like - SOAPUI, Postman, SQL Developer etcKnowledge of different testing types like Unit, Integration, Regression, Functional etcExcellent written communication skills, as well as verbal; must be able to articulate technical aspects of solution/services to business executives and customersProven experience working in a distributed team setup and/or international teamAbility to:Translate business requirements into use case or test case and plan test activitiesDrive strategy through influence with leadership qualities which engineers recognize and respectInnovate and lead explorations into new technologies and strategiesEvaluate new technologies or tools, stay abreast with industry trendsNice to have knowledge in some of the listed technologies:DockerCucumberMicroservicesBenefits Flexibility: Adjust your time to work efficiently, be it working hours, part-time options, home office, or unpaid leave Extra vacation days: Need to take some extra time off? With us, you have the possibility to activate 5 additional paid days per year on top of your vacation plan Private health & Family Insurance: The company policy covers a private health insurance plan for you and your family Yearly Education Fund: We strongly believe in continuous development and would love to see you enrich your knowledge. Ever Netceterian has a dedicated yearly fund to invest in their professional and personal development through conferences, courses, lectures or long-term education Meals & Snacks: Enjoy a lunch allowance each working day, free fruit and drinks in the officeDiscover more benefits",
            "score": 0.04742793033450174
        },
        {
            "job_position": "Data Scientist - LLM",
            "company_name": "YO IT Group",
            "job_description": "Python Data Scientist/AnalystExperience: 4 - 20 YearsLocation: - Anywhere in the World - Permanent RemoteContract Duration:  6-12 monthsWork Hours: 5 hours overlap with PST time zoneStandard work hours are 8 AM PST - 4 PM PST.Must-HaveBachelor’s/Master’s degree in Engineering, Computer Science (or equivalent experience) At least 4 years of relevant experience as a data scientist 3+ years of data analysis experience and a desire to have a significant impact on the field of artificial intelligence 4+ years of experience working with Python programming.Fluent in conversational and written English communication skills.Job DescriptionWe are actively seeking talented Data Scientists & Analysts proficient in Python to join our ambitious team dedicated to pushing the frontiers of AI technology. This opportunity is tailored for professionals who thrive on developing innovative solutions and aspire to be at the forefront of AI advancements. You will work with companies in the US looking to develop cutting-edge commercial and research AI solutions.Job ResponsibilitiesWrite effective Python code to tackle complex issues, but also use your business sense and analytical abilities to glean valuable insights from public databases Communicate clearly with researchers and help the organization in realizing its objectives Clearly express the reasoning and logic when writing code in Jupyter notebooks, or other suitable mediums Fix bugs in the code and create thorough documentation Utilize extensive data analysis skills to develop and respond to important business queries using available datasets (such as those from Kaggle, the UN, the US government, etc.) Effectively communicate with the researchers to comprehend the needs and provide the resultsJob RequirementsBachelor’s/Master’s degree in Engineering, Computer Science (or equivalent experience) At least 4 years of relevant experience as a data scientist 3+ years of data analysis experience and a desire to have a significant impact on the field of artificial intelligence 4+ years of experience working with Python programming Strong data analytic abilities and business sense are required to draw the appropriate conclusions from the dataset, respond to those conclusions, and clearly convey the key findings Excellent problem-solving and analytical skills Excellent communication abilities to work with stakeholders and researchers successfully Fluent in conversational and written English communication skills Skills: computer science,problem-solving skills,bug fixing,spoken communication,conversational english communication skills,written english communication skills,data scientist,communication skills,problem-solving,us government datasets,python code,english communication,written english communication,stakeholder management,business sense,python code writing,data analysis,extensive data analysis,conversational english,analytical abilities,excellent communication abilities,engineering,data analysis skills,data,documentation,business queries,data analyst,communication abilities,artificial intelligence,data analytic abilities,coding,data science,un datasets,python,english communication skills,communication,written and conversational english communication,conversational english communication,kaggle datasets,bachelor’s/master’s degree in engineering,jupyter notebooks,stakeholder communication,analytical skills,data analytics,problem solving,ai technology,python programming,programming,data analytic,written communication",
            "score": 0.04273618006357783
        }
    ],
    "top_bert_jobs": [
        {
            "job_position": "Remote AI Model-training Engineer (Part-time or Full time Contract)",
            "company_name": "Snaphyre",
            "job_description": "Our client is a pioneering AI data company that has been advancing the development of AI applications for nearly a decade. They specialize in enabling large-scale, high-quality data solutions that support cutting-edge fields like generative AI, autonomous systems and are focused on expanding their AI capabilities to support a wide range of evaluations for public and private sector clients.The RoleOur client is seeking skilled engineers to join their team in a contract role, with flexible options for part-time (minimum 20 hours per week) or full-time engagement. The role involves collecting, curating, and annotating AI data and code to train and evaluate AI models. In this role, you will review prompts and refine code as needed to ensure accurate, high-quality outputs. Your expertise will play a crucial part in enhancing response accuracy and improving overall system performance. This is a fantastic opportunity to work within a collaborative, dynamic environment and contribute to innovative projects.Ideal ProfileQualificationsThis role focuses on practical tech skills, emphasizing problem-solving and adaptability in delivering high-quality AI solutions. Our client is seeking skilled engineers with the following qualifications:Software Engineering Experience: A degree in Computer Science or a related field, with proficiency in programming languages like Java, C, C++, Python, Go, SQL, Node React, TypeScript, and/or MongoDB.Team Player: Experience in working with or managing teams in dynamic, fast-paced environments.Problem Solving & Communication: Strong English communication skills and an action-oriented mindset to tackle challenges effectively.Self-Motivated & Goal-Oriented: You can work independently, are goal-driven, and thrive in a fully remote team environment.Compensation: USD 15 - USD 25 per hour, depending on your skill set.Shortlisted candidates will be invited to participate in a one-hour coding challenge, followed by a final interview for successful applicants. This contract role offers flexible working hours, with options for part-time (minimum 20 hours per week) or full-time engagement.What's on Offer?Flexible working options ( min 20 hours a week part-time or full time role)Fully remote role Work within a pioneering, fast growing AI data company",
            "score": 0.6971004009246826
        },
        {
            "job_position": "Python Full Stack Developer",
            "company_name": "YO IT CONSULTING",
            "job_description": "Python Full Stack Developer -JavaScript/TypescriptExperience: 3 - 20 YearsLocation: - Anywhere in the World - Permanent RemoteContract Duration:  6-12 monthsOpportunity- Full Time, 8 hoursWork Hours: 5 hours overlap with the PST time zoneTotal Years Of exp- 3+ years experience Mandatory Skills-Python: min 3 yrs,JavaScript: min 3 yrs or Typescript: min 3 yrs,Nest.js: min 1 yr, or React: min 2 yrsRequired Skills3+ years of professional experience in PythonStrong SQL expertise with hands-on experience in database design, optimization, and management.2+ years of experience with Nest JS or other backend frameworks.Familiarity with AWS/GCP is a plus.Ability to work independently as well as collaboratively within a team.Strong problem-solving skills with a focus on delivering high-quality code.Nice to Have : Familiarity with front-end technologies (React or Angular) is a plus.Familiarity with Python for scripting data analysis is a plus.Excellent spoken and written English communication skillsJob DescriptionWe are seeking a full-stack engineer with a strong focus on backend development to join our growing team. In this role, you will be responsible for designing, developing, and maintaining high-performance software applications. Your expertise in Python and JavaScript (JS) will be crucial in building scalable and reliable backend systems.Ideal Candidate Profile3+ years of overall experienceEager to learn and grow within the company, with a proactive approach to personal and professional development.Reliable and consistent in delivering high-quality work.Strong communication skills and a collaborative mindset.Skills: sql,full stack development,css,gcp,javascript/typescript,html,python,nest.js,javascript,aws,angular,nestjs,react,typescript,aws/gcp",
            "score": 0.6971003413200378
        },
        {
            "job_position": "Sr Lua Developer",
            "company_name": "YO IT Group",
            "job_description": "LLM Lua DeveloperExperience: 3 - 20 YearsLocation- Permanent Remote Anywhere in the worldContract Duration: 6 - 12 MonthsOpportunity- Full Time, 8 hours, 5 hours Mandatory overlap with PSTTotal Years Of exp: 3+ years experienceMandatory Skills: min 3 yrs experience as a Lua DeveloperRequired Skills3+ years of experience as a Lua Developer or similar role Proficiency in Lua programming language.Solid understanding of software development principles and best practices.Experience with version control systems (e.g., Git).Strong problem-solving skills and attention to detail.Excellent communication and teamwork skills.Ability to work in a fast-paced and dynamic environment.Knowledge of using LLMs / AI for coding Nice To HaveExperience with game development or scripting in gaming engines or Embedded Systems or ML or DevOps.Familiarity with other programming languages such as Python, C++, or JavaScript.About RoleA NASDAQ-listed company that has effectively maintained its position as the front-runner technology sector, is looking to onboard a skilled Python developer keen is helping them expand the power of AI in the mobile coding ecosystem with the ultimate goal of creating new assisting AI-powered tools for the development domain. The company is developing the next generation of coding assisting agents, which will have a wide range of uses. For those who are keen to learn in a fast-paced setting, this is an exciting opportunity.Skills: lua programming,python,ml,llms / ai for coding,communication,problem solving,knowledge of llms / ai for coding,software engineers,c++,scripting,scripting in gaming engines,problem-solving skills,llms / ai,using llms / ai for coding,llms/ai for coding,embedded systems,knowledge of using llms / ai for coding,ai for coding,lua,communication skills,llms,version control systems (git),version control systems (e.g., git),javascript,knowledge of llms/ai,ai in coding,software development principles,fast-paced environment,git,problem-solving,llms / ai knowledge,game development,version control (git),machine learning,teamwork,embedded,teamwork skills,knowledge of llms / ai,attention to detail,version control systems,c,devops,software development,lua programming language,knowledge of llms/ai for coding,ai coding,ai",
            "score": 0.696191668510437
        }
    ]
}